Tag Tool [1.0.6040.37850]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...28991 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 2:40 PM.
Reading stringIDs...37422 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> echo REACH SNIPER MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, ported by dany5639 using shockfire's tool and camden's tagtool commands
REACH SNIPER MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, ported by dany5639 using shockfire's tool and camden's tagtool commands 
tags.dat> echo REACH SNIPER MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, ported by dany5639 using shockfire's tool and camden's tagtool commands
REACH SNIPER MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, ported by dany5639 using shockfire's tool and camden's tagtool commands 
tags.dat> echo

tags.dat> echo

tags.dat> echo REACH SNIPER MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, ported by dany5639 using shockfire's tool and camden's tagtool commands
REACH SNIPER MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, ported by dany5639 using shockfire's tool and camden's tagtool commands 
tags.dat> echo REACH SNIPER MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, ported by dany5639 using shockfire's tool and camden's tagtool commands
REACH SNIPER MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, ported by dany5639 using shockfire's tool and camden's tagtool commands 
tags.dat> 1F88
Unrecognized command: 1F88
Use "help" to list available commands.

tags.dat> 1F88
Unrecognized command: 1F88
Use "help" to list available commands.

tags.dat> 1F8D
Unrecognized command: 1F8D
Use "help" to list available commands.

tags.dat> 1F8D
Unrecognized command: 1F8D
Use "help" to list available commands.

tags.dat> 203C
Unrecognized command: 203C
Use "help" to list available commands.

tags.dat> 203C
Unrecognized command: 203C
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 713E
Unrecognized command: 713E
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 713F
Unrecognized command: 713F
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7140
Unrecognized command: 7140
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7141
Unrecognized command: 7141
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7142
Unrecognized command: 7142
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7143
Unrecognized command: 7143
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7144
Unrecognized command: 7144
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7145
Unrecognized command: 7145
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7146
Unrecognized command: 7146
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7147
Unrecognized command: 7147
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7148
Unrecognized command: 7148
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7149
Unrecognized command: 7149
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 714A
Unrecognized command: 714A
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 714B
Unrecognized command: 714B
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 714C
Unrecognized command: 714C
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 714D
Unrecognized command: 714D
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 714E
Unrecognized command: 714E
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 714F
Unrecognized command: 714F
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7150
Unrecognized command: 7150
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7151
Unrecognized command: 7151
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7152
Unrecognized command: 7152
Use "help" to list available commands.

tags.dat> echo REACH SNIPER MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, ported by dany5639 using shockfire's tool and camden's tagtool commands
REACH SNIPER MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, ported by dany5639 using shockfire's tool and camden's tagtool commands 
tags.dat> echo REACH SNIPER MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, ported by dany5639 using shockfire's tool and camden's tagtool commands
REACH SNIPER MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, ported by dany5639 using shockfire's tool and camden's tagtool commands 
tags.dat> 0F05
Unrecognized command: 0F05
Use "help" to list available commands.

tags.dat> 0F05
Unrecognized command: 0F05
Use "help" to list available commands.

tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> 

tags.dat> SetLocale US

tags.dat> 

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000713F [Offset = 0x7EF44F0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007140 [Offset = 0x7EF4690, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007141 [Offset = 0x7EF4830, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007142 [Offset = 0x7EF49D0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007143 [Offset = 0x7EF4B70, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007144 [Offset = 0x7EF4D10, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007145 [Offset = 0x7EF4EB0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007146 [Offset = 0x7EF5050, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007147 [Offset = 0x7EF51F0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007148 [Offset = 0x7EF5390, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007149 [Offset = 0x7EF5530, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000714A [Offset = 0x7EF56D0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000714B [Offset = 0x7EF5870, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000714C [Offset = 0x7EF5A10, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000714D [Offset = 0x7EF5BB0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000714E [Offset = 0x7EF5D50, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000714F [Offset = 0x7EF5EF0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007150 [Offset = 0x7EF6090, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007151 [Offset = 0x7EF6230, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007152 [Offset = 0x7EF63D0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007153 [Offset = 0x7EF6570, Size = 0x1A0]

tags.dat> 

tags.dat> import 1F8D tags/mode_HRSN.tag
Imported 0xD40 bytes.

tags.dat> importmodelraw 1F8D tags/HRSN.raw
Writing tag data...
Model imported successfully!

tags.dat> 

tags.dat> importbitmap 713E DDS/sniper_rifle_diffuse.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 0000713E [Offset = 0x7EF42A0, Size = 0x260]

tags.dat> importbitmap 713F DDS/sniper_rifle_normal.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 0000713F [Offset = 0x7EF4500, Size = 0x260]

tags.dat> importbitmap 7140 DDS/sniper_rifle_scope_alpha.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00007140 [Offset = 0x7EF4760, Size = 0x260]

tags.dat> importbitmap 7141 DDS/unsc_decals_diffuse.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00007141 [Offset = 0x7EF49C0, Size = 0x260]

tags.dat> importbitmap 7142 DDS/dither_pattern.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00007142 [Offset = 0x7EF4C20, Size = 0x260]

tags.dat> importbitmap 7143 DDS/pioneer_truck_paint_detail_diffuse.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00007143 [Offset = 0x7EF4E80, Size = 0x260]

tags.dat> importbitmap 7144 DDS/plasma_wipe.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00007144 [Offset = 0x7EF50E0, Size = 0x260]

tags.dat> importbitmap 7145 DDS/sniper_rifle_scope_illum.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00007145 [Offset = 0x7EF5340, Size = 0x260]

tags.dat> importbitmap 7146 DDS/gun_microbump.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00007146 [Offset = 0x7EF55A0, Size = 0x260]

tags.dat> importbitmap 7147 DDS/laptopillumdetail.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00007147 [Offset = 0x7EF5800, Size = 0x260]

tags.dat> importbitmap 7148 DDS/rubber.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00007148 [Offset = 0x7EF5A60, Size = 0x260]

tags.dat> importbitmap 7149 DDS/rubber_microbump.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00007149 [Offset = 0x7EF5CC0, Size = 0x260]

tags.dat> 

tags.dat> import 714A tagTemplates/205B_rmshTemplate 
Imported 0xAF0 bytes.

tags.dat> import 714B tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 714C tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 714D tagTemplates/101F_rmshTemplate
Imported 0x200 bytes.

tags.dat> import 714E tagTemplates/1F97_rmhgTemplate
Imported 0x7B0 bytes.

tags.dat> import 714F tagTemplates/1CA4_rmshTemplate
Imported 0x1D0 bytes.

tags.dat> import 7150 tagTemplates/0EEA_rmshTemplate
Imported 0x4D0 bytes.

tags.dat> import 7152 tagTemplates/1F99_rmshTemplate
Imported 0x340 bytes.

tags.dat> import 7151 tagTemplates/0F11_rmshTemplate
Imported 0x3D0 bytes.

tags.dat> 

tags.dat> edit 714A
Tag 0x0000714A.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x714A.shader> SpecifyBitmaps
Please enter the base_map index: 713E
Please enter the detail_map index: 0343
Please enter the bump_map index: 713F
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x714A.shader> exit

tags.dat> edit 714B
Tag 0x0000714B.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x714B.shader> SpecifyBitmaps
Please enter the base_map index: 713E
Please enter the detail_map index: 0343
Please enter the bump_map index: 713F
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x714B.shader> exit

tags.dat> edit 714C
Tag 0x0000714C.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x714C.shader> SpecifyBitmaps
Please enter the base_map index: 713E
Please enter the detail_map index: 0343
Please enter the bump_map index: 713F
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x714C.shader> exit

tags.dat> edit 714D
Tag 0x0000714D.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x714D.shader> SpecifyBitmaps
Please enter the base_map index: 713E
Please enter the detail_map index: 0343
Please enter the bump_map index: 0376
Done!

tags.dat\0x714D.shader> exit

tags.dat> edit 714E
Tag 0x0000714E.shader_halogram has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x714E.shader_halogram> SpecifyBitmaps
Please enter the base_map index: 0343
Please enter the detail_map index: 0343
Please enter the self_illum_map index: 0343
Please enter the overlay_map index: 0343
Please enter the overlay_detail_map index: 0379
Done!

tags.dat\0x714E.shader_halogram> exit

tags.dat> edit 714F
Tag 0x0000714F.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x714F.shader> SpecifyBitmaps
Please enter the base_map index: 7141
Please enter the detail_map index: 0343
Done!

tags.dat\0x714F.shader> exit

tags.dat> edit 7150
Tag 0x00007150.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7150.shader> SpecifyBitmaps
Please enter the self_illum_map index: 0F05
Done!

tags.dat\0x7150.shader> exit

tags.dat> edit 7151
Tag 0x00007151.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7151.shader> SpecifyBitmaps
Please enter the self_illum_map index: 7145
Done!

tags.dat\0x7151.shader> exit

tags.dat> 

tags.dat> edit 714A
Tag 0x0000714A.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x714A.shader> edit ShaderProperties[0]

tags.dat\0x714A.shader\ShaderProperties[0]> SetField arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x714A.shader\ShaderProperties[0]> SetField arguments[07].arg1 0.2
Arg1: Single = 0.2

tags.dat\0x714A.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.1
Arg1: Single = 0.1

tags.dat\0x714A.shader\ShaderProperties[0]> Setfield arguments[19].arg1 0.0
Arg1: Single = 0

tags.dat\0x714A.shader\ShaderProperties[0]> SetField Arguments[25].arg1 1.0
Arg1: Single = 1

tags.dat\0x714A.shader\ShaderProperties[0]> SetField Arguments[25].arg2 1.0
Arg2: Single = 1

tags.dat\0x714A.shader\ShaderProperties[0]> SetField Arguments[25].arg3 1.0
Arg3: Single = 1

tags.dat\0x714A.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.0
Arg1: Single = 0

tags.dat\0x714A.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x714A.shader\ShaderProperties[0]> SetField arguments[28].arg3 0.0
Arg3: Single = 0

tags.dat\0x714A.shader\ShaderProperties[0]> SetField arguments[29].arg1 0.0
Arg1: Single = 0

tags.dat\0x714A.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x714A.shader\ShaderProperties[0]> exit

tags.dat\0x714A.shader> exit

tags.dat> edit 714B
Tag 0x0000714B.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x714B.shader> edit ShaderProperties[0]

tags.dat\0x714B.shader\ShaderProperties[0]> SetField arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x714B.shader\ShaderProperties[0]> SetField arguments[07].arg1 0.2
Arg1: Single = 0.2

tags.dat\0x714B.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.1
Arg1: Single = 0.1

tags.dat\0x714B.shader\ShaderProperties[0]> Setfield arguments[19].arg1 0.0
Arg1: Single = 0

tags.dat\0x714B.shader\ShaderProperties[0]> SetField Arguments[25].arg1 1.0
Arg1: Single = 1

tags.dat\0x714B.shader\ShaderProperties[0]> SetField Arguments[25].arg2 1.0
Arg2: Single = 1

tags.dat\0x714B.shader\ShaderProperties[0]> SetField Arguments[25].arg3 1.0
Arg3: Single = 1

tags.dat\0x714B.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.0
Arg1: Single = 0

tags.dat\0x714B.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x714B.shader\ShaderProperties[0]> SetField arguments[28].arg3 0.0
Arg3: Single = 0

tags.dat\0x714B.shader\ShaderProperties[0]> SetField arguments[29].arg1 0.0
Arg1: Single = 0

tags.dat\0x714B.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x714B.shader\ShaderProperties[0]> exit

tags.dat\0x714B.shader> exit

tags.dat> edit 714C
Tag 0x0000714C.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x714C.shader> edit ShaderProperties[0]

tags.dat\0x714C.shader\ShaderProperties[0]> SetField arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x714C.shader\ShaderProperties[0]> SetField arguments[07].arg1 0.2
Arg1: Single = 0.2

tags.dat\0x714C.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.1
Arg1: Single = 0.1

tags.dat\0x714C.shader\ShaderProperties[0]> Setfield arguments[19].arg1 0.0
Arg1: Single = 0

tags.dat\0x714C.shader\ShaderProperties[0]> SetField Arguments[25].arg1 1.0
Arg1: Single = 1

tags.dat\0x714C.shader\ShaderProperties[0]> SetField Arguments[25].arg2 1.0
Arg2: Single = 1

tags.dat\0x714C.shader\ShaderProperties[0]> SetField Arguments[25].arg3 1.0
Arg3: Single = 1

tags.dat\0x714C.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.0
Arg1: Single = 0

tags.dat\0x714C.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x714C.shader\ShaderProperties[0]> SetField arguments[28].arg3 0.0
Arg3: Single = 0

tags.dat\0x714C.shader\ShaderProperties[0]> SetField arguments[29].arg1 0.0
Arg1: Single = 0

tags.dat\0x714C.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x714C.shader\ShaderProperties[0]> exit

tags.dat\0x714C.shader> exit

tags.dat> edit 714E
Tag 0x0000714E.shader_halogram has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x714E.shader_halogram> edit ShaderProperties[0]

tags.dat\0x714E.shader_halogram\ShaderProperties[0]> SetField arguments[03].arg1 0.6
Arg1: Single = 0.6

tags.dat\0x714E.shader_halogram\ShaderProperties[0]> SetField arguments[03].arg2 1.0
Arg2: Single = 1

tags.dat\0x714E.shader_halogram\ShaderProperties[0]> SetField arguments[03].arg3 0.2
Arg3: Single = 0.2

tags.dat\0x714E.shader_halogram\ShaderProperties[0]> SetField arguments[03].arg4 1.0
Arg4: Single = 1

tags.dat\0x714E.shader_halogram\ShaderProperties[0]> SetField arguments[04].arg1 0.2
Arg1: Single = 0.2

tags.dat\0x714E.shader_halogram\ShaderProperties[0]> SetField arguments[04].arg2 0.5
Arg2: Single = 0.5

tags.dat\0x714E.shader_halogram\ShaderProperties[0]> SetField arguments[04].arg3 0.1
Arg3: Single = 0.1

tags.dat\0x714E.shader_halogram\ShaderProperties[0]> savechanges
Done!

tags.dat\0x714E.shader_halogram\ShaderProperties[0]> exit

tags.dat\0x714E.shader_halogram> exit

tags.dat> edit 7150
Tag 0x00007150.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7150.shader> edit ShaderProperties[0]

tags.dat\0x7150.shader\ShaderProperties[0]> SetField Arguments[01].arg4 1.0
Arg4: Single = 1

tags.dat\0x7150.shader\ShaderProperties[0]> SetField Arguments[02].arg1 0.5
Arg1: Single = 0.5

tags.dat\0x7150.shader\ShaderProperties[0]> SetField Arguments[02].arg2 0.8
Arg2: Single = 0.8

tags.dat\0x7150.shader\ShaderProperties[0]> SetField Arguments[02].arg3 0
Arg3: Single = 0

tags.dat\0x7150.shader\ShaderProperties[0]> SetField Arguments[03].arg1 1
Arg1: Single = 1

tags.dat\0x7150.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x7150.shader\ShaderProperties[0]> exit

tags.dat\0x7150.shader> exit

tags.dat> edit 7151
Tag 0x00007151.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7151.shader> edit ShaderProperties[0]

tags.dat\0x7151.shader\ShaderProperties[0]> SetField arguments[01].arg1 -1.5
Arg1: Single = -1.5

tags.dat\0x7151.shader\ShaderProperties[0]> SetField arguments[01].arg2 -1.0
Arg2: Single = -1

tags.dat\0x7151.shader\ShaderProperties[0]> SetField arguments[01].arg3 0.30 
Arg3: Single = 0.3

tags.dat\0x7151.shader\ShaderProperties[0]> SetField arguments[02].arg1 0.50
Arg1: Single = 0.5

tags.dat\0x7151.shader\ShaderProperties[0]> SetField arguments[02].arg2 0.80
Arg2: Single = 0.8

tags.dat\0x7151.shader\ShaderProperties[0]> SetField arguments[02].arg3 0.10
Arg3: Single = 0.1

tags.dat\0x7151.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x7151.shader\ShaderProperties[0]> exit

tags.dat\0x7151.shader> exit

tags.dat> edit 7152
Tag 0x00007152.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7152.shader> edit ShaderProperties[0]

tags.dat\0x7152.shader\ShaderProperties[0]> SetField arguments[00].arg2 -1
Arg2: Single = -1

tags.dat\0x7152.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x7152.shader\ShaderProperties[0]> exit

tags.dat\0x7152.shader> exit

tags.dat> 

tags.dat> edit 1F8D
Tag 0x00001F8D.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1F8D.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 714A
Please enter the replacement 0000101F index: 714B
Please enter the replacement 0000101F index: 714C
Please enter the replacement 0000101F index: 714D
Please enter the replacement 0000101F index: 714E
Please enter the replacement 0000101F index: 714F
Please enter the replacement 0000101F index: 7150
Please enter the replacement 0000101F index: 7151
Please enter the replacement 0000101F index: 7152
Done!

tags.dat\0x1F8D.render_model> exitTo tags.dat

tags.dat> edit 203C
Tag 0x0000203C.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x203C.render_model> SpecifyShaders
Please enter the replacement 00001F95 index: 714A
Please enter the replacement 00001F96 index: 714B
Please enter the replacement 00002041 index: 714C
Please enter the replacement 00002042 index: 714D
Please enter the replacement 00002043 index: 714E
Done!

tags.dat\0x203C.render_model> 714F
Unrecognized command: 714F
Use "help" to list available commands.

tags.dat\0x203C.render_model> 7150
Unrecognized command: 7150
Use "help" to list available commands.

tags.dat\0x203C.render_model> 7151
Unrecognized command: 7151
Use "help" to list available commands.

tags.dat\0x203C.render_model> 7152
Unrecognized command: 7152
Use "help" to list available commands.

tags.dat\0x203C.render_model> exitTo tags.dat

tags.dat> 

tags.dat> edit 1F8D
Tag 0x00001F8D.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1F8D.render_model> SetField geometry.compression[0].TextureMinV 0.006113529
TextureMinV: Single = 0.006113529

tags.dat\0x1F8D.render_model> SetField geometry.compression[0].TextureMaxV -1
TextureMaxV: Single = -1

tags.dat\0x1F8D.render_model> savechanges
Done!

tags.dat\0x1F8D.render_model> exit

tags.dat> 

tags.dat> edit 1F8D
Tag 0x00001F8D.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1F8D.render_model> edit nodes[0]

tags.dat\0x1F8D.render_model\nodes[0]> SetField Name gun
Name: StringID = gun

tags.dat\0x1F8D.render_model\nodes[0]> SetField ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x1F8D.render_model\nodes[0]> SetField FirstChildNode 1
FirstChildNode: Int16 = 1

tags.dat\0x1F8D.render_model\nodes[0]> SetField NextSiblingNode -1
NextSiblingNode: Int16 = -1

tags.dat\0x1F8D.render_model\nodes[0]> SetField ImportNode 0
ImportNode: Int16 = 0

tags.dat\0x1F8D.render_model\nodes[0]> SetField DefaultTranslation 0 0 0
DefaultTranslation: Vector3 = { X: 0, Y: 0, Z: 0 }

tags.dat\0x1F8D.render_model\nodes[0]> SetField DefaultRotation 0 0 0 1
DefaultRotation: Vector4 = 0, 0, 0, 1

tags.dat\0x1F8D.render_model\nodes[0]> SetField DefaultScale 1
DefaultScale: Single = 1

tags.dat\0x1F8D.render_model\nodes[0]> SetField InverseForward 1 0 0
InverseForward: Vector3 = { X: 1, Y: 0, Z: 0 }

tags.dat\0x1F8D.render_model\nodes[0]> SetField InverseLeft 0 1 0
InverseLeft: Vector3 = { X: 0, Y: 1, Z: 0 }

tags.dat\0x1F8D.render_model\nodes[0]> SetField InverseUp 0 0 1
InverseUp: Vector3 = { X: 0, Y: 0, Z: 1 }

tags.dat\0x1F8D.render_model\nodes[0]> SetField DistanceFromParent 0
DistanceFromParent: Single = 0

tags.dat\0x1F8D.render_model\nodes[0]> exit

tags.dat\0x1F8D.render_model> edit nodes[1]

tags.dat\0x1F8D.render_model\nodes[1]> SetField Name magazine
Name: StringID = magazine

tags.dat\0x1F8D.render_model\nodes[1]> SetField ParentNode 0
ParentNode: Int16 = 0

tags.dat\0x1F8D.render_model\nodes[1]> SetField FirstChildNode 5
FirstChildNode: Int16 = 5

tags.dat\0x1F8D.render_model\nodes[1]> SetField NextSiblingNode 4
NextSiblingNode: Int16 = 4

tags.dat\0x1F8D.render_model\nodes[1]> SetField ImportNode 0
ImportNode: Int16 = 0

tags.dat\0x1F8D.render_model\nodes[1]> SetField DefaultTranslation 0.007945799 0 -0.05236648
DefaultTranslation: Vector3 = { X: 0.007945799, Y: 0, Z: -0.05236648 }

tags.dat\0x1F8D.render_model\nodes[1]> SetField DefaultRotation 0 0 0 -1
DefaultRotation: Vector4 = 0, 0, 0, -1

tags.dat\0x1F8D.render_model\nodes[1]> SetField DefaultScale 1
DefaultScale: Single = 1

tags.dat\0x1F8D.render_model\nodes[1]> SetField InverseForward 1 0 0
InverseForward: Vector3 = { X: 1, Y: 0, Z: 0 }

tags.dat\0x1F8D.render_model\nodes[1]> SetField InverseLeft 0 1 0
InverseLeft: Vector3 = { X: 0, Y: 1, Z: 0 }

tags.dat\0x1F8D.render_model\nodes[1]> SetField InverseUp 0 0 1
InverseUp: Vector3 = { X: 0, Y: 0, Z: 1 }

tags.dat\0x1F8D.render_model\nodes[1]> SetField DistanceFromParent 0.05296588
DistanceFromParent: Single = 0.05296588

tags.dat\0x1F8D.render_model\nodes[1]> exit

tags.dat\0x1F8D.render_model> edit nodes[2]

tags.dat\0x1F8D.render_model\nodes[2]> SetField Name handle
Name: StringID = handle

tags.dat\0x1F8D.render_model\nodes[2]> SetField ParentNode 0
ParentNode: Int16 = 0

tags.dat\0x1F8D.render_model\nodes[2]> SetField FirstChildNode -1
FirstChildNode: Int16 = -1

tags.dat\0x1F8D.render_model\nodes[2]> SetField NextSiblingNode 3
NextSiblingNode: Int16 = 3

tags.dat\0x1F8D.render_model\nodes[2]> SetField ImportNode 0
ImportNode: Int16 = 0

tags.dat\0x1F8D.render_model\nodes[2]> SetField DefaultTranslation 0.1238121 -1.2603E-08 -0.005714185
DefaultTranslation: Vector3 = { X: 0.1238121, Y: -1.2603E-08, Z: -0.005714185 }

tags.dat\0x1F8D.render_model\nodes[2]> SetField DefaultRotation 0 0 0 -1
DefaultRotation: Vector4 = 0, 0, 0, -1

tags.dat\0x1F8D.render_model\nodes[2]> SetField DefaultScale 1
DefaultScale: Single = 1

tags.dat\0x1F8D.render_model\nodes[2]> SetField InverseForward 1 0 0
InverseForward: Vector3 = { X: 1, Y: 0, Z: 0 }

tags.dat\0x1F8D.render_model\nodes[2]> SetField InverseLeft 0 1 0
InverseLeft: Vector3 = { X: 0, Y: 1, Z: 0 }

tags.dat\0x1F8D.render_model\nodes[2]> SetField InverseUp 0 0 1
InverseUp: Vector3 = { X: 0, Y: 0, Z: 1 }

tags.dat\0x1F8D.render_model\nodes[2]> SetField DistanceFromParent 0.1239439
DistanceFromParent: Single = 0.1239439

tags.dat\0x1F8D.render_model\nodes[2]> exit

tags.dat\0x1F8D.render_model> edit nodes[3]

tags.dat\0x1F8D.render_model\nodes[3]> SetField Name bipod
Name: StringID = bipod

tags.dat\0x1F8D.render_model\nodes[3]> SetField ParentNode 0
ParentNode: Int16 = 0

tags.dat\0x1F8D.render_model\nodes[3]> SetField FirstChildNode -1
FirstChildNode: Int16 = -1

tags.dat\0x1F8D.render_model\nodes[3]> SetField NextSiblingNode 2
NextSiblingNode: Int16 = 2

tags.dat\0x1F8D.render_model\nodes[3]> SetField ImportNode 0
ImportNode: Int16 = 0

tags.dat\0x1F8D.render_model\nodes[3]> SetField DefaultTranslation 0.1237175 -1.1239E-08 -0.01989291
DefaultTranslation: Vector3 = { X: 0.1237175, Y: -1.1239E-08, Z: -0.01989291 }

tags.dat\0x1F8D.render_model\nodes[3]> SetField DefaultRotation 0 0 0 -1
DefaultRotation: Vector4 = 0, 0, 0, -1

tags.dat\0x1F8D.render_model\nodes[3]> SetField DefaultScale 1
DefaultScale: Single = 1

tags.dat\0x1F8D.render_model\nodes[3]> SetField InverseForward 1 0 0
InverseForward: Vector3 = { X: 1, Y: 0, Z: 0 }

tags.dat\0x1F8D.render_model\nodes[3]> SetField InverseLeft 0 1 0
InverseLeft: Vector3 = { X: 0, Y: 1, Z: 0 }

tags.dat\0x1F8D.render_model\nodes[3]> SetField InverseUp 0 0 1
InverseUp: Vector3 = { X: 0, Y: 0, Z: 1 }

tags.dat\0x1F8D.render_model\nodes[3]> SetField DistanceFromParent 0.1253067
DistanceFromParent: Single = 0.1253067

tags.dat\0x1F8D.render_model\nodes[3]> exit

tags.dat\0x1F8D.render_model> edit nodes[4]

tags.dat\0x1F8D.render_model\nodes[4]> SetField Name ophandle
Name: StringID = ophandle

tags.dat\0x1F8D.render_model\nodes[4]> SetField ParentNode 0
ParentNode: Int16 = 0

tags.dat\0x1F8D.render_model\nodes[4]> SetField FirstChildNode -1
FirstChildNode: Int16 = -1

tags.dat\0x1F8D.render_model\nodes[4]> SetField NextSiblingNode -1
NextSiblingNode: Int16 = -1

tags.dat\0x1F8D.render_model\nodes[4]> SetField ImportNode 0
ImportNode: Int16 = 0

tags.dat\0x1F8D.render_model\nodes[4]> SetField DefaultTranslation 0.02226 0.01285793 0.005061603
DefaultTranslation: Vector3 = { X: 0.02226, Y: 0.01285793, Z: 0.005061603 }

tags.dat\0x1F8D.render_model\nodes[4]> SetField DefaultRotation 0 0 0 -1
DefaultRotation: Vector4 = 0, 0, 0, -1

tags.dat\0x1F8D.render_model\nodes[4]> SetField DefaultScale 1
DefaultScale: Single = 1

tags.dat\0x1F8D.render_model\nodes[4]> SetField InverseForward 1 0 0
InverseForward: Vector3 = { X: 1, Y: 0, Z: 0 }

tags.dat\0x1F8D.render_model\nodes[4]> SetField InverseLeft 0 1 0
InverseLeft: Vector3 = { X: 0, Y: 1, Z: 0 }

tags.dat\0x1F8D.render_model\nodes[4]> SetField InverseUp 0 0 1
InverseUp: Vector3 = { X: 0, Y: 0, Z: 1 }

tags.dat\0x1F8D.render_model\nodes[4]> SetField DistanceFromParent 0.02620027
DistanceFromParent: Single = 0.02620027

tags.dat\0x1F8D.render_model\nodes[4]> exit

tags.dat\0x1F8D.render_model> edit nodes[5]

tags.dat\0x1F8D.render_model\nodes[5]> SetField Name bullet
Name: StringID = bullet

tags.dat\0x1F8D.render_model\nodes[5]> SetField ParentNode 3
ParentNode: Int16 = 3

tags.dat\0x1F8D.render_model\nodes[5]> SetField FirstChildNode -1
FirstChildNode: Int16 = -1

tags.dat\0x1F8D.render_model\nodes[5]> SetField NextSiblingNode -1
NextSiblingNode: Int16 = -1

tags.dat\0x1F8D.render_model\nodes[5]> SetField ImportNode 0
ImportNode: Int16 = 0

tags.dat\0x1F8D.render_model\nodes[5]> SetField DefaultTranslation 0.00300643 -2.24E-10 0.04635167
DefaultTranslation: Vector3 = { X: 0.00300643, Y: -2.24E-10, Z: 0.04635167 }

tags.dat\0x1F8D.render_model\nodes[5]> SetField DefaultRotation 0 0 0 -1
DefaultRotation: Vector4 = 0, 0, 0, -1

tags.dat\0x1F8D.render_model\nodes[5]> SetField DefaultScale 1
DefaultScale: Single = 1

tags.dat\0x1F8D.render_model\nodes[5]> SetField InverseForward 1 0 0
InverseForward: Vector3 = { X: 1, Y: 0, Z: 0 }

tags.dat\0x1F8D.render_model\nodes[5]> SetField InverseLeft 0 1 0
InverseLeft: Vector3 = { X: 0, Y: 1, Z: 0 }

tags.dat\0x1F8D.render_model\nodes[5]> SetField InverseUp 0 0 1
InverseUp: Vector3 = { X: 0, Y: 0, Z: 1 }

tags.dat\0x1F8D.render_model\nodes[5]> SetField DistanceFromParent 0.04644907
DistanceFromParent: Single = 0.04644907

tags.dat\0x1F8D.render_model\nodes[5]> exit

tags.dat\0x1F8D.render_model> SetField Nodes[0].InversePosition -0.07 0 -0.045
InversePosition: Vector3 = { X: -0.07, Y: 0, Z: -0.045 }

tags.dat\0x1F8D.render_model> SetField Nodes[1].InversePosition -0.077945799 0 0.00736648
InversePosition: Vector3 = { X: -0.0779458, Y: 0, Z: 0.00736648 }

tags.dat\0x1F8D.render_model> SetField Nodes[2].InversePosition -0.1938121 1.2603e-08 -0.039285815
InversePosition: Vector3 = { X: -0.1938121, Y: 1.2603E-08, Z: -0.03928582 }

tags.dat\0x1F8D.render_model> SetField Nodes[3].InversePosition -0.1937175 1.1239e-08 -0.02510709
InversePosition: Vector3 = { X: -0.1937175, Y: 1.1239E-08, Z: -0.02510709 }

tags.dat\0x1F8D.render_model> SetField Nodes[4].InversePosition -0.09226 -0.01285793 -0.050061603
InversePosition: Vector3 = { X: -0.09226, Y: -0.01285793, Z: -0.0500616 }

tags.dat\0x1F8D.render_model> SetField Nodes[5].InversePosition -0.08095223 2.24e-10 -0.038985187
InversePosition: Vector3 = { X: -0.08095223, Y: 2.24E-10, Z: -0.03898519 }

tags.dat\0x1F8D.render_model> SetField markergroups[0].markers[0].RegionIndex -1
RegionIndex: SByte = -1

tags.dat\0x1F8D.render_model> SetField markergroups[0].markers[0].PermutationIndex -1
PermutationIndex: SByte = -1

tags.dat\0x1F8D.render_model> SetField markergroups[0].markers[0].Translation 0.06916446 -0.003040792 -0.02955528
Translation: Vector3 = { X: 0.06916446, Y: -0.003040792, Z: -0.02955528 }

tags.dat\0x1F8D.render_model> SetField markergroups[0].markers[0].Rotation -0.6945807 0.150886 -0.3370411 0.6174093
Rotation: Vector4 = -0.6945807, 0.150886, -0.3370411, 0.6174093

tags.dat\0x1F8D.render_model> SetField markergroups[0].markers[0].Scale 0
Scale: Single = 0

tags.dat\0x1F8D.render_model> savechanges
Done!

tags.dat\0x1F8D.render_model> exit

tags.dat> 

tags.dat> extract 1F8D tempTag
Wrote 0xD60 bytes to tempTag.
The tag's main struct will be at offset 0xB90.

tags.dat> import 203C tempTag
Imported 0xD60 bytes.

tags.dat> 

tags.dat> edit 1F88
Tag 0x00001F88.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1F88.model> removefrom Nodes 0 *
Successfully removed 4 elements from Nodes at index 0: List`1<Node>
null

tags.dat\0x1F88.model> AddTo Nodes
Successfully added 1 element to Nodes: List`1<Node>
{...}[1]

tags.dat\0x1F88.model> edit Nodes[*]

tags.dat\0x1F88.model\Nodes[0]> SetField Name gun
Name: StringID = gun

tags.dat\0x1F88.model\Nodes[0]> SetField ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x1F88.model\Nodes[0]> SetField FirstChildNode -1
FirstChildNode: Int16 = -1

tags.dat\0x1F88.model\Nodes[0]> exit

tags.dat\0x1F88.model> AddTo Nodes
Successfully added 1 element to Nodes: List`1<Node>
{...}[2]

tags.dat\0x1F88.model> edit Nodes[*]

tags.dat\0x1F88.model\Nodes[1]> SetField Name magazine
Name: StringID = magazine

tags.dat\0x1F88.model\Nodes[1]> SetField ParentNode 0
ParentNode: Int16 = 0

tags.dat\0x1F88.model\Nodes[1]> SetField FirstChildNode -1
FirstChildNode: Int16 = -1

tags.dat\0x1F88.model\Nodes[1]> exit

tags.dat\0x1F88.model> AddTo Nodes
Successfully added 1 element to Nodes: List`1<Node>
{...}[3]

tags.dat\0x1F88.model> edit Nodes[*]

tags.dat\0x1F88.model\Nodes[2]> SetField Name handle
Name: StringID = handle

tags.dat\0x1F88.model\Nodes[2]> SetField ParentNode 0
ParentNode: Int16 = 0

tags.dat\0x1F88.model\Nodes[2]> SetField FirstChildNode -1
FirstChildNode: Int16 = -1

tags.dat\0x1F88.model\Nodes[2]> exit

tags.dat\0x1F88.model> AddTo Nodes
Successfully added 1 element to Nodes: List`1<Node>
{...}[4]

tags.dat\0x1F88.model> edit Nodes[*]

tags.dat\0x1F88.model\Nodes[3]> SetField Name bipod
Name: StringID = bipod

tags.dat\0x1F88.model\Nodes[3]> SetField ParentNode 0
ParentNode: Int16 = 0

tags.dat\0x1F88.model\Nodes[3]> SetField FirstChildNode -1
FirstChildNode: Int16 = -1

tags.dat\0x1F88.model\Nodes[3]> exit

tags.dat\0x1F88.model> AddTo Nodes
Successfully added 1 element to Nodes: List`1<Node>
{...}[5]

tags.dat\0x1F88.model> edit Nodes[*]

tags.dat\0x1F88.model\Nodes[4]> SetField Name ophandle
Name: StringID = ophandle

tags.dat\0x1F88.model\Nodes[4]> SetField ParentNode 0
ParentNode: Int16 = 0

tags.dat\0x1F88.model\Nodes[4]> SetField FirstChildNode -1
FirstChildNode: Int16 = -1

tags.dat\0x1F88.model\Nodes[4]> exit

tags.dat\0x1F88.model> AddTo Nodes
Successfully added 1 element to Nodes: List`1<Node>
{...}[6]

tags.dat\0x1F88.model> edit Nodes[*]

tags.dat\0x1F88.model\Nodes[5]> SetField Name bullet
Name: StringID = bullet

tags.dat\0x1F88.model\Nodes[5]> SetField ParentNode 0
ParentNode: Int16 = 0

tags.dat\0x1F88.model\Nodes[5]> SetField FirstChildNode -1
FirstChildNode: Int16 = -1

tags.dat\0x1F88.model\Nodes[5]> exit

tags.dat\0x1F88.model> savechanges
Done!

tags.dat\0x1F88.model> exit

tags.dat> 

tags.dat> edit 203C
Tag 0x0000203C.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x203C.render_model> echo RemoveFrom Nodes 4 *
RemoveFrom Nodes 4 * 
tags.dat\0x203C.render_model> SetField MarkerGroups[10].Markers[0].Translation 0 -5.960464E-10 0.01
Translation: Vector3 = { X: 0, Y: -5.960464E-10, Z: 0.01 }

tags.dat\0x203C.render_model> SetField MarkerGroups[00].Markers[0].NodeIndex 1
NodeIndex: SByte = 1

tags.dat\0x203C.render_model> SetField MarkerGroups[00].Markers[0].Translation 0.05 -0.01 0.02
Translation: Vector3 = { X: 0.05, Y: -0.01, Z: 0.02 }

tags.dat\0x203C.render_model> SetField MarkerGroups[00].Markers[0].Rotation -0.5548693 0.4255136 -0.4678792 0.5405067
Rotation: Vector4 = -0.5548693, 0.4255136, -0.4678792, 0.5405067

tags.dat\0x203C.render_model> SetField Nodes[0].InversePosition 0 0 0
InversePosition: Vector3 = { X: 0, Y: 0, Z: 0 }

tags.dat\0x203C.render_model> SetField Nodes[1].InversePosition -0.07 0 0
InversePosition: Vector3 = { X: -0.07, Y: 0, Z: 0 }

tags.dat\0x203C.render_model> SetField Nodes[2].InversePosition -0.185 0 -0.038
InversePosition: Vector3 = { X: -0.185, Y: 0, Z: -0.038 }

tags.dat\0x203C.render_model> SetField Nodes[3].InversePosition -0.189 0 -0.025
InversePosition: Vector3 = { X: -0.189, Y: 0, Z: -0.025 }

tags.dat\0x203C.render_model> SetField Nodes[4].InversePosition -0.087 -0.012 -0.05
InversePosition: Vector3 = { X: -0.087, Y: -0.012, Z: -0.05 }

tags.dat\0x203C.render_model> SetField Nodes[5].InversePosition -0.08 0 -0.05
InversePosition: Vector3 = { X: -0.08, Y: 0, Z: -0.05 }

tags.dat\0x203C.render_model> savechanges
Done!

tags.dat\0x203C.render_model> exit

tags.dat> 

tags.dat> echo Patch for Flatgrass
Patch for Flatgrass 
tags.dat> dep remove 6E23 6E09

tags.dat> dep remove 6E23 6E08 

tags.dat> 

tags.dat> edit 6E07
Tag 0x00006E07.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x6E07.model> SetField rendermodel 203C
RenderModel: TagInstance = 0x0000203C

tags.dat\0x6E07.model> savechanges
Done!

tags.dat\0x6E07.model> exitTo tags.dat

tags.dat> 

tags.dat> edit 6E06
Tag 0x00006E06.weapon has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x6E06.weapon> SetField FirstPerson[0].FirstPersonModel 1F8D
FirstPersonModel: TagInstance = 0x00001F8D

tags.dat\0x6E06.weapon> SetField FirstPerson[1].FirstPersonModel 1F8D
FirstPersonModel: TagInstance = 0x00001F8D

tags.dat\0x6E06.weapon> savechanges
Done!

tags.dat\0x6E06.weapon> exitTo tags.dat

tags.dat> 

tags.dat> echo A few errors will pop above if you don't have Flatgrass mod. Ignore.
A few errors will pop above if you don't have Flatgrass mod. Ignore. 
tags.dat> 

tags.dat> dumplog reachSniper.log
