Tag Tool [1.0.6040.37850]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...23411 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 2:40 PM.
Reading stringIDs...39505 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B72
Unrecognized command: 5B72
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B73
Unrecognized command: 5B73
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B74
Unrecognized command: 5B74
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B75
Unrecognized command: 5B75
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B76
Unrecognized command: 5B76
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B77
Unrecognized command: 5B77
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B78
Unrecognized command: 5B78
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B79
Unrecognized command: 5B79
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B7A
Unrecognized command: 5B7A
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B7B
Unrecognized command: 5B7B
Use "help" to list available commands.

tags.dat> 1EFB
Unrecognized command: 1EFB
Use "help" to list available commands.

tags.dat> 1EFB
Unrecognized command: 1EFB
Use "help" to list available commands.

tags.dat> 1F3F
Unrecognized command: 1F3F
Use "help" to list available commands.

tags.dat> 1F3F
Unrecognized command: 1F3F
Use "help" to list available commands.

tags.dat> echo Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1) 
tags.dat> echo Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1) 
tags.dat> echo

tags.dat> echo

tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> 

tags.dat> SetLocale US

tags.dat> 

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B73 [Offset = 0x62B50E0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B74 [Offset = 0x62B5160, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B75 [Offset = 0x62B51E0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B76 [Offset = 0x62B5260, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B77 [Offset = 0x62B52E0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B78 [Offset = 0x62B5360, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B79 [Offset = 0x62B53E0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B7A [Offset = 0x62B5460, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B7B [Offset = 0x62B54E0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B7C [Offset = 0x62B5560, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B7D [Offset = 0x62B55E0, Size = 0x80]

tags.dat> 

tags.dat> import 1EFB tags/H3Shofp.tag
Imported 0x8B0 bytes.

tags.dat> import 1F3F tags/H3Sho3d.tag
Imported 0x840 bytes.

tags.dat> importmodelraw 1EFB tags/H3Shofp.raw
Writing tag data...
Model imported successfully!

tags.dat> importmodelraw 1F3F tags/H3Sho3d.raw
Writing tag data...
Model imported successfully!

tags.dat> 

tags.dat> importbitmap 5B75 DDS/ED.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B75 [Offset = 0x62B51A0, Size = 0x260]

tags.dat> importbitmap 5B72 DDS/shotgun.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B72 [Offset = 0x62B5020, Size = 0x260]

tags.dat> importbitmap 5B73 DDS/shotgun_bump.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B73 [Offset = 0x62B5280, Size = 0x260]

tags.dat> importbitmap 5B74 DDS/shotgun_illum.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B74 [Offset = 0x62B54E0, Size = 0x260]

tags.dat> import 5B76 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B77 tagTemplates/1178_rmshTemplate 
Imported 0x320 bytes.

tags.dat> import 5B78 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B79 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B7A tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B7B tagTemplates/1CA4_rmshTemplate
Imported 0x1D0 bytes.

tags.dat> edit 1EFB
Tag 0x00001EFB.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1EFB.render_model> edit geometry.compression[0]

tags.dat\0x1EFB.render_model\geometry\compression[0]> SetField TextureMinV 0
TextureMinV: Single = 0

tags.dat\0x1EFB.render_model\geometry\compression[0]> SetField TextureMaxV -0.9995005
TextureMaxV: Single = -0.9995005

tags.dat\0x1EFB.render_model\geometry\compression[0]> savechanges
Done!

tags.dat\0x1EFB.render_model\geometry\compression[0]> exitTo tags.dat

tags.dat> edit 1F3F
Tag 0x00001F3F.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1F3F.render_model> edit geometry.compression[0]

tags.dat\0x1F3F.render_model\geometry\compression[0]> SetField TextureMinV 0
TextureMinV: Single = 0

tags.dat\0x1F3F.render_model\geometry\compression[0]> SetField TextureMaxV -0.9995005
TextureMaxV: Single = -0.9995005

tags.dat\0x1F3F.render_model\geometry\compression[0]> savechanges
Done!

tags.dat\0x1F3F.render_model\geometry\compression[0]> exitTo tags.dat

tags.dat> edit 1EFB
Tag 0x00001EFB.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1EFB.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B7A
Please enter the replacement 0000101F index: 5B78
Please enter the replacement 0000101F index: 5B76
Please enter the replacement 0000101F index: 5B77
Please enter the replacement 0000101F index: 5B79
Done!

tags.dat\0x1EFB.render_model> exit

tags.dat> edit 1F3F
Tag 0x00001F3F.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1F3F.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B78
Please enter the replacement 0000101F index: 5B76
Please enter the replacement 0000101F index: 5B77
Please enter the replacement 0000101F index: 5B7B
Please enter the replacement 0000101F index: 5B7A
Done!

tags.dat\0x1F3F.render_model> exit

tags.dat> edit 5B76
Tag 0x00005B76.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B76.shader> SpecifyBitmaps
Please enter the base_map index: 5B72
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B73
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B74
Done!

tags.dat\0x5B76.shader> exit

tags.dat> edit 5B7B
Tag 0x00005B7B.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B7B.shader> SpecifyBitmaps
Please enter the base_map index: 5B75
Please enter the detail_map index: 0343
Done!

tags.dat\0x5B7B.shader> exit

tags.dat> edit 5B78
Tag 0x00005B78.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B78.shader> SpecifyBitmaps
Please enter the base_map index: 5B72
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B73
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B74
Done!

tags.dat\0x5B78.shader> exit

tags.dat> edit 5B79
Tag 0x00005B79.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B79.shader> SpecifyBitmaps
Please enter the base_map index: 5B72
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B73
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B74
Done!

tags.dat\0x5B79.shader> exit

tags.dat> edit 5B7A
Tag 0x00005B7A.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B7A.shader> SpecifyBitmaps
Please enter the base_map index: 5B72
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B73
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B74
Done!

tags.dat\0x5B7A.shader> exit

tags.dat> edit 5B76
Tag 0x00005B76.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B76.shader> edit ShaderProperties[0]

tags.dat\0x5B76.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B76.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B76.shader\ShaderProperties[0]> SetField arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5B76.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B76.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x5B76.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B76.shader\ShaderProperties[0]> SetField arguments[06].arg1 2.0
Arg1: Single = 2

tags.dat\0x5B76.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B76.shader\ShaderProperties[0]> exit

tags.dat\0x5B76.shader> exit

tags.dat> edit 5B77
Tag 0x00005B77.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B77.shader> edit ShaderProperties[0]

tags.dat\0x5B77.shader\ShaderProperties[0]> SetField arguments[02].arg1 0.03
Arg1: Single = 0.03

tags.dat\0x5B77.shader\ShaderProperties[0]> SetField arguments[02].arg2 0.5
Arg2: Single = 0.5

tags.dat\0x5B77.shader\ShaderProperties[0]> SetField arguments[02].arg3 1
Arg3: Single = 1

tags.dat\0x5B77.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B77.shader\ShaderProperties[0]> exit

tags.dat\0x5B77.shader> exit

tags.dat> edit 5B78
Tag 0x00005B78.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B78.shader> edit ShaderProperties[0]

tags.dat\0x5B78.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B78.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B78.shader\ShaderProperties[0]> SetField arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5B78.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B78.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x5B78.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B78.shader\ShaderProperties[0]> SetField arguments[06].arg1 2.0
Arg1: Single = 2

tags.dat\0x5B78.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B78.shader\ShaderProperties[0]> exit

tags.dat\0x5B78.shader> exit

tags.dat> edit 5B79
Tag 0x00005B79.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B79.shader> edit ShaderProperties[0]

tags.dat\0x5B79.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B79.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B79.shader\ShaderProperties[0]> SetField arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5B79.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B79.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x5B79.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B79.shader\ShaderProperties[0]> SetField arguments[06].arg1 2.0
Arg1: Single = 2

tags.dat\0x5B79.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B79.shader\ShaderProperties[0]> exit

tags.dat\0x5B79.shader> exit

tags.dat> edit 5B7A
Tag 0x00005B7A.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B7A.shader> edit ShaderProperties[0]

tags.dat\0x5B7A.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B7A.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B7A.shader\ShaderProperties[0]> SetField arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5B7A.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B7A.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x5B7A.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B7A.shader\ShaderProperties[0]> SetField arguments[06].arg1 2.0
Arg1: Single = 2

tags.dat\0x5B7A.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B7A.shader\ShaderProperties[0]> exit

tags.dat\0x5B7A.shader> exit

tags.dat> 

tags.dat> dumplog H3Shotgun.log
