Tag Tool [1.0.6043.10715]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...28944 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 2:40 PM.
Reading stringIDs...37422 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> echo REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool
REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool 
tags.dat> echo REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool
REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool 
tags.dat> 151E
Unrecognized command: 151E
Use "help" to list available commands.

tags.dat> 151E
Unrecognized command: 151E
Use "help" to list available commands.

tags.dat> 1581
Unrecognized command: 1581
Use "help" to list available commands.

tags.dat> 1581
Unrecognized command: 1581
Use "help" to list available commands.

tags.dat> 1582
Unrecognized command: 1582
Use "help" to list available commands.

tags.dat> 1582
Unrecognized command: 1582
Use "help" to list available commands.

tags.dat> 1583
Unrecognized command: 1583
Use "help" to list available commands.

tags.dat> 1583
Unrecognized command: 1583
Use "help" to list available commands.

tags.dat> 1584
Unrecognized command: 1584
Use "help" to list available commands.

tags.dat> 1584
Unrecognized command: 1584
Use "help" to list available commands.

tags.dat> 0EE1
Unrecognized command: 0EE1
Use "help" to list available commands.

tags.dat> 0EE1
Unrecognized command: 0EE1
Use "help" to list available commands.

tags.dat> 0F22
Unrecognized command: 0F22
Use "help" to list available commands.

tags.dat> 0F22
Unrecognized command: 0F22
Use "help" to list available commands.

tags.dat> 0F32
Unrecognized command: 0F32
Use "help" to list available commands.

tags.dat> 0F32
Unrecognized command: 0F32
Use "help" to list available commands.

tags.dat> 0F52
Unrecognized command: 0F52
Use "help" to list available commands.

tags.dat> 0F52
Unrecognized command: 0F52
Use "help" to list available commands.

tags.dat> 0F61
Unrecognized command: 0F61
Use "help" to list available commands.

tags.dat> 0F61
Unrecognized command: 0F61
Use "help" to list available commands.

tags.dat> 1C7B
Unrecognized command: 1C7B
Use "help" to list available commands.

tags.dat> 1C7B
Unrecognized command: 1C7B
Use "help" to list available commands.

tags.dat> 2329
Unrecognized command: 2329
Use "help" to list available commands.

tags.dat> 2329
Unrecognized command: 2329
Use "help" to list available commands.

tags.dat> 233A
Unrecognized command: 233A
Use "help" to list available commands.

tags.dat> 233A
Unrecognized command: 233A
Use "help" to list available commands.

tags.dat> 2347
Unrecognized command: 2347
Use "help" to list available commands.

tags.dat> 2347
Unrecognized command: 2347
Use "help" to list available commands.

tags.dat> 2358
Unrecognized command: 2358
Use "help" to list available commands.

tags.dat> 2358
Unrecognized command: 2358
Use "help" to list available commands.

tags.dat> echo REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool
REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool 
tags.dat> echo REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool
REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool 
tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 710F
Unrecognized command: 710F
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7110
Unrecognized command: 7110
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7111
Unrecognized command: 7111
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7112
Unrecognized command: 7112
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7113
Unrecognized command: 7113
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7114
Unrecognized command: 7114
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7115
Unrecognized command: 7115
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7116
Unrecognized command: 7116
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7117
Unrecognized command: 7117
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7118
Unrecognized command: 7118
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7119
Unrecognized command: 7119
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 711A
Unrecognized command: 711A
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 711B
Unrecognized command: 711B
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 711C
Unrecognized command: 711C
Use "help" to list available commands.

tags.dat> echo REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool
REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool 
tags.dat> echo REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool
REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool 
tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 711D
Unrecognized command: 711D
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 711E
Unrecognized command: 711E
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 711F
Unrecognized command: 711F
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7120
Unrecognized command: 7120
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7121
Unrecognized command: 7121
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7122
Unrecognized command: 7122
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7123
Unrecognized command: 7123
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7124
Unrecognized command: 7124
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7125
Unrecognized command: 7125
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7126
Unrecognized command: 7126
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7127
Unrecognized command: 7127
Use "help" to list available commands.

tags.dat> echo REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool
REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool 
tags.dat> echo REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool
REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool 
tags.dat> 0F09
Unrecognized command: 0F09
Use "help" to list available commands.

tags.dat> 0F09
Unrecognized command: 0F09
Use "help" to list available commands.

tags.dat> 0F05
Unrecognized command: 0F05
Use "help" to list available commands.

tags.dat> 0F05
Unrecognized command: 0F05
Use "help" to list available commands.

tags.dat> echo REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool
REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool 
tags.dat> echo REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool
REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool 
tags.dat> 1B80
Unrecognized command: 1B80
Use "help" to list available commands.

tags.dat> 1B80
Unrecognized command: 1B80
Use "help" to list available commands.

tags.dat> 231E
Unrecognized command: 231E
Use "help" to list available commands.

tags.dat> 231E
Unrecognized command: 231E
Use "help" to list available commands.

tags.dat> 2333
Unrecognized command: 2333
Use "help" to list available commands.

tags.dat> 2333
Unrecognized command: 2333
Use "help" to list available commands.

tags.dat> 2341
Unrecognized command: 2341
Use "help" to list available commands.

tags.dat> 2341
Unrecognized command: 2341
Use "help" to list available commands.

tags.dat> 2352
Unrecognized command: 2352
Use "help" to list available commands.

tags.dat> 2352
Unrecognized command: 2352
Use "help" to list available commands.

tags.dat> echo REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool
REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool 
tags.dat> echo REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool
REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool 
tags.dat> echo

tags.dat> echo

tags.dat> echo REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool
REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool 
tags.dat> echo REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool
REACH ASSAULT RIFLE MOD FOR HALO ONLINE ELDORITO MS23 0.5.1.1; made by BUNGIE, rebuilt by dany5639 using HaloOnlineTagTool 
tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> 

tags.dat> SetLocale US

tags.dat> 

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007110 [Offset = 0x7EE8140, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007111 [Offset = 0x7EE82E0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007112 [Offset = 0x7EE8480, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007113 [Offset = 0x7EE8620, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007114 [Offset = 0x7EE87C0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007115 [Offset = 0x7EE8960, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007116 [Offset = 0x7EE8B00, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007117 [Offset = 0x7EE8CA0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007118 [Offset = 0x7EE8E40, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007119 [Offset = 0x7EE8FE0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000711A [Offset = 0x7EE9180, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000711B [Offset = 0x7EE9320, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000711C [Offset = 0x7EE94C0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000711D [Offset = 0x7EE9660, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000711E [Offset = 0x7EE9800, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000711F [Offset = 0x7EE99A0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007120 [Offset = 0x7EE9B40, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007121 [Offset = 0x7EE9CE0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007122 [Offset = 0x7EE9E80, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007123 [Offset = 0x7EEA020, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007124 [Offset = 0x7EEA1C0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007125 [Offset = 0x7EEA360, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007126 [Offset = 0x7EEA500, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007127 [Offset = 0x7EEA6A0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007128 [Offset = 0x7EEA840, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007129 [Offset = 0x7EEA9E0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000712A [Offset = 0x7EEAB80, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000712B [Offset = 0x7EEAD20, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000712C [Offset = 0x7EEAEC0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000712D [Offset = 0x7EEB060, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000712E [Offset = 0x7EEB200, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000712F [Offset = 0x7EEB3A0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007130 [Offset = 0x7EEB540, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007131 [Offset = 0x7EEB6E0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007132 [Offset = 0x7EEB880, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007133 [Offset = 0x7EEBA20, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007134 [Offset = 0x7EEBBC0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007135 [Offset = 0x7EEBD60, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007136 [Offset = 0x7EEBF00, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007137 [Offset = 0x7EEC0A0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007138 [Offset = 0x7EEC240, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00007139 [Offset = 0x7EEC3E0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000713A [Offset = 0x7EEC580, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000713B [Offset = 0x7EEC720, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000713C [Offset = 0x7EEC8C0, Size = 0x1A0]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 0000713D [Offset = 0x7EECA60, Size = 0x1A0]

tags.dat> 

tags.dat> import 0EE1 tags/mode_HRAR.tag
Imported 0xD70 bytes.

tags.dat> importresource resources.dat 0EE1 tags/HRAR.raw
0x00000EE1: Imported 0x360387.

tags.dat> 

tags.dat> importbitmap 711F DDS/assault_rifle_normal.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 0000711F [Offset = 0x7EE9A60, Size = 0x260]

tags.dat> importbitmap 711D DDS/display_plate.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 0000711D [Offset = 0x7EE9720, Size = 0x260]

tags.dat> importbitmap 711E DDS/bullet_plate.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 0000711E [Offset = 0x7EE9980, Size = 0x260]

tags.dat> importbitmap 7120 DDS/unsc_decals_diffuse.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00007120 [Offset = 0x7EE9E40, Size = 0x260]

tags.dat> importbitmap 7121 DDS/assault_rifle_diffuse_def.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00007121 [Offset = 0x7EEA0A0, Size = 0x260]

tags.dat> importbitmap 7122 DDS/assault_rifle_diffuse_red.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00007122 [Offset = 0x7EEA300, Size = 0x260]

tags.dat> importbitmap 7124 DDS/assault_rifle_diffuse_green.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00007124 [Offset = 0x7EEA700, Size = 0x260]

tags.dat> importbitmap 7125 DDS/assault_rifle_diffuse_yellow.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00007125 [Offset = 0x7EEA960, Size = 0x260]

tags.dat> importbitmap 7123 DDS/assault_rifle_diffuse_orange.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00007123 [Offset = 0x7EEA560, Size = 0x260]

tags.dat> 

tags.dat> import 7113 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 7114 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 7115 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 7116 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 7117 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> 

tags.dat> import 7118 tagTemplates/0F11_rmshTemplate
Imported 0x3D0 bytes.

tags.dat> import 711A tagTemplates/0EEB_rmshTemplate
Imported 0x4E0 bytes.

tags.dat> import 7119 tagTemplates/0EEC_rmshTemplate
Imported 0x4E0 bytes.

tags.dat> import 710F tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 7110 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 7111 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 7112 tagTemplates/1CA4_rmshTemplate
Imported 0x1D0 bytes.

tags.dat> import 711C tagTemplates/0EEA_rmshTemplate
Imported 0x4D0 bytes.

tags.dat> import 711B tagTemplates/0F11_rmshTemplate
Imported 0x3D0 bytes.

tags.dat> 

tags.dat> edit 7113
Tag 0x00007113.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7113.shader> SpecifyBitmaps
Please enter the base_map index: 7121
Please enter the detail_map index: 0343
Please enter the bump_map index: 711F
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x7113.shader> exit

tags.dat> edit 7114
Tag 0x00007114.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7114.shader> SpecifyBitmaps
Please enter the base_map index: 7122
Please enter the detail_map index: 0343
Please enter the bump_map index: 711F
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x7114.shader> exit

tags.dat> edit 7115
Tag 0x00007115.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7115.shader> SpecifyBitmaps
Please enter the base_map index: 7123
Please enter the detail_map index: 0343
Please enter the bump_map index: 711F
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x7115.shader> exit

tags.dat> edit 7116
Tag 0x00007116.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7116.shader> SpecifyBitmaps
Please enter the base_map index: 7124
Please enter the detail_map index: 0343
Please enter the bump_map index: 711F
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x7116.shader> exit

tags.dat> edit 7117
Tag 0x00007117.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7117.shader> SpecifyBitmaps
Please enter the base_map index: 7125
Please enter the detail_map index: 0343
Please enter the bump_map index: 711F
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x7117.shader> exit

tags.dat> 

tags.dat> edit 710F
Tag 0x0000710F.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x710F.shader> SpecifyBitmaps
Please enter the base_map index: 7121
Please enter the detail_map index: 0343
Please enter the bump_map index: 711F
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x710F.shader> exit

tags.dat> edit 7110
Tag 0x00007110.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7110.shader> SpecifyBitmaps
Please enter the base_map index: 7121
Please enter the detail_map index: 0343
Please enter the bump_map index: 711F
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x7110.shader> exit

tags.dat> edit 7111
Tag 0x00007111.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7111.shader> SpecifyBitmaps
Please enter the base_map index: 7121
Please enter the detail_map index: 0343
Please enter the bump_map index: 711F
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x7111.shader> exit

tags.dat> edit 7112
Tag 0x00007112.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7112.shader> SpecifyBitmaps
Please enter the base_map index: 7120
Please enter the detail_map index: 0343
Done!

tags.dat\0x7112.shader> exit

tags.dat> edit 711B
Tag 0x0000711B.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x711B.shader> SpecifyBitmaps
Please enter the self_illum_map index: 711E
Done!

tags.dat\0x711B.shader> exit

tags.dat> edit 7118
Tag 0x00007118.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7118.shader> SpecifyBitmaps
Please enter the self_illum_map index: 711D
Done!

tags.dat\0x7118.shader> exit

tags.dat> edit 711A
Tag 0x0000711A.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x711A.shader> SpecifyBitmaps
Please enter the self_illum_map index: 7126
Done!

tags.dat\0x711A.shader> exit

tags.dat> edit 7119
Tag 0x00007119.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7119.shader> SpecifyBitmaps
Please enter the self_illum_map index: 7126
Done!

tags.dat\0x7119.shader> exit

tags.dat> 

tags.dat> edit 7113
Tag 0x00007113.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7113.shader> edit ShaderProperties[0]

tags.dat\0x7113.shader\ShaderProperties[0]> SetField Arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x7113.shader\ShaderProperties[0]> SetField Arguments[07].arg1 0.2
Arg1: Single = 0.2

tags.dat\0x7113.shader\ShaderProperties[0]> SetField Arguments[16].arg1 0.5
Arg1: Single = 0.5

tags.dat\0x7113.shader\ShaderProperties[0]> Setfield Arguments[19].arg1 0
Arg1: Single = 0

tags.dat\0x7113.shader\ShaderProperties[0]> SetField Arguments[25].arg1 0
Arg1: Single = 0

tags.dat\0x7113.shader\ShaderProperties[0]> SetField Arguments[25].arg2 0
Arg2: Single = 0

tags.dat\0x7113.shader\ShaderProperties[0]> SetField Arguments[25].arg3 0
Arg3: Single = 0

tags.dat\0x7113.shader\ShaderProperties[0]> SetField Arguments[28].arg1 0
Arg1: Single = 0

tags.dat\0x7113.shader\ShaderProperties[0]> SetField Arguments[28].arg2 1
Arg2: Single = 1

tags.dat\0x7113.shader\ShaderProperties[0]> SetField Arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x7113.shader\ShaderProperties[0]> SetField Arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x7113.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x7113.shader\ShaderProperties[0]> exit

tags.dat\0x7113.shader> exit

tags.dat> edit 7114
Tag 0x00007114.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7114.shader> edit ShaderProperties[0]

tags.dat\0x7114.shader\ShaderProperties[0]> SetField Arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x7114.shader\ShaderProperties[0]> SetField Arguments[07].arg1 0.2
Arg1: Single = 0.2

tags.dat\0x7114.shader\ShaderProperties[0]> SetField Arguments[16].arg1 0.5
Arg1: Single = 0.5

tags.dat\0x7114.shader\ShaderProperties[0]> Setfield Arguments[19].arg1 0
Arg1: Single = 0

tags.dat\0x7114.shader\ShaderProperties[0]> SetField Arguments[25].arg1 0
Arg1: Single = 0

tags.dat\0x7114.shader\ShaderProperties[0]> SetField Arguments[25].arg2 0
Arg2: Single = 0

tags.dat\0x7114.shader\ShaderProperties[0]> SetField Arguments[25].arg3 0
Arg3: Single = 0

tags.dat\0x7114.shader\ShaderProperties[0]> SetField Arguments[28].arg1 0
Arg1: Single = 0

tags.dat\0x7114.shader\ShaderProperties[0]> SetField Arguments[28].arg2 1
Arg2: Single = 1

tags.dat\0x7114.shader\ShaderProperties[0]> SetField Arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x7114.shader\ShaderProperties[0]> SetField Arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x7114.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x7114.shader\ShaderProperties[0]> exit

tags.dat\0x7114.shader> exit

tags.dat> edit 7115
Tag 0x00007115.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7115.shader> edit ShaderProperties[0]

tags.dat\0x7115.shader\ShaderProperties[0]> SetField Arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x7115.shader\ShaderProperties[0]> SetField Arguments[07].arg1 0.2
Arg1: Single = 0.2

tags.dat\0x7115.shader\ShaderProperties[0]> SetField Arguments[16].arg1 0.5
Arg1: Single = 0.5

tags.dat\0x7115.shader\ShaderProperties[0]> Setfield Arguments[19].arg1 0
Arg1: Single = 0

tags.dat\0x7115.shader\ShaderProperties[0]> SetField Arguments[25].arg1 0
Arg1: Single = 0

tags.dat\0x7115.shader\ShaderProperties[0]> SetField Arguments[25].arg2 0
Arg2: Single = 0

tags.dat\0x7115.shader\ShaderProperties[0]> SetField Arguments[25].arg3 0
Arg3: Single = 0

tags.dat\0x7115.shader\ShaderProperties[0]> SetField Arguments[28].arg1 0
Arg1: Single = 0

tags.dat\0x7115.shader\ShaderProperties[0]> SetField Arguments[28].arg2 1
Arg2: Single = 1

tags.dat\0x7115.shader\ShaderProperties[0]> SetField Arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x7115.shader\ShaderProperties[0]> SetField Arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x7115.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x7115.shader\ShaderProperties[0]> exit

tags.dat\0x7115.shader> exit

tags.dat> edit 7116
Tag 0x00007116.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7116.shader> edit ShaderProperties[0]

tags.dat\0x7116.shader\ShaderProperties[0]> SetField Arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x7116.shader\ShaderProperties[0]> SetField Arguments[07].arg1 0.2
Arg1: Single = 0.2

tags.dat\0x7116.shader\ShaderProperties[0]> SetField Arguments[16].arg1 0.5
Arg1: Single = 0.5

tags.dat\0x7116.shader\ShaderProperties[0]> Setfield Arguments[19].arg1 0
Arg1: Single = 0

tags.dat\0x7116.shader\ShaderProperties[0]> SetField Arguments[25].arg1 0
Arg1: Single = 0

tags.dat\0x7116.shader\ShaderProperties[0]> SetField Arguments[25].arg2 0
Arg2: Single = 0

tags.dat\0x7116.shader\ShaderProperties[0]> SetField Arguments[25].arg3 0
Arg3: Single = 0

tags.dat\0x7116.shader\ShaderProperties[0]> SetField Arguments[28].arg1 0
Arg1: Single = 0

tags.dat\0x7116.shader\ShaderProperties[0]> SetField Arguments[28].arg2 1
Arg2: Single = 1

tags.dat\0x7116.shader\ShaderProperties[0]> SetField Arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x7116.shader\ShaderProperties[0]> SetField Arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x7116.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x7116.shader\ShaderProperties[0]> exit

tags.dat\0x7116.shader> exit

tags.dat> edit 7117
Tag 0x00007117.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7117.shader> edit ShaderProperties[0]

tags.dat\0x7117.shader\ShaderProperties[0]> SetField Arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x7117.shader\ShaderProperties[0]> SetField Arguments[07].arg1 0.2
Arg1: Single = 0.2

tags.dat\0x7117.shader\ShaderProperties[0]> SetField Arguments[16].arg1 0.5
Arg1: Single = 0.5

tags.dat\0x7117.shader\ShaderProperties[0]> Setfield Arguments[19].arg1 0
Arg1: Single = 0

tags.dat\0x7117.shader\ShaderProperties[0]> SetField Arguments[25].arg1 0
Arg1: Single = 0

tags.dat\0x7117.shader\ShaderProperties[0]> SetField Arguments[25].arg2 0
Arg2: Single = 0

tags.dat\0x7117.shader\ShaderProperties[0]> SetField Arguments[25].arg3 0
Arg3: Single = 0

tags.dat\0x7117.shader\ShaderProperties[0]> SetField Arguments[28].arg1 0
Arg1: Single = 0

tags.dat\0x7117.shader\ShaderProperties[0]> SetField Arguments[28].arg2 1
Arg2: Single = 1

tags.dat\0x7117.shader\ShaderProperties[0]> SetField Arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x7117.shader\ShaderProperties[0]> SetField Arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x7117.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x7117.shader\ShaderProperties[0]> exit

tags.dat\0x7117.shader> exit

tags.dat> 

tags.dat> edit 711C
Tag 0x0000711C.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x711C.shader> edit ShaderProperties[0]

tags.dat\0x711C.shader\ShaderProperties[0]> Setfield Arguments[02].arg1 0.0
Arg1: Single = 0

tags.dat\0x711C.shader\ShaderProperties[0]> Setfield Arguments[02].arg2 0.7
Arg2: Single = 0.7

tags.dat\0x711C.shader\ShaderProperties[0]> Setfield Arguments[02].arg3 1.0
Arg3: Single = 1

tags.dat\0x711C.shader\ShaderProperties[0]> SetField Arguments[03].arg1 6.0
Arg1: Single = 6

tags.dat\0x711C.shader\ShaderProperties[0]> SetField Arguments[01].arg4 1
Arg4: Single = 1

tags.dat\0x711C.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x711C.shader\ShaderProperties[0]> exit

tags.dat\0x711C.shader> exit

tags.dat> edit 7118
Tag 0x00007118.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7118.shader> edit ShaderProperties[0]

tags.dat\0x7118.shader\ShaderProperties[0]> Setfield Arguments[02].arg1 0.0
Arg1: Single = 0

tags.dat\0x7118.shader\ShaderProperties[0]> Setfield Arguments[02].arg2 0.7
Arg2: Single = 0.7

tags.dat\0x7118.shader\ShaderProperties[0]> Setfield Arguments[02].arg3 1.0
Arg3: Single = 1

tags.dat\0x7118.shader\ShaderProperties[0]> Setfield Arguments[03].arg1 6.0
Arg1: Single = 6

tags.dat\0x7118.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x7118.shader\ShaderProperties[0]> exit

tags.dat\0x7118.shader> exit

tags.dat> edit 711B
Tag 0x0000711B.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x711B.shader> edit ShaderProperties[0]

tags.dat\0x711B.shader\ShaderProperties[0]> Setfield Arguments[02].arg1 0.0
Arg1: Single = 0

tags.dat\0x711B.shader\ShaderProperties[0]> Setfield Arguments[02].arg2 0.7
Arg2: Single = 0.7

tags.dat\0x711B.shader\ShaderProperties[0]> Setfield Arguments[02].arg3 1.0
Arg3: Single = 1

tags.dat\0x711B.shader\ShaderProperties[0]> Setfield Arguments[03].arg1 10
Arg1: Single = 10

tags.dat\0x711B.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x711B.shader\ShaderProperties[0]> exit

tags.dat\0x711B.shader> exit

tags.dat> edit 711A
Tag 0x0000711A.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x711A.shader> edit ShaderProperties[0]

tags.dat\0x711A.shader\ShaderProperties[0]> Setfield Arguments[02].arg1 0.0
Arg1: Single = 0

tags.dat\0x711A.shader\ShaderProperties[0]> Setfield Arguments[02].arg2 0.7
Arg2: Single = 0.7

tags.dat\0x711A.shader\ShaderProperties[0]> Setfield Arguments[02].arg3 1.0
Arg3: Single = 1

tags.dat\0x711A.shader\ShaderProperties[0]> Setfield Arguments[03].arg1 6.0
Arg1: Single = 6

tags.dat\0x711A.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x711A.shader\ShaderProperties[0]> exit

tags.dat\0x711A.shader> exit

tags.dat> edit 7119
Tag 0x00007119.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7119.shader> edit ShaderProperties[0]

tags.dat\0x7119.shader\ShaderProperties[0]> Setfield Arguments[02].arg1 0.0
Arg1: Single = 0

tags.dat\0x7119.shader\ShaderProperties[0]> Setfield Arguments[02].arg2 0.7
Arg2: Single = 0.7

tags.dat\0x7119.shader\ShaderProperties[0]> Setfield Arguments[02].arg3 1.0
Arg3: Single = 1

tags.dat\0x7119.shader\ShaderProperties[0]> Setfield Arguments[03].arg1 6.0
Arg1: Single = 6

tags.dat\0x7119.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x7119.shader\ShaderProperties[0]> exit

tags.dat\0x7119.shader> exit

tags.dat> 

tags.dat> edit 710F
Tag 0x0000710F.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x710F.shader> edit ShaderProperties[0]

tags.dat\0x710F.shader\ShaderProperties[0]> SetField Arguments[06].arg1 1
Arg1: Single = 1

tags.dat\0x710F.shader\ShaderProperties[0]> SetField Arguments[07].arg1 0.2
Arg1: Single = 0.2

tags.dat\0x710F.shader\ShaderProperties[0]> SetField Arguments[16].arg1 0.5
Arg1: Single = 0.5

tags.dat\0x710F.shader\ShaderProperties[0]> Setfield Arguments[19].arg1 0
Arg1: Single = 0

tags.dat\0x710F.shader\ShaderProperties[0]> SetField Arguments[25].arg1 0
Arg1: Single = 0

tags.dat\0x710F.shader\ShaderProperties[0]> SetField Arguments[25].arg2 0
Arg2: Single = 0

tags.dat\0x710F.shader\ShaderProperties[0]> SetField Arguments[25].arg3 0
Arg3: Single = 0

tags.dat\0x710F.shader\ShaderProperties[0]> SetField Arguments[28].arg1 0
Arg1: Single = 0

tags.dat\0x710F.shader\ShaderProperties[0]> SetField Arguments[28].arg2 1
Arg2: Single = 1

tags.dat\0x710F.shader\ShaderProperties[0]> SetField Arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x710F.shader\ShaderProperties[0]> SetField Arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x710F.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x710F.shader\ShaderProperties[0]> exit

tags.dat\0x710F.shader> exit 

tags.dat> edit 7111
Tag 0x00007111.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7111.shader> edit ShaderProperties[0]

tags.dat\0x7111.shader\ShaderProperties[0]> SetField Arguments[06].arg1 1
Arg1: Single = 1

tags.dat\0x7111.shader\ShaderProperties[0]> SetField Arguments[07].arg1 0.2
Arg1: Single = 0.2

tags.dat\0x7111.shader\ShaderProperties[0]> SetField Arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x7111.shader\ShaderProperties[0]> Setfield Arguments[19].arg1 1
Arg1: Single = 1

tags.dat\0x7111.shader\ShaderProperties[0]> SetField Arguments[25].arg1 0
Arg1: Single = 0

tags.dat\0x7111.shader\ShaderProperties[0]> SetField Arguments[25].arg2 0
Arg2: Single = 0

tags.dat\0x7111.shader\ShaderProperties[0]> SetField Arguments[25].arg3 0
Arg3: Single = 0

tags.dat\0x7111.shader\ShaderProperties[0]> SetField Arguments[28].arg1 0
Arg1: Single = 0

tags.dat\0x7111.shader\ShaderProperties[0]> SetField Arguments[28].arg2 1
Arg2: Single = 1

tags.dat\0x7111.shader\ShaderProperties[0]> SetField Arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x7111.shader\ShaderProperties[0]> SetField Arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x7111.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x7111.shader\ShaderProperties[0]> exit

tags.dat\0x7111.shader> exit 

tags.dat> edit 7110
Tag 0x00007110.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7110.shader> edit ShaderProperties[0]

tags.dat\0x7110.shader\ShaderProperties[0]> SetField Arguments[06].arg1 1
Arg1: Single = 1

tags.dat\0x7110.shader\ShaderProperties[0]> SetField Arguments[07].arg1 0.2
Arg1: Single = 0.2

tags.dat\0x7110.shader\ShaderProperties[0]> SetField Arguments[16].arg1 0.5
Arg1: Single = 0.5

tags.dat\0x7110.shader\ShaderProperties[0]> Setfield Arguments[19].arg1 0
Arg1: Single = 0

tags.dat\0x7110.shader\ShaderProperties[0]> SetField Arguments[25].arg1 0
Arg1: Single = 0

tags.dat\0x7110.shader\ShaderProperties[0]> SetField Arguments[25].arg2 0
Arg2: Single = 0

tags.dat\0x7110.shader\ShaderProperties[0]> SetField Arguments[25].arg3 0
Arg3: Single = 0

tags.dat\0x7110.shader\ShaderProperties[0]> SetField Arguments[28].arg1 0
Arg1: Single = 0

tags.dat\0x7110.shader\ShaderProperties[0]> SetField Arguments[28].arg2 1
Arg2: Single = 1

tags.dat\0x7110.shader\ShaderProperties[0]> SetField Arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x7110.shader\ShaderProperties[0]> SetField Arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x7110.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x7110.shader\ShaderProperties[0]> exit

tags.dat\0x7110.shader> exit 

tags.dat> 

tags.dat> edit 0EE1
Tag 0x00000EE1.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0EE1.render_model> SetField Nodes[0].Name gun
Name: StringID = gun

tags.dat\0x0EE1.render_model> SetField Nodes[1].Name switch
Name: StringID = switch

tags.dat\0x0EE1.render_model> SetField Nodes[2].Name safety
Name: StringID = safety

tags.dat\0x0EE1.render_model> SetField Nodes[3].Name magazine
Name: StringID = magazine

tags.dat\0x0EE1.render_model> SetField Nodes[4].Name ophandle
Name: StringID = ophandle

tags.dat\0x0EE1.render_model> SetField markergroups[2].markers[0].RegionIndex -1
RegionIndex: SByte = -1

tags.dat\0x0EE1.render_model> SetField markergroups[2].markers[0].PermutationIndex -1
PermutationIndex: SByte = -1

tags.dat\0x0EE1.render_model> SetField markergroups[2].markers[0].Translation 0.1010085 -0.007 0.01560136
Translation: Vector3 = { X: 0.1010085, Y: -0.007, Z: 0.01560136 }

tags.dat\0x0EE1.render_model> SetField markergroups[2].markers[0].Rotation -0.6241202 0.1670771 -0.45504 0.6127788
Rotation: Vector4 = -0.6241202, 0.1670771, -0.45504, 0.6127788

tags.dat\0x0EE1.render_model> SetField markergroups[2].markers[0].Scale 0
Scale: Single = 0

tags.dat\0x0EE1.render_model> SetField geometry.compression[0].TextureMinV 1.192093E-07
TextureMinV: Single = 1.192093E-07

tags.dat\0x0EE1.render_model> SetField geometry.compression[0].TextureMaxV -1
TextureMaxV: Single = -1

tags.dat\0x0EE1.render_model> savechanges
Done!

tags.dat\0x0EE1.render_model> exit

tags.dat> 

tags.dat> extract 0EE1 tempTag
Wrote 0xD70 bytes to tempTag.
The tag's main struct will be at offset 0xB94.

tags.dat> import 0F22 tempTag
Imported 0xD70 bytes.

tags.dat> import 0F32 tempTag
Imported 0xD70 bytes.

tags.dat> import 0F52 tempTag
Imported 0xD70 bytes.

tags.dat> import 0F61 tempTag
Imported 0xD70 bytes.

tags.dat> 

tags.dat> import 1C7B tempTag
Imported 0xD70 bytes.

tags.dat> import 2329 tempTag
Imported 0xD70 bytes.

tags.dat> import 233A tempTag
Imported 0xD70 bytes.

tags.dat> import 2347 tempTag
Imported 0xD70 bytes.

tags.dat> import 2358 tempTag
Imported 0xD70 bytes.

tags.dat> 

tags.dat> edit 1C7B
Tag 0x00001C7B.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1C7B.render_model> SetField Nodes[0].Name gun
Name: StringID = gun

tags.dat\0x1C7B.render_model> SetField Nodes[1].ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x1C7B.render_model> SetField Nodes[2].ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x1C7B.render_model> SetField Nodes[3].ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x1C7B.render_model> SetField Nodes[4].ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x1C7B.render_model> savechanges
Done!

tags.dat\0x1C7B.render_model> exit

tags.dat> edit 2329
Tag 0x00002329.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2329.render_model> SetField Nodes[0].Name gun
Name: StringID = gun

tags.dat\0x2329.render_model> SetField Nodes[1].ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x2329.render_model> SetField Nodes[2].ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x2329.render_model> SetField Nodes[3].ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x2329.render_model> SetField Nodes[4].ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x2329.render_model> savechanges
Done!

tags.dat\0x2329.render_model> exit

tags.dat> edit 233A
Tag 0x0000233A.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x233A.render_model> SetField Nodes[0].Name gun
Name: StringID = gun

tags.dat\0x233A.render_model> SetField Nodes[1].ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x233A.render_model> SetField Nodes[2].ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x233A.render_model> SetField Nodes[3].ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x233A.render_model> SetField Nodes[4].ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x233A.render_model> savechanges
Done!

tags.dat\0x233A.render_model> exit

tags.dat> edit 2347
Tag 0x00002347.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2347.render_model> SetField Nodes[0].Name gun
Name: StringID = gun

tags.dat\0x2347.render_model> SetField Nodes[1].ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x2347.render_model> SetField Nodes[2].ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x2347.render_model> SetField Nodes[3].ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x2347.render_model> SetField Nodes[4].ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x2347.render_model> savechanges
Done!

tags.dat\0x2347.render_model> exit

tags.dat> edit 2358
Tag 0x00002358.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2358.render_model> SetField Nodes[0].Name gun
Name: StringID = gun

tags.dat\0x2358.render_model> SetField Nodes[1].ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x2358.render_model> SetField Nodes[2].ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x2358.render_model> SetField Nodes[3].ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x2358.render_model> SetField Nodes[4].ParentNode -1
ParentNode: Int16 = -1

tags.dat\0x2358.render_model> savechanges
Done!

tags.dat\0x2358.render_model> exit

tags.dat> 

tags.dat> echo move fp model
move fp model 
tags.dat> edit 151E
Tag 0x0000151E.weapon has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x151E.weapon> SetField FirstPersonWeaponOffseti -0.035
FirstPersonWeaponOffsetI: Single = -0.035

tags.dat\0x151E.weapon> SetField FirstPersonWeaponOffsetj 0
FirstPersonWeaponOffsetJ: Single = 0

tags.dat\0x151E.weapon> SetField FirstPersonWeaponOffseti -0.008
FirstPersonWeaponOffsetI: Single = -0.008

tags.dat\0x151E.weapon> savechanges
Done!

tags.dat\0x151E.weapon> exit

tags.dat> edit 1581
Tag 0x00001581.weapon has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1581.weapon> SetField FirstPersonWeaponOffseti -0.035
FirstPersonWeaponOffsetI: Single = -0.035

tags.dat\0x1581.weapon> SetField FirstPersonWeaponOffsetj 0
FirstPersonWeaponOffsetJ: Single = 0

tags.dat\0x1581.weapon> SetField FirstPersonWeaponOffseti -0.008
FirstPersonWeaponOffsetI: Single = -0.008

tags.dat\0x1581.weapon> savechanges
Done!

tags.dat\0x1581.weapon> exit

tags.dat> edit 1582
Tag 0x00001582.weapon has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1582.weapon> SetField FirstPersonWeaponOffseti -0.035
FirstPersonWeaponOffsetI: Single = -0.035

tags.dat\0x1582.weapon> SetField FirstPersonWeaponOffsetj 0
FirstPersonWeaponOffsetJ: Single = 0

tags.dat\0x1582.weapon> SetField FirstPersonWeaponOffseti -0.008
FirstPersonWeaponOffsetI: Single = -0.008

tags.dat\0x1582.weapon> savechanges
Done!

tags.dat\0x1582.weapon> exit

tags.dat> edit 1583
Tag 0x00001583.weapon has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1583.weapon> SetField FirstPersonWeaponOffseti -0.035
FirstPersonWeaponOffsetI: Single = -0.035

tags.dat\0x1583.weapon> SetField FirstPersonWeaponOffsetj 0
FirstPersonWeaponOffsetJ: Single = 0

tags.dat\0x1583.weapon> SetField FirstPersonWeaponOffseti -0.008
FirstPersonWeaponOffsetI: Single = -0.008

tags.dat\0x1583.weapon> savechanges
Done!

tags.dat\0x1583.weapon> exit

tags.dat> edit 1584
Tag 0x00001584.weapon has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1584.weapon> SetField FirstPersonWeaponOffseti -0.035
FirstPersonWeaponOffsetI: Single = -0.035

tags.dat\0x1584.weapon> SetField FirstPersonWeaponOffsetj 0
FirstPersonWeaponOffsetJ: Single = 0

tags.dat\0x1584.weapon> SetField FirstPersonWeaponOffseti -0.008
FirstPersonWeaponOffsetI: Single = -0.008

tags.dat\0x1584.weapon> savechanges
Done!

tags.dat\0x1584.weapon> exit

tags.dat> 

tags.dat> edit 0EE1
Tag 0x00000EE1.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0EE1.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 7113
Please enter the replacement 0000101F index: 710F
Please enter the replacement 0000101F index: 7110
Please enter the replacement 0000101F index: 7111
Please enter the replacement 0000101F index: 7112
Please enter the replacement 0000101F index: 711C
Please enter the replacement 0000101F index: 7118
Please enter the replacement 0000101F index: 711B
Please enter the replacement 0000101F index: 711A
Please enter the replacement 0000101F index: 7119
Done!

tags.dat\0x0EE1.render_model> exit

tags.dat> edit 0F22
Tag 0x00000F22.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0F22.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 7114
Please enter the replacement 0000101F index: 710F
Please enter the replacement 0000101F index: 7110
Please enter the replacement 0000101F index: 7111
Please enter the replacement 0000101F index: 7112
Please enter the replacement 0000101F index: 711C
Please enter the replacement 0000101F index: 7118
Please enter the replacement 0000101F index: 711B
Please enter the replacement 0000101F index: 711A
Please enter the replacement 0000101F index: 7119
Done!

tags.dat\0x0F22.render_model> exit

tags.dat> edit 0F32
Tag 0x00000F32.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0F32.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 7115
Please enter the replacement 0000101F index: 710F
Please enter the replacement 0000101F index: 7110
Please enter the replacement 0000101F index: 7111
Please enter the replacement 0000101F index: 7112
Please enter the replacement 0000101F index: 711C
Please enter the replacement 0000101F index: 7118
Please enter the replacement 0000101F index: 711B
Please enter the replacement 0000101F index: 711A
Please enter the replacement 0000101F index: 7119
Done!

tags.dat\0x0F32.render_model> exit

tags.dat> edit 0F52
Tag 0x00000F52.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0F52.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 7116
Please enter the replacement 0000101F index: 710F
Please enter the replacement 0000101F index: 7110
Please enter the replacement 0000101F index: 7111
Please enter the replacement 0000101F index: 7112
Please enter the replacement 0000101F index: 711C
Please enter the replacement 0000101F index: 7118
Please enter the replacement 0000101F index: 711B
Please enter the replacement 0000101F index: 711A
Please enter the replacement 0000101F index: 7119
Done!

tags.dat\0x0F52.render_model> exit

tags.dat> edit 0F61
Tag 0x00000F61.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0F61.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 7117
Please enter the replacement 0000101F index: 710F
Please enter the replacement 0000101F index: 7110
Please enter the replacement 0000101F index: 7111
Please enter the replacement 0000101F index: 7112
Please enter the replacement 0000101F index: 711C
Please enter the replacement 0000101F index: 7118
Please enter the replacement 0000101F index: 711B
Please enter the replacement 0000101F index: 711A
Please enter the replacement 0000101F index: 7119
Done!

tags.dat\0x0F61.render_model> exit

tags.dat> 

tags.dat> edit 1C7B
Tag 0x00001C7B.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1C7B.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 7113
Please enter the replacement 0000101F index: 710F
Please enter the replacement 0000101F index: 7110
Please enter the replacement 0000101F index: 7111
Please enter the replacement 0000101F index: 7112
Please enter the replacement 0000101F index: 711C
Please enter the replacement 0000101F index: 7118
Please enter the replacement 0000101F index: 711B
Please enter the replacement 0000101F index: 711A
Please enter the replacement 0000101F index: 7119
Done!

tags.dat\0x1C7B.render_model> exit

tags.dat> edit 2329
Tag 0x00002329.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2329.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 7114
Please enter the replacement 0000101F index: 710F
Please enter the replacement 0000101F index: 7110
Please enter the replacement 0000101F index: 7111
Please enter the replacement 0000101F index: 7112
Please enter the replacement 0000101F index: 711C
Please enter the replacement 0000101F index: 7118
Please enter the replacement 0000101F index: 711B
Please enter the replacement 0000101F index: 711A
Please enter the replacement 0000101F index: 7119
Done!

tags.dat\0x2329.render_model> exit

tags.dat> edit 233A
Tag 0x0000233A.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x233A.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 7115
Please enter the replacement 0000101F index: 710F
Please enter the replacement 0000101F index: 7110
Please enter the replacement 0000101F index: 7111
Please enter the replacement 0000101F index: 7112
Please enter the replacement 0000101F index: 711C
Please enter the replacement 0000101F index: 7118
Please enter the replacement 0000101F index: 711B
Please enter the replacement 0000101F index: 711A
Please enter the replacement 0000101F index: 7119
Done!

tags.dat\0x233A.render_model> exit

tags.dat> edit 2347
Tag 0x00002347.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2347.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 7116
Please enter the replacement 0000101F index: 710F
Please enter the replacement 0000101F index: 7110
Please enter the replacement 0000101F index: 7111
Please enter the replacement 0000101F index: 7112
Please enter the replacement 0000101F index: 711C
Please enter the replacement 0000101F index: 7118
Please enter the replacement 0000101F index: 711B
Please enter the replacement 0000101F index: 711A
Please enter the replacement 0000101F index: 7119
Done!

tags.dat\0x2347.render_model> exit

tags.dat> edit 2358
Tag 0x00002358.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2358.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 7117
Please enter the replacement 0000101F index: 710F
Please enter the replacement 0000101F index: 7110
Please enter the replacement 0000101F index: 7111
Please enter the replacement 0000101F index: 7112
Please enter the replacement 0000101F index: 711C
Please enter the replacement 0000101F index: 7118
Please enter the replacement 0000101F index: 711B
Please enter the replacement 0000101F index: 711A
Please enter the replacement 0000101F index: 7119
Done!

tags.dat\0x2358.render_model> exit

tags.dat> 

tags.dat> edit 1B80
Tag 0x00001B80.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1B80.model> RemoveFrom Nodes 5 *
Invalid index specified: 5
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Model definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x1B80.model> AddTo Nodes
Successfully added 1 element to Nodes: List`1<Node>
{...}[5]

tags.dat\0x1B80.model> SetField Nodes[*].Name default
Name: StringID = default

tags.dat\0x1B80.model> savechanges
Done!

tags.dat\0x1B80.model> exit

tags.dat> edit 231E
Tag 0x0000231E.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x231E.model> RemoveFrom Nodes 5 *
Invalid index specified: 5
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Model definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x231E.model> AddTo Nodes
Successfully added 1 element to Nodes: List`1<Node>
{...}[5]

tags.dat\0x231E.model> SetField Nodes[*].Name default
Name: StringID = default

tags.dat\0x231E.model> savechanges
Done!

tags.dat\0x231E.model> exit

tags.dat> edit 2333
Tag 0x00002333.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2333.model> RemoveFrom Nodes 5 *
Invalid index specified: 5
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Model definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x2333.model> AddTo Nodes
Successfully added 1 element to Nodes: List`1<Node>
{...}[5]

tags.dat\0x2333.model> SetField Nodes[*].Name default
Name: StringID = default

tags.dat\0x2333.model> savechanges
Done!

tags.dat\0x2333.model> exit

tags.dat> edit 2341
Tag 0x00002341.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2341.model> RemoveFrom Nodes 5 *
Invalid index specified: 5
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Model definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x2341.model> AddTo Nodes
Successfully added 1 element to Nodes: List`1<Node>
{...}[5]

tags.dat\0x2341.model> SetField Nodes[*].Name default
Name: StringID = default

tags.dat\0x2341.model> savechanges
Done!

tags.dat\0x2341.model> exit

tags.dat> edit 2352
Tag 0x00002352.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2352.model> RemoveFrom Nodes 5 *
Invalid index specified: 5
RemoveFrom: Removes block element(s) from a specified index of a specific tag block in the current Model definition.

Usage:
RemoveFrom <tag block name> [* | <tag block index> [* | amount = 1]]

Use "help RemoveFrom" for more information.

tags.dat\0x2352.model> AddTo Nodes
Successfully added 1 element to Nodes: List`1<Node>
{...}[5]

tags.dat\0x2352.model> SetField Nodes[*].Name default
Name: StringID = default

tags.dat\0x2352.model> savechanges
Done!

tags.dat\0x2352.model> exit

tags.dat> 

tags.dat> echo edit 0F09
edit 0F09 
tags.dat> echo import 0 DDS/ammu/numbers_plate.dds
import 0 DDS/ammu/numbers_plate.dds 
tags.dat> echo import 1 DDS/ammu/numbers_plate1.dds
import 1 DDS/ammu/numbers_plate1.dds 
tags.dat> echo import 2 DDS/ammu/numbers_plate2.dds
import 2 DDS/ammu/numbers_plate2.dds 
tags.dat> echo import 3 DDS/ammu/numbers_plate3.dds
import 3 DDS/ammu/numbers_plate3.dds 
tags.dat> echo import 4 DDS/ammu/numbers_plate4.dds
import 4 DDS/ammu/numbers_plate4.dds 
tags.dat> echo import 5 DDS/ammu/numbers_plate5.dds
import 5 DDS/ammu/numbers_plate5.dds 
tags.dat> echo import 6 DDS/ammu/numbers_plate6.dds
import 6 DDS/ammu/numbers_plate6.dds 
tags.dat> echo import 7 DDS/ammu/numbers_plate7.dds
import 7 DDS/ammu/numbers_plate7.dds 
tags.dat> echo import 8 DDS/ammu/numbers_plate8.dds
import 8 DDS/ammu/numbers_plate8.dds 
tags.dat> echo import 9 DDS/ammu/numbers_plate9.dds
import 9 DDS/ammu/numbers_plate9.dds 
tags.dat> echo exit
exit 
tags.dat> echo edit 0F05
edit 0F05 
tags.dat> echo import 0 DDS/compass/compass0.dds
import 0 DDS/compass/compass0.dds 
tags.dat> echo import 1 DDS/compass/compass1.dds
import 1 DDS/compass/compass1.dds 
tags.dat> echo import 2 DDS/compass/compass2.dds
import 2 DDS/compass/compass2.dds 
tags.dat> echo import 3 DDS/compass/compass3.dds
import 3 DDS/compass/compass3.dds 
tags.dat> echo import 4 DDS/compass/compass4.dds
import 4 DDS/compass/compass4.dds 
tags.dat> echo import 5 DDS/compass/compass5.dds
import 5 DDS/compass/compass5.dds 
tags.dat> echo import 6 DDS/compass/compass6.dds
import 6 DDS/compass/compass6.dds 
tags.dat> echo import 7 DDS/compass/compass7.dds
import 7 DDS/compass/compass7.dds 
tags.dat> echo exit
exit 
tags.dat> echo extract 0F09 tags\bitm_HRAROnes.tag
extract 0F09 tags\bitm_HRAROnes.tag 
tags.dat> echo extract 0F05 tags\bitm_HRARComp.tag
extract 0F05 tags\bitm_HRARComp.tag 
tags.dat> echo extractresource textures.dat 0F09 tags\ones\bitm_HRARones_0.bitm 0
extractresource textures.dat 0F09 tags\ones\bitm_HRARones_0.bitm 0 
tags.dat> echo extractresource textures.dat 0F09 tags\ones\bitm_HRARones_1.bitm 1
extractresource textures.dat 0F09 tags\ones\bitm_HRARones_1.bitm 1 
tags.dat> echo extractresource textures.dat 0F09 tags\ones\bitm_HRARones_2.bitm 2
extractresource textures.dat 0F09 tags\ones\bitm_HRARones_2.bitm 2 
tags.dat> echo extractresource textures.dat 0F09 tags\ones\bitm_HRARones_3.bitm 3
extractresource textures.dat 0F09 tags\ones\bitm_HRARones_3.bitm 3 
tags.dat> echo extractresource textures.dat 0F09 tags\ones\bitm_HRARones_4.bitm 4
extractresource textures.dat 0F09 tags\ones\bitm_HRARones_4.bitm 4 
tags.dat> echo extractresource textures.dat 0F09 tags\ones\bitm_HRARones_5.bitm 5
extractresource textures.dat 0F09 tags\ones\bitm_HRARones_5.bitm 5 
tags.dat> echo extractresource textures.dat 0F09 tags\ones\bitm_HRARones_6.bitm 6
extractresource textures.dat 0F09 tags\ones\bitm_HRARones_6.bitm 6 
tags.dat> echo extractresource textures.dat 0F09 tags\ones\bitm_HRARones_7.bitm 7
extractresource textures.dat 0F09 tags\ones\bitm_HRARones_7.bitm 7 
tags.dat> echo extractresource textures.dat 0F09 tags\ones\bitm_HRARones_8.bitm 8
extractresource textures.dat 0F09 tags\ones\bitm_HRARones_8.bitm 8 
tags.dat> echo extractresource textures.dat 0F09 tags\ones\bitm_HRARones_9.bitm 9
extractresource textures.dat 0F09 tags\ones\bitm_HRARones_9.bitm 9 
tags.dat> echo extractresource textures.dat 0F05 tags\compass\bitm_HRAROnes_0.bitm 0
extractresource textures.dat 0F05 tags\compass\bitm_HRAROnes_0.bitm 0 
tags.dat> echo extractresource textures.dat 0F05 tags\compass\bitm_HRAROnes_1.bitm 1
extractresource textures.dat 0F05 tags\compass\bitm_HRAROnes_1.bitm 1 
tags.dat> echo extractresource textures.dat 0F05 tags\compass\bitm_HRAROnes_2.bitm 2
extractresource textures.dat 0F05 tags\compass\bitm_HRAROnes_2.bitm 2 
tags.dat> echo extractresource textures.dat 0F05 tags\compass\bitm_HRAROnes_3.bitm 3
extractresource textures.dat 0F05 tags\compass\bitm_HRAROnes_3.bitm 3 
tags.dat> echo extractresource textures.dat 0F05 tags\compass\bitm_HRAROnes_4.bitm 4
extractresource textures.dat 0F05 tags\compass\bitm_HRAROnes_4.bitm 4 
tags.dat> echo extractresource textures.dat 0F05 tags\compass\bitm_HRAROnes_5.bitm 5
extractresource textures.dat 0F05 tags\compass\bitm_HRAROnes_5.bitm 5 
tags.dat> echo extractresource textures.dat 0F05 tags\compass\bitm_HRAROnes_6.bitm 6
extractresource textures.dat 0F05 tags\compass\bitm_HRAROnes_6.bitm 6 
tags.dat> echo extractresource textures.dat 0F05 tags\compass\bitm_HRAROnes_7.bitm 7
extractresource textures.dat 0F05 tags\compass\bitm_HRAROnes_7.bitm 7 
tags.dat> 

tags.dat> import 7126 tags/bitm_HRAROnes.tag
Imported 0xC60 bytes.

tags.dat> import 7127 tags/bitm_HRARComp.tag
Imported 0xA20 bytes.

tags.dat> 

tags.dat> importresource textures.dat 7126 tags/ones
0x00007126: Imported 0x913.

tags.dat> importresource textures.dat 7127 tags/compass
0x00007127: Imported 0x3610.

tags.dat> 

tags.dat> dumplog reachAR.log
