Tag Tool [1.0.6040.37850]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...23375 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 2:40 PM.
Reading stringIDs...39505 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B4E
Unrecognized command: 5B4E
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B4F
Unrecognized command: 5B4F
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B50
Unrecognized command: 5B50
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B51
Unrecognized command: 5B51
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B52
Unrecognized command: 5B52
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B53
Unrecognized command: 5B53
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B54
Unrecognized command: 5B54
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B55
Unrecognized command: 5B55
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B56
Unrecognized command: 5B56
Use "help" to list available commands.

tags.dat> 1C96
Unrecognized command: 1C96
Use "help" to list available commands.

tags.dat> 1C96
Unrecognized command: 1C96
Use "help" to list available commands.

tags.dat> 1C9C
Unrecognized command: 1C9C
Use "help" to list available commands.

tags.dat> 1C9C
Unrecognized command: 1C9C
Use "help" to list available commands.

tags.dat> 1D06
Unrecognized command: 1D06
Use "help" to list available commands.

tags.dat> 1D06
Unrecognized command: 1D06
Use "help" to list available commands.

tags.dat> echo Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1) 
tags.dat> echo Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1) 
tags.dat> echo

tags.dat> echo

tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> 

tags.dat> SetLocale US

tags.dat> 

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B4F [Offset = 0x62AA140, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B50 [Offset = 0x62AA1C0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B51 [Offset = 0x62AA240, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B52 [Offset = 0x62AA2C0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B53 [Offset = 0x62AA340, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B54 [Offset = 0x62AA3C0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B55 [Offset = 0x62AA440, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B56 [Offset = 0x62AA4C0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B57 [Offset = 0x62AA540, Size = 0x80]

tags.dat> 

tags.dat> import 1C9C tags/H3RLfp.tag
Imported 0xA70 bytes.

tags.dat> import 1D06 tags/H3RL3d.tag
Imported 0x940 bytes.

tags.dat> importmodelraw 1C9C tags/H3RLfp.raw
Writing tag data...
Model imported successfully!

tags.dat> importmodelraw 1D06 tags/H3RL3d.raw
Writing tag data...
Model imported successfully!

tags.dat> 

tags.dat> importbitmap 5B4E DDS/rocket_launcher.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B4E [Offset = 0x62A9D50, Size = 0x260]

tags.dat> importbitmap 5B4F DDS/rocket_launcher_bump.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B4F [Offset = 0x62A9FB0, Size = 0x260]

tags.dat> importbitmap 5B50 DDS/rocket_launcher_decal.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B50 [Offset = 0x62AA210, Size = 0x260]

tags.dat> importbitmap 5B51 DDS/rocket_launcher_illum.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B51 [Offset = 0x62AA470, Size = 0x260]

tags.dat> import 5B52 tagTemplates/1CA4_rmshTemplate
Imported 0x1D0 bytes.

tags.dat> import 5B53 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B54 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B55 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B56 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> edit 1C9C
Tag 0x00001C9C.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1C9C.render_model> edit geometry.compression[0]

tags.dat\0x1C9C.render_model\geometry\compression[0]> SetField TextureMinV -0.0002542734
TextureMinV: Single = -0.0002542734

tags.dat\0x1C9C.render_model\geometry\compression[0]> SetField TextureMaxV -1.007422
TextureMaxV: Single = -1.007422

tags.dat\0x1C9C.render_model\geometry\compression[0]> savechanges
Done!

tags.dat\0x1C9C.render_model\geometry\compression[0]> exitTo tags.dat

tags.dat> edit 1D06
Tag 0x00001D06.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1D06.render_model> edit geometry.compression[0]

tags.dat\0x1D06.render_model\geometry\compression[0]> SetField TextureMinV -0.0002542734
TextureMinV: Single = -0.0002542734

tags.dat\0x1D06.render_model\geometry\compression[0]> SetField TextureMaxV -1.007422
TextureMaxV: Single = -1.007422

tags.dat\0x1D06.render_model\geometry\compression[0]> savechanges
Done!

tags.dat\0x1D06.render_model\geometry\compression[0]> exitTo tags.dat

tags.dat> edit 1C96
Tag 0x00001C96.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1C96.model> SetField LODmodel null
LodModel: TagInstance = null

tags.dat\0x1C96.model> savechanges
Done!

tags.dat\0x1C96.model> exit

tags.dat> edit 1C9C
Tag 0x00001C9C.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1C9C.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B55
Please enter the replacement 0000101F index: 5B54
Please enter the replacement 0000101F index: 5B52
Please enter the replacement 0000101F index: 5B53
Please enter the replacement 0000101F index: 5B56
Done!

tags.dat\0x1C9C.render_model> exit

tags.dat> edit 1D06
Tag 0x00001D06.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1D06.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B55
Please enter the replacement 0000101F index: 5B54
Please enter the replacement 0000101F index: 5B52
Please enter the replacement 0000101F index: 5B53
Please enter the replacement 0000101F index: 5B56
Done!

tags.dat\0x1D06.render_model> exit

tags.dat> edit 5B53
Tag 0x00005B53.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B53.shader> SpecifyBitmaps
Please enter the base_map index: 5B4E
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B4F
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0EF7
Done!

tags.dat\0x5B53.shader> exit

tags.dat> edit 5B54
Tag 0x00005B54.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B54.shader> SpecifyBitmaps
Please enter the base_map index: 5B4E
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B4F
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0EF7
Done!

tags.dat\0x5B54.shader> exit

tags.dat> edit 5B55
Tag 0x00005B55.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B55.shader> SpecifyBitmaps
Please enter the base_map index: 5B4E
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B4F
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0EF7
Done!

tags.dat\0x5B55.shader> exit

tags.dat> edit 5B56
Tag 0x00005B56.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B56.shader> SpecifyBitmaps
Please enter the base_map index: 5B4E
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B4F
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B51
Done!

tags.dat\0x5B56.shader> exit

tags.dat> edit 5B52
Tag 0x00005B52.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B52.shader> SpecifyBitmaps
Please enter the base_map index: 5B50
Please enter the detail_map index: 0343
Done!

tags.dat\0x5B52.shader> exit

tags.dat> edit 5B53
Tag 0x00005B53.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B53.shader> edit ShaderProperties[0]

tags.dat\0x5B53.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B53.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B53.shader\ShaderProperties[0]> SetField arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5B53.shader\ShaderProperties[0]> SetField arguments[28].arg1 1
Arg1: Single = 1

tags.dat\0x5B53.shader\ShaderProperties[0]> SetField arguments[28].arg2 1
Arg2: Single = 1

tags.dat\0x5B53.shader\ShaderProperties[0]> SetField arguments[28].arg3 1
Arg3: Single = 1

tags.dat\0x5B53.shader\ShaderProperties[0]> SetField arguments[06].arg1 1
Arg1: Single = 1

tags.dat\0x5B53.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B53.shader\ShaderProperties[0]> exit

tags.dat\0x5B53.shader> exit

tags.dat> edit 5B54
Tag 0x00005B54.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B54.shader> edit ShaderProperties[0]

tags.dat\0x5B54.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B54.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B54.shader\ShaderProperties[0]> SetField arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5B54.shader\ShaderProperties[0]> SetField arguments[28].arg1 1
Arg1: Single = 1

tags.dat\0x5B54.shader\ShaderProperties[0]> SetField arguments[28].arg2 1
Arg2: Single = 1

tags.dat\0x5B54.shader\ShaderProperties[0]> SetField arguments[28].arg3 1
Arg3: Single = 1

tags.dat\0x5B54.shader\ShaderProperties[0]> SetField arguments[06].arg1 1
Arg1: Single = 1

tags.dat\0x5B54.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B54.shader\ShaderProperties[0]> exit

tags.dat\0x5B54.shader> exit

tags.dat> edit 5B55
Tag 0x00005B55.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B55.shader> edit ShaderProperties[0]

tags.dat\0x5B55.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B55.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B55.shader\ShaderProperties[0]> SetField arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5B55.shader\ShaderProperties[0]> SetField arguments[28].arg1 1
Arg1: Single = 1

tags.dat\0x5B55.shader\ShaderProperties[0]> SetField arguments[28].arg2 1
Arg2: Single = 1

tags.dat\0x5B55.shader\ShaderProperties[0]> SetField arguments[28].arg3 1
Arg3: Single = 1

tags.dat\0x5B55.shader\ShaderProperties[0]> SetField arguments[06].arg1 1
Arg1: Single = 1

tags.dat\0x5B55.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B55.shader\ShaderProperties[0]> exit

tags.dat\0x5B55.shader> exit

tags.dat> edit 5B56
Tag 0x00005B56.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B56.shader> edit ShaderProperties[0]

tags.dat\0x5B56.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B56.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B56.shader\ShaderProperties[0]> SetField arguments[29].arg1 5
Arg1: Single = 5

tags.dat\0x5B56.shader\ShaderProperties[0]> SetField arguments[28].arg1 1
Arg1: Single = 1

tags.dat\0x5B56.shader\ShaderProperties[0]> SetField arguments[28].arg2 1
Arg2: Single = 1

tags.dat\0x5B56.shader\ShaderProperties[0]> SetField arguments[28].arg3 1
Arg3: Single = 1

tags.dat\0x5B56.shader\ShaderProperties[0]> SetField arguments[06].arg1 1
Arg1: Single = 1

tags.dat\0x5B56.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B56.shader\ShaderProperties[0]> exit

tags.dat\0x5B56.shader> exit 

tags.dat> 

tags.dat> dumplog H3RocketLauncher.log
