Tag Tool [1.0.6043.10715]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...23340 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 2:40 PM.
Reading stringIDs...39505 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B2B
Unrecognized command: 5B2B
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B2C
Unrecognized command: 5B2C
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B2D
Unrecognized command: 5B2D
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B2E
Unrecognized command: 5B2E
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B2F
Unrecognized command: 5B2F
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B30
Unrecognized command: 5B30
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B31
Unrecognized command: 5B31
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B32
Unrecognized command: 5B32
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B33
Unrecognized command: 5B33
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B34
Unrecognized command: 5B34
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B35
Unrecognized command: 5B35
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B36
Unrecognized command: 5B36
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B37
Unrecognized command: 5B37
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B38
Unrecognized command: 5B38
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B39
Unrecognized command: 5B39
Use "help" to list available commands.

tags.dat> 0F71
Unrecognized command: 0F71
Use "help" to list available commands.

tags.dat> 0F71
Unrecognized command: 0F71
Use "help" to list available commands.

tags.dat> 0F99
Unrecognized command: 0F99
Use "help" to list available commands.

tags.dat> 0F99
Unrecognized command: 0F99
Use "help" to list available commands.

tags.dat> 0FAE
Unrecognized command: 0FAE
Use "help" to list available commands.

tags.dat> 0FAE
Unrecognized command: 0FAE
Use "help" to list available commands.

tags.dat> 0FBA
Unrecognized command: 0FBA
Use "help" to list available commands.

tags.dat> 0FBA
Unrecognized command: 0FBA
Use "help" to list available commands.

tags.dat> 0FC6
Unrecognized command: 0FC6
Use "help" to list available commands.

tags.dat> 0FC6
Unrecognized command: 0FC6
Use "help" to list available commands.

tags.dat> 0FD7
Unrecognized command: 0FD7
Use "help" to list available commands.

tags.dat> 0FD7
Unrecognized command: 0FD7
Use "help" to list available commands.

tags.dat> 0FE1
Unrecognized command: 0FE1
Use "help" to list available commands.

tags.dat> 0FE1
Unrecognized command: 0FE1
Use "help" to list available commands.

tags.dat> 1D85
Unrecognized command: 1D85
Use "help" to list available commands.

tags.dat> 1D85
Unrecognized command: 1D85
Use "help" to list available commands.

tags.dat> 1DA0
Unrecognized command: 1DA0
Use "help" to list available commands.

tags.dat> 1DA0
Unrecognized command: 1DA0
Use "help" to list available commands.

tags.dat> 2368
Unrecognized command: 2368
Use "help" to list available commands.

tags.dat> 2368
Unrecognized command: 2368
Use "help" to list available commands.

tags.dat> 2375
Unrecognized command: 2375
Use "help" to list available commands.

tags.dat> 2375
Unrecognized command: 2375
Use "help" to list available commands.

tags.dat> 2386
Unrecognized command: 2386
Use "help" to list available commands.

tags.dat> 2386
Unrecognized command: 2386
Use "help" to list available commands.

tags.dat> 2587
Unrecognized command: 2587
Use "help" to list available commands.

tags.dat> 2587
Unrecognized command: 2587
Use "help" to list available commands.

tags.dat> 2591
Unrecognized command: 2591
Use "help" to list available commands.

tags.dat> 2591
Unrecognized command: 2591
Use "help" to list available commands.

tags.dat> 259A
Unrecognized command: 259A
Use "help" to list available commands.

tags.dat> 259A
Unrecognized command: 259A
Use "help" to list available commands.

tags.dat> echo Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1) 
tags.dat> echo Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1) 
tags.dat> 0F96
Unrecognized command: 0F96
Use "help" to list available commands.

tags.dat> 0F96
Unrecognized command: 0F96
Use "help" to list available commands.

tags.dat> echo Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1) 
tags.dat> echo Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1) 
tags.dat> echo

tags.dat> echo

tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> 

tags.dat> SetLocale US

tags.dat> 

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B2C [Offset = 0x629FA20, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B2D [Offset = 0x629FAA0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B2E [Offset = 0x629FB20, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B2F [Offset = 0x629FBA0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B30 [Offset = 0x629FC20, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B31 [Offset = 0x629FCA0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B32 [Offset = 0x629FD20, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B33 [Offset = 0x629FDA0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B34 [Offset = 0x629FE20, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B35 [Offset = 0x629FEA0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B36 [Offset = 0x629FF20, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B37 [Offset = 0x629FFA0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B38 [Offset = 0x62A0020, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B39 [Offset = 0x62A00A0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B3A [Offset = 0x62A0120, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B3B [Offset = 0x62A01A0, Size = 0x80]

tags.dat> 

tags.dat> import 0F71 tags/H3BRfp.tag
Imported 0x8C0 bytes.

tags.dat> import 1DA0 tags/H3BR3d.tag
Imported 0x8F0 bytes.

tags.dat> importresource resources.dat 0F71 tags/H3BRfp.raw
0x00000F71: Imported 0x89792.

tags.dat> importresource resources.dat 1DA0 tags/H3BR3d.raw
0x00001DA0: Imported 0x61025.

tags.dat> 

tags.dat> import 5B2F tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B30 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B31 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B32 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B33 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B34 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B35 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B36 tagTemplates/0F79_rmshTemplate
Imported 0x4E0 bytes.

tags.dat> import 5B37 tagTemplates/0F7A_rmshTemplate
Imported 0x4E0 bytes.

tags.dat> import 5B38 tagTemplates/0FD8_rmshTemplate
Imported 0x9B0 bytes.

tags.dat> import 5B39 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> 

tags.dat> edit 0F71
Tag 0x00000F71.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0F71.render_model> edit geometry.compression[0]

tags.dat\0x0F71.render_model\geometry\compression[0]> SetField TextureMinV 0
TextureMinV: Single = 0

tags.dat\0x0F71.render_model\geometry\compression[0]> SetField TextureMaxV -1
TextureMaxV: Single = -1

tags.dat\0x0F71.render_model\geometry\compression[0]> savechanges
Done!

tags.dat\0x0F71.render_model\geometry\compression[0]> exitTo tags.dat

tags.dat> edit 1DA0
Tag 0x00001DA0.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1DA0.render_model> edit geometry.compression[0]

tags.dat\0x1DA0.render_model\geometry\compression[0]> SetField TextureMinV 0
TextureMinV: Single = 0

tags.dat\0x1DA0.render_model\geometry\compression[0]> SetField TextureMaxV -1
TextureMaxV: Single = -1

tags.dat\0x1DA0.render_model\geometry\compression[0]> savechanges
Done!

tags.dat\0x1DA0.render_model\geometry\compression[0]> exitTo tags.dat

tags.dat> 

tags.dat> edit 0F71
Tag 0x00000F71.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0F71.render_model> SetField markergroups[01].markers[0].Translation 0.1009767 -0.003126469 0.01598142
Translation: Vector3 = { X: 0.1009767, Y: -0.003126469, Z: 0.01598142 }

tags.dat\0x0F71.render_model> SetField markergroups[01].markers[0].Rotation -0.6101443 0.1782749 -0.4519773 0.6258264
Rotation: Vector4 = -0.6101443, 0.1782749, -0.4519773, 0.6258264

tags.dat\0x0F71.render_model> addTo markerGroups
Successfully added 1 element to MarkerGroups: List`1<MarkerGroup>
{...}[6]

tags.dat\0x0F71.render_model> edit markerGroups[*]

tags.dat\0x0F71.render_model\markerGroups[5]> SetField Name weapon_stow_anchor
Name: StringID = weapon_stow_anchor

tags.dat\0x0F71.render_model\markerGroups[5]> addTo markers
Successfully added 1 element to Markers: List`1<Marker>
{...}[1]

tags.dat\0x0F71.render_model\markerGroups[5]> edit markers[0]

tags.dat\0x0F71.render_model\markerGroups[5]\markers[0]> SetField RegionIndex -1
RegionIndex: SByte = -1

tags.dat\0x0F71.render_model\markerGroups[5]\markers[0]> SetField PermutationIndex -1
PermutationIndex: SByte = -1

tags.dat\0x0F71.render_model\markerGroups[5]\markers[0]> SetField NodeIndex 0
NodeIndex: SByte = 0

tags.dat\0x0F71.render_model\markerGroups[5]\markers[0]> SetField Unknown3 0
Unknown3: SByte = 0

tags.dat\0x0F71.render_model\markerGroups[5]\markers[0]> SetField Translation 0.01313229 -0.0006892266 0.04759113
Translation: Vector3 = { X: 0.01313229, Y: -0.0006892266, Z: 0.04759113 }

tags.dat\0x0F71.render_model\markerGroups[5]\markers[0]> SetField Rotation -0.6870458 0.3631848 0.2264535 0.587183
Rotation: Vector4 = -0.6870458, 0.3631848, 0.2264535, 0.587183

tags.dat\0x0F71.render_model\markerGroups[5]\markers[0]> SetField Scale 0
Scale: Single = 0

tags.dat\0x0F71.render_model\markerGroups[5]\markers[0]> savechanges
Done!

tags.dat\0x0F71.render_model\markerGroups[5]\markers[0]> exitTo tags.dat

tags.dat> 

tags.dat> extract 0F71 tempTag
Wrote 0x8F0 bytes to tempTag.
The tag's main struct will be at offset 0x720.

tags.dat> import 0F99 tempTag
Imported 0x8F0 bytes.

tags.dat> import 0FAE tempTag
Imported 0x8F0 bytes.

tags.dat> import 0FBA tempTag
Imported 0x8F0 bytes.

tags.dat> import 0FC6 tempTag
Imported 0x8F0 bytes.

tags.dat> import 0FD7 tempTag
Imported 0x8F0 bytes.

tags.dat> import 0FE1 tempTag
Imported 0x8F0 bytes.

tags.dat> 

tags.dat> extract 1DA0 tempTag
Wrote 0x8F0 bytes to tempTag.
The tag's main struct will be at offset 0x720.

tags.dat> import 2587 tempTag
Imported 0x8F0 bytes.

tags.dat> import 2591 tempTag
Imported 0x8F0 bytes.

tags.dat> import 2368 tempTag
Imported 0x8F0 bytes.

tags.dat> import 2375 tempTag
Imported 0x8F0 bytes.

tags.dat> import 259A tempTag
Imported 0x8F0 bytes.

tags.dat> import 2386 tempTag
Imported 0x8F0 bytes.

tags.dat> 

tags.dat> edit 0F71
Tag 0x00000F71.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0F71.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B2F
Please enter the replacement 0000101F index: 5B39
Please enter the replacement 0000101F index: 5B38
Please enter the replacement 0000101F index: 5B36
Please enter the replacement 0000101F index: 5B37
Done!

tags.dat\0x0F71.render_model> exit

tags.dat> edit 0F99
Tag 0x00000F99.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0F99.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B30
Please enter the replacement 0000101F index: 5B39
Please enter the replacement 0000101F index: 5B38
Please enter the replacement 0000101F index: 5B36
Please enter the replacement 0000101F index: 5B37
Done!

tags.dat\0x0F99.render_model> exit

tags.dat> edit 0FAE
Tag 0x00000FAE.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0FAE.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B31
Please enter the replacement 0000101F index: 5B39
Please enter the replacement 0000101F index: 5B38
Please enter the replacement 0000101F index: 5B36
Please enter the replacement 0000101F index: 5B37
Done!

tags.dat\0x0FAE.render_model> exit

tags.dat> edit 0FBA
Tag 0x00000FBA.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0FBA.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B32
Please enter the replacement 0000101F index: 5B39
Please enter the replacement 0000101F index: 5B38
Please enter the replacement 0000101F index: 5B36
Please enter the replacement 0000101F index: 5B37
Done!

tags.dat\0x0FBA.render_model> exit

tags.dat> edit 0FC6
Tag 0x00000FC6.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0FC6.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B33
Please enter the replacement 0000101F index: 5B39
Please enter the replacement 0000101F index: 5B38
Please enter the replacement 0000101F index: 5B36
Please enter the replacement 0000101F index: 5B37
Done!

tags.dat\0x0FC6.render_model> exit

tags.dat> edit 0FD7
Tag 0x00000FD7.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0FD7.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B34
Please enter the replacement 0000101F index: 5B39
Please enter the replacement 0000101F index: 5B38
Please enter the replacement 0000101F index: 5B36
Please enter the replacement 0000101F index: 5B37
Done!

tags.dat\0x0FD7.render_model> exit

tags.dat> edit 0FE1
Tag 0x00000FE1.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0FE1.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B35
Please enter the replacement 0000101F index: 5B39
Please enter the replacement 0000101F index: 5B38
Please enter the replacement 0000101F index: 5B36
Please enter the replacement 0000101F index: 5B37
Done!

tags.dat\0x0FE1.render_model> exit

tags.dat> edit 1DA0
Tag 0x00001DA0.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1DA0.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B2F
Please enter the replacement 0000101F index: 5B39
Please enter the replacement 0000101F index: 5B38
Please enter the replacement 0000101F index: 5B36
Please enter the replacement 0000101F index: 5B37
Done!

tags.dat\0x1DA0.render_model> exit

tags.dat> edit 2587
Tag 0x00002587.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2587.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B30
Please enter the replacement 0000101F index: 5B39
Please enter the replacement 0000101F index: 5B38
Please enter the replacement 0000101F index: 5B36
Please enter the replacement 0000101F index: 5B37
Done!

tags.dat\0x2587.render_model> exit

tags.dat> edit 2591
Tag 0x00002591.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2591.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B31
Please enter the replacement 0000101F index: 5B39
Please enter the replacement 0000101F index: 5B38
Please enter the replacement 0000101F index: 5B36
Please enter the replacement 0000101F index: 5B37
Done!

tags.dat\0x2591.render_model> exit

tags.dat> edit 2368
Tag 0x00002368.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2368.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B32
Please enter the replacement 0000101F index: 5B39
Please enter the replacement 0000101F index: 5B38
Please enter the replacement 0000101F index: 5B36
Please enter the replacement 0000101F index: 5B37
Done!

tags.dat\0x2368.render_model> exit

tags.dat> edit 2375
Tag 0x00002375.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2375.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B33
Please enter the replacement 0000101F index: 5B39
Please enter the replacement 0000101F index: 5B38
Please enter the replacement 0000101F index: 5B36
Please enter the replacement 0000101F index: 5B37
Done!

tags.dat\0x2375.render_model> exit

tags.dat> edit 259A
Tag 0x0000259A.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x259A.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B34
Please enter the replacement 0000101F index: 5B39
Please enter the replacement 0000101F index: 5B38
Please enter the replacement 0000101F index: 5B36
Please enter the replacement 0000101F index: 5B37
Done!

tags.dat\0x259A.render_model> exit

tags.dat> edit 2386
Tag 0x00002386.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2386.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B35
Please enter the replacement 0000101F index: 5B39
Please enter the replacement 0000101F index: 5B38
Please enter the replacement 0000101F index: 5B36
Please enter the replacement 0000101F index: 5B37
Done!

tags.dat\0x2386.render_model> exit

tags.dat> 

tags.dat> 

tags.dat> edit 5B2F
Tag 0x00005B2F.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B2F.shader> SpecifyBitmaps
Please enter the base_map index: 5B2B
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B2C
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B2D
Done!

tags.dat\0x5B2F.shader> exit

tags.dat> edit 5B30
Tag 0x00005B30.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B30.shader> SpecifyBitmaps
Please enter the base_map index: 5B2B
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B2C
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B2D
Done!

tags.dat\0x5B30.shader> exit

tags.dat> edit 5B31
Tag 0x00005B31.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B31.shader> SpecifyBitmaps
Please enter the base_map index: 5B2B
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B2C
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B2D
Done!

tags.dat\0x5B31.shader> exit

tags.dat> edit 5B32
Tag 0x00005B32.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B32.shader> SpecifyBitmaps
Please enter the base_map index: 5B2B
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B2C
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B2D
Done!

tags.dat\0x5B32.shader> exit

tags.dat> edit 5B33
Tag 0x00005B33.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B33.shader> SpecifyBitmaps
Please enter the base_map index: 5B2B
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B2C
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B2D
Done!

tags.dat\0x5B33.shader> exit

tags.dat> edit 5B34
Tag 0x00005B34.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B34.shader> SpecifyBitmaps
Please enter the base_map index: 5B2B
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B2C
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B2D
Done!

tags.dat\0x5B34.shader> exit

tags.dat> edit 5B35
Tag 0x00005B35.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B35.shader> SpecifyBitmaps
Please enter the base_map index: 5B2B
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B2C
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B2D
Done!

tags.dat\0x5B35.shader> exit

tags.dat> 

tags.dat> edit 5B36
Tag 0x00005B36.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B36.shader> SpecifyBitmaps
Please enter the self_illum_map index: 5B2E
Done!

tags.dat\0x5B36.shader> exit

tags.dat> edit 5B37
Tag 0x00005B37.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B37.shader> SpecifyBitmaps
Please enter the self_illum_map index: 5B2E
Done!

tags.dat\0x5B37.shader> exit

tags.dat> edit 5B38
Tag 0x00005B38.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B38.shader> SpecifyBitmaps
Please enter the base_map index: 0343
Please enter the detail_map index: 0343
Please enter the specular_mask_texture index: 02B9
Please enter the self_illum_map index: 0343
Done!

tags.dat\0x5B38.shader> exit

tags.dat> edit 5B39
Tag 0x00005B39.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B39.shader> SpecifyBitmaps
Please enter the base_map index: 5B2B
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B2C
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B2D
Done!

tags.dat\0x5B39.shader> exit

tags.dat> 

tags.dat> edit 5B2F
Tag 0x00005B2F.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B2F.shader> edit ShaderProperties[0]

tags.dat\0x5B2F.shader\ShaderProperties[0]> SetField arguments[19].arg1 0.8
Arg1: Single = 0.8

tags.dat\0x5B2F.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B2F.shader\ShaderProperties[0]> SetField arguments[29].arg1 1
Arg1: Single = 1

tags.dat\0x5B2F.shader\ShaderProperties[0]> SetField arguments[28].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B2F.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x5B2F.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B2F.shader\ShaderProperties[0]> SetField arguments[06].arg1 3.0
Arg1: Single = 3

tags.dat\0x5B2F.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B2F.shader\ShaderProperties[0]> exit

tags.dat\0x5B2F.shader> exit

tags.dat> edit 5B30
Tag 0x00005B30.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B30.shader> edit ShaderProperties[0]

tags.dat\0x5B30.shader\ShaderProperties[0]> SetField arguments[19].arg1 0.8
Arg1: Single = 0.8

tags.dat\0x5B30.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B30.shader\ShaderProperties[0]> SetField arguments[29].arg1 1
Arg1: Single = 1

tags.dat\0x5B30.shader\ShaderProperties[0]> SetField arguments[28].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B30.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.7
Arg2: Single = 0.7

tags.dat\0x5B30.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B30.shader\ShaderProperties[0]> SetField arguments[06].arg1 3.0
Arg1: Single = 3

tags.dat\0x5B30.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B30.shader\ShaderProperties[0]> exit

tags.dat\0x5B30.shader> exit

tags.dat> edit 5B31
Tag 0x00005B31.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B31.shader> edit ShaderProperties[0]

tags.dat\0x5B31.shader\ShaderProperties[0]> SetField arguments[19].arg1 0.8
Arg1: Single = 0.8

tags.dat\0x5B31.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B31.shader\ShaderProperties[0]> SetField arguments[29].arg1 1
Arg1: Single = 1

tags.dat\0x5B31.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B31.shader\ShaderProperties[0]> SetField arguments[28].arg2 1.0
Arg2: Single = 1

tags.dat\0x5B31.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B31.shader\ShaderProperties[0]> SetField arguments[06].arg1 3.0
Arg1: Single = 3

tags.dat\0x5B31.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B31.shader\ShaderProperties[0]> exit

tags.dat\0x5B31.shader> exit

tags.dat> edit 5B32
Tag 0x00005B32.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B32.shader> edit ShaderProperties[0]

tags.dat\0x5B32.shader\ShaderProperties[0]> SetField arguments[19].arg1 0.8
Arg1: Single = 0.8

tags.dat\0x5B32.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B32.shader\ShaderProperties[0]> SetField arguments[29].arg1 1
Arg1: Single = 1

tags.dat\0x5B32.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B32.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.4
Arg2: Single = 0.4

tags.dat\0x5B32.shader\ShaderProperties[0]> SetField arguments[28].arg3 1
Arg3: Single = 1

tags.dat\0x5B32.shader\ShaderProperties[0]> SetField arguments[06].arg1 3.0
Arg1: Single = 3

tags.dat\0x5B32.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B32.shader\ShaderProperties[0]> exit

tags.dat\0x5B32.shader> exit

tags.dat> edit 5B33
Tag 0x00005B33.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B33.shader> edit ShaderProperties[0]

tags.dat\0x5B33.shader\ShaderProperties[0]> SetField arguments[19].arg1 0.8
Arg1: Single = 0.8

tags.dat\0x5B33.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B33.shader\ShaderProperties[0]> SetField arguments[29].arg1 1
Arg1: Single = 1

tags.dat\0x5B33.shader\ShaderProperties[0]> SetField arguments[28].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B33.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x5B33.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B33.shader\ShaderProperties[0]> SetField arguments[06].arg1 3.0
Arg1: Single = 3

tags.dat\0x5B33.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B33.shader\ShaderProperties[0]> exit

tags.dat\0x5B33.shader> exit

tags.dat> edit 5B34
Tag 0x00005B34.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B34.shader> edit ShaderProperties[0]

tags.dat\0x5B34.shader\ShaderProperties[0]> SetField arguments[19].arg1 0.8
Arg1: Single = 0.8

tags.dat\0x5B34.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B34.shader\ShaderProperties[0]> SetField arguments[29].arg1 1
Arg1: Single = 1

tags.dat\0x5B34.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.7
Arg1: Single = 0.7

tags.dat\0x5B34.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x5B34.shader\ShaderProperties[0]> SetField arguments[28].arg3 1
Arg3: Single = 1

tags.dat\0x5B34.shader\ShaderProperties[0]> SetField arguments[06].arg1 3.0
Arg1: Single = 3

tags.dat\0x5B34.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B34.shader\ShaderProperties[0]> exit

tags.dat\0x5B34.shader> exit

tags.dat> edit 5B35
Tag 0x00005B35.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B35.shader> edit ShaderProperties[0]

tags.dat\0x5B35.shader\ShaderProperties[0]> SetField arguments[19].arg1 0.8
Arg1: Single = 0.8

tags.dat\0x5B35.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B35.shader\ShaderProperties[0]> SetField arguments[29].arg1 1
Arg1: Single = 1

tags.dat\0x5B35.shader\ShaderProperties[0]> SetField arguments[28].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B35.shader\ShaderProperties[0]> SetField arguments[28].arg2 1.0
Arg2: Single = 1

tags.dat\0x5B35.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B35.shader\ShaderProperties[0]> SetField arguments[06].arg1 3.0
Arg1: Single = 3

tags.dat\0x5B35.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B35.shader\ShaderProperties[0]> exit

tags.dat\0x5B35.shader> exit

tags.dat> edit 5B38
Tag 0x00005B38.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B38.shader> edit ShaderProperties[0]

tags.dat\0x5B38.shader\ShaderProperties[0]> SetField arguments[02].Arg1 0.0
Arg1: Single = 0

tags.dat\0x5B38.shader\ShaderProperties[0]> SetField arguments[02].Arg2 0.0
Arg2: Single = 0

tags.dat\0x5B38.shader\ShaderProperties[0]> SetField arguments[02].Arg3 0.0
Arg3: Single = 0

tags.dat\0x5B38.shader\ShaderProperties[0]> SetField arguments[05].Arg1 0.02
Arg1: Single = 0.02

tags.dat\0x5B38.shader\ShaderProperties[0]> SetField arguments[09].Arg1 0.5
Arg1: Single = 0.5

tags.dat\0x5B38.shader\ShaderProperties[0]> SetField arguments[10].Arg1 1
Arg1: Single = 1

tags.dat\0x5B38.shader\ShaderProperties[0]> SetField arguments[12].Arg1 0.4
Arg1: Single = 0.4

tags.dat\0x5B38.shader\ShaderProperties[0]> SetField arguments[12].Arg2 2
Arg2: Single = 2

tags.dat\0x5B38.shader\ShaderProperties[0]> SetField arguments[12].Arg3 16
Arg3: Single = 16

tags.dat\0x5B38.shader\ShaderProperties[0]> SetField arguments[16].Arg1 0
Arg1: Single = 0

tags.dat\0x5B38.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B38.shader\ShaderProperties[0]> exit

tags.dat\0x5B38.shader> exit

tags.dat> edit 5B39
Tag 0x00005B39.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B39.shader> edit ShaderProperties[0]

tags.dat\0x5B39.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B39.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B39.shader\ShaderProperties[0]> SetField arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5B39.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B39.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x5B39.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B39.shader\ShaderProperties[0]> SetField arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B39.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B39.shader\ShaderProperties[0]> exit

tags.dat\0x5B39.shader> exit

tags.dat> 

tags.dat> importbitmap 5B2B DDS/battle_rifle.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B2B [Offset = 0x629C740, Size = 0x260]

tags.dat> importbitmap 5B2C DDS/battle_rifle_bump.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B2C [Offset = 0x629C9A0, Size = 0x260]

tags.dat> importbitmap 5B2D DDS/battle_rifle_illum.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B2D [Offset = 0x629CC00, Size = 0x260]

tags.dat> 

tags.dat> echo edit 0F96
edit 0F96 
tags.dat> echo import 0 DDS/LCD/0.dds
import 0 DDS/LCD/0.dds 
tags.dat> echo import 1 DDS/LCD/1.dds
import 1 DDS/LCD/1.dds 
tags.dat> echo import 2 DDS/LCD/2.dds
import 2 DDS/LCD/2.dds 
tags.dat> echo import 3 DDS/LCD/3.dds
import 3 DDS/LCD/3.dds 
tags.dat> echo import 4 DDS/LCD/4.dds
import 4 DDS/LCD/4.dds 
tags.dat> echo import 5 DDS/LCD/5.dds
import 5 DDS/LCD/5.dds 
tags.dat> echo import 6 DDS/LCD/6.dds
import 6 DDS/LCD/6.dds 
tags.dat> echo import 7 DDS/LCD/7.dds
import 7 DDS/LCD/7.dds 
tags.dat> echo import 8 DDS/LCD/8.dds
import 8 DDS/LCD/8.dds 
tags.dat> echo import 9 DDS/LCD/9.dds
import 9 DDS/LCD/9.dds 
tags.dat> echo exit
exit 
tags.dat> echo extract 0F96 tags\bitm_BROnes.tag
extract 0F96 tags\bitm_BROnes.tag 
tags.dat> echo extractresource textures.dat 0F96 tags\ones\bitm_BROnes_0.bitm 0
extractresource textures.dat 0F96 tags\ones\bitm_BROnes_0.bitm 0 
tags.dat> echo extractresource textures.dat 0F96 tags\ones\bitm_BROnes_1.bitm 1
extractresource textures.dat 0F96 tags\ones\bitm_BROnes_1.bitm 1 
tags.dat> echo extractresource textures.dat 0F96 tags\ones\bitm_BROnes_2.bitm 2
extractresource textures.dat 0F96 tags\ones\bitm_BROnes_2.bitm 2 
tags.dat> echo extractresource textures.dat 0F96 tags\ones\bitm_BROnes_3.bitm 3
extractresource textures.dat 0F96 tags\ones\bitm_BROnes_3.bitm 3 
tags.dat> echo extractresource textures.dat 0F96 tags\ones\bitm_BROnes_4.bitm 4
extractresource textures.dat 0F96 tags\ones\bitm_BROnes_4.bitm 4 
tags.dat> echo extractresource textures.dat 0F96 tags\ones\bitm_BROnes_5.bitm 5
extractresource textures.dat 0F96 tags\ones\bitm_BROnes_5.bitm 5 
tags.dat> echo extractresource textures.dat 0F96 tags\ones\bitm_BROnes_6.bitm 6
extractresource textures.dat 0F96 tags\ones\bitm_BROnes_6.bitm 6 
tags.dat> echo extractresource textures.dat 0F96 tags\ones\bitm_BROnes_7.bitm 7
extractresource textures.dat 0F96 tags\ones\bitm_BROnes_7.bitm 7 
tags.dat> echo extractresource textures.dat 0F96 tags\ones\bitm_BROnes_8.bitm 8
extractresource textures.dat 0F96 tags\ones\bitm_BROnes_8.bitm 8 
tags.dat> echo extractresource textures.dat 0F96 tags\ones\bitm_BROnes_9.bitm 9
extractresource textures.dat 0F96 tags\ones\bitm_BROnes_9.bitm 9 
tags.dat> 

tags.dat> import 5B2E tags/bitm_BROnes.tag
Imported 0xC30 bytes.

tags.dat> 

tags.dat> importresource textures.dat 5B2E tags/ones
0x00005B2E: Imported 0x276.

tags.dat> 

tags.dat> dumplog H3BR.log
