Tag Tool [1.0.6043.10715]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...23340 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 2:40 PM.
Reading stringIDs...39505 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmBRbase
Unrecognized command: bitmBRbase
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmBRbump
Unrecognized command: bitmBRbump
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmBRillu
Unrecognized command: bitmBRillu
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmBROnes
Unrecognized command: bitmBROnes
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadBR0def
Unrecognized command: shadBR0def
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadBR1ora
Unrecognized command: shadBR1ora
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadBR2gre
Unrecognized command: shadBR2gre
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadBR3blu
Unrecognized command: shadBR3blu
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadBR4red
Unrecognized command: shadBR4red
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadBR5pur
Unrecognized command: shadBR5pur
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadBR6yel
Unrecognized command: shadBR6yel
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadBROnes
Unrecognized command: shadBROnes
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadBRTens
Unrecognized command: shadBRTens
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadBRlens
Unrecognized command: shadBRlens
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadBRrubb
Unrecognized command: shadBRrubb
Use "help" to list available commands.

tags.dat> 0F71
Unrecognized command: 0F71
Use "help" to list available commands.

tags.dat> modeBR0fp
Unrecognized command: modeBR0fp
Use "help" to list available commands.

tags.dat> 0F99
Unrecognized command: 0F99
Use "help" to list available commands.

tags.dat> modeBR1fp
Unrecognized command: modeBR1fp
Use "help" to list available commands.

tags.dat> 0FAE
Unrecognized command: 0FAE
Use "help" to list available commands.

tags.dat> modeBR2fp
Unrecognized command: modeBR2fp
Use "help" to list available commands.

tags.dat> 0FBA
Unrecognized command: 0FBA
Use "help" to list available commands.

tags.dat> modeBR3fp
Unrecognized command: modeBR3fp
Use "help" to list available commands.

tags.dat> 0FC6
Unrecognized command: 0FC6
Use "help" to list available commands.

tags.dat> modeBR4fp
Unrecognized command: modeBR4fp
Use "help" to list available commands.

tags.dat> 0FD7
Unrecognized command: 0FD7
Use "help" to list available commands.

tags.dat> modeBR5fp
Unrecognized command: modeBR5fp
Use "help" to list available commands.

tags.dat> 0FE1
Unrecognized command: 0FE1
Use "help" to list available commands.

tags.dat> modeBR6fp
Unrecognized command: modeBR6fp
Use "help" to list available commands.

tags.dat> 1D85
Unrecognized command: 1D85
Use "help" to list available commands.

tags.dat> jmadBRdefault
Unrecognized command: jmadBRdefault
Use "help" to list available commands.

tags.dat> 1DA0
Unrecognized command: 1DA0
Use "help" to list available commands.

tags.dat> modeBR03d
Unrecognized command: modeBR03d
Use "help" to list available commands.

tags.dat> 2368
Unrecognized command: 2368
Use "help" to list available commands.

tags.dat> modeBR33d
Unrecognized command: modeBR33d
Use "help" to list available commands.

tags.dat> 2375
Unrecognized command: 2375
Use "help" to list available commands.

tags.dat> modeBR43d
Unrecognized command: modeBR43d
Use "help" to list available commands.

tags.dat> 2386
Unrecognized command: 2386
Use "help" to list available commands.

tags.dat> modeBR63d
Unrecognized command: modeBR63d
Use "help" to list available commands.

tags.dat> 2587
Unrecognized command: 2587
Use "help" to list available commands.

tags.dat> modeBR13d
Unrecognized command: modeBR13d
Use "help" to list available commands.

tags.dat> 2591
Unrecognized command: 2591
Use "help" to list available commands.

tags.dat> modeBR23d
Unrecognized command: modeBR23d
Use "help" to list available commands.

tags.dat> 259A
Unrecognized command: 259A
Use "help" to list available commands.

tags.dat> modeBR53d
Unrecognized command: modeBR53d
Use "help" to list available commands.

tags.dat> // Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Unrecognized command: //
Use "help" to list available commands.

tags.dat> ====
Unrecognized command: ====
Use "help" to list available commands.

tags.dat> 0F96
Unrecognized command: 0F96
Use "help" to list available commands.

tags.dat> bitmBRDefaultOnes
Unrecognized command: bitmBRDefaultOnes
Use "help" to list available commands.

tags.dat> ====
Unrecognized command: ====
Use "help" to list available commands.

tags.dat> ====
Unrecognized command: ====
Use "help" to list available commands.

tags.dat> echo

tags.dat> //
Unrecognized command: //
Use "help" to list available commands.

tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> 

tags.dat> SetLocale US

tags.dat> 

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B2C [Offset = 0x6299C3C, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B2D [Offset = 0x6299CB8, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B2E [Offset = 0x6299D34, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B2F [Offset = 0x6299DB0, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B30 [Offset = 0x6299E2C, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B31 [Offset = 0x6299EA8, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B32 [Offset = 0x6299F24, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B33 [Offset = 0x6299FA0, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B34 [Offset = 0x629A01C, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B35 [Offset = 0x629A098, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B36 [Offset = 0x629A114, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B37 [Offset = 0x629A190, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B38 [Offset = 0x629A20C, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B39 [Offset = 0x629A288, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B3A [Offset = 0x629A304, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B3B [Offset = 0x629A380, Size = 0x7C]

tags.dat> 

tags.dat> import modeBR0fp tags/H3BRfp.tag
import: Import a tag from a file

Usage:
import <tag index> <filename>

Use "help import" for more information.

tags.dat> import modeBR03d tags/H3BR3d.tag
import: Import a tag from a file

Usage:
import <tag index> <filename>

Use "help import" for more information.

tags.dat> importresource resources.dat modeBR0fp tags/H3BRfp.raw
ERROR: Object reference not set to an instance of an object.

tags.dat> importresource resources.dat modeBR03d tags/H3BR3d.raw
ERROR: Object reference not set to an instance of an object.
