Tag Tool [1.0.5907.15260]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...29034 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 20/03/2015 at 14:40.
Reading stringIDs...37422 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> echo Halo Reach SMG Prototype for Halo Online Eldewrito (0.5.1.1, ms23)
Halo Reach SMG Prototype for Halo Online Eldewrito (0.5.1.1, ms23) 
tags.dat> echo Halo Reach SMG Prototype for Halo Online Eldewrito (0.5.1.1, ms23)
Halo Reach SMG Prototype for Halo Online Eldewrito (0.5.1.1, ms23) 
tags.dat> XXXX
Unrecognized command: XXXX
Use "help" to list available commands.

tags.dat> 

tags.dat> 

tags.dat> echo

tags.dat> echo

tags.dat> echo Halo Reach SMG Prototype for Halo Online Eldewrito (0.5.1.1, ms23)
Halo Reach SMG Prototype for Halo Online Eldewrito (0.5.1.1, ms23) 
tags.dat> echo Halo Reach SMG Prototype for Halo Online Eldewrito (0.5.1.1, ms23)
Halo Reach SMG Prototype for Halo Online Eldewrito (0.5.1.1, ms23) 
tags.dat> 157D
Unrecognized command: 157D
Use "help" to list available commands.

tags.dat> 157D
Unrecognized command: 157D
Use "help" to list available commands.

tags.dat> 158C
Unrecognized command: 158C
Use "help" to list available commands.

tags.dat> 158C
Unrecognized command: 158C
Use "help" to list available commands.

tags.dat> 158D
Unrecognized command: 158D
Use "help" to list available commands.

tags.dat> 158D
Unrecognized command: 158D
Use "help" to list available commands.

tags.dat> 158E
Unrecognized command: 158E
Use "help" to list available commands.

tags.dat> 158E
Unrecognized command: 158E
Use "help" to list available commands.

tags.dat> 158F
Unrecognized command: 158F
Use "help" to list available commands.

tags.dat> 158F
Unrecognized command: 158F
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7154
Unrecognized command: 7154
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7155
Unrecognized command: 7155
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7156
Unrecognized command: 7156
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7157
Unrecognized command: 7157
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7158
Unrecognized command: 7158
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7159
Unrecognized command: 7159
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 715A
Unrecognized command: 715A
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 715B
Unrecognized command: 715B
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 715C
Unrecognized command: 715C
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 715D
Unrecognized command: 715D
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 715E
Unrecognized command: 715E
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 715F
Unrecognized command: 715F
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7160
Unrecognized command: 7160
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7161
Unrecognized command: 7161
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7162
Unrecognized command: 7162
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7163
Unrecognized command: 7163
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7164
Unrecognized command: 7164
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7165
Unrecognized command: 7165
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7166
Unrecognized command: 7166
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7167
Unrecognized command: 7167
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7168
Unrecognized command: 7168
Use "help" to list available commands.

tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> 

tags.dat> importbitmap 7168 textures/10CE.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00007168 [Offset = 0x7EFBD30, Size = 0x260]

tags.dat> echo importbitmap 7168 textures/10CE_1024.dds
importbitmap 7168 textures/10CE_1024.dds 
tags.dat> 

tags.dat> import 7163 tags/shad_HRSMG0def
Imported 0xD60 bytes.

tags.dat> import 7164 tags/shad_HRSMG1ora
Imported 0xD60 bytes.

tags.dat> import 7165 tags/shad_HRSMG2gre
Imported 0xD60 bytes.

tags.dat> import 7166 tags/shad_HRSMG4red
Imported 0xD60 bytes.

tags.dat> import 7167 tags/shad_HRSMG6yel
Imported 0xD60 bytes.

tags.dat> 

tags.dat> import 7154 tags/1F46_hlmtHOSMG.tag
Imported 0x3C0 bytes.

tags.dat> import 7155 tags/1F46_hlmtHOSMG.tag
Imported 0x3C0 bytes.

tags.dat> import 7156 tags/1F46_hlmtHOSMG.tag
Imported 0x3C0 bytes.

tags.dat> import 7157 tags/1F46_hlmtHOSMG.tag
Imported 0x3C0 bytes.

tags.dat> import 7158 tags/1F46_hlmtHOSMG.tag
Imported 0x3C0 bytes.

tags.dat> 

tags.dat> import 7159 tags/10C8_modeHOSMG.tag
Imported 0x7B0 bytes.

tags.dat> import 715A tags/10C8_modeHOSMG.tag
Imported 0x7B0 bytes.

tags.dat> import 715B tags/10C8_modeHOSMG.tag
Imported 0x7B0 bytes.

tags.dat> import 715C tags/10C8_modeHOSMG.tag
Imported 0x7B0 bytes.

tags.dat> import 715D tags/10C8_modeHOSMG.tag
Imported 0x7B0 bytes.

tags.dat> 

tags.dat> import 715E tags/1F79_modeHOSMG.tag
Imported 0x790 bytes.

tags.dat> import 715F tags/1F79_modeHOSMG.tag
Imported 0x790 bytes.

tags.dat> import 7160 tags/1F79_modeHOSMG.tag
Imported 0x790 bytes.

tags.dat> import 7161 tags/1F79_modeHOSMG.tag
Imported 0x790 bytes.

tags.dat> import 7162 tags/1F79_modeHOSMG.tag
Imported 0x790 bytes.

tags.dat> 

tags.dat> edit 7163
Tag 0x00007163.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7163.shader> SpecifyBitmaps
Please enter the base_map index: 10CB
Please enter the detail_map index: 0EEF
Please enter the color_mask_map index: 0375
Please enter the bump_map index: 10CC
Please enter the bump_detail_map index: 0EF0
Please enter the material_texture index: 10CD
Please enter the self_illum_map index: 7168
Done!

tags.dat\0x7163.shader> exit

tags.dat> edit 7164
Tag 0x00007164.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7164.shader> SpecifyBitmaps
Please enter the base_map index: 10CB
Please enter the detail_map index: 0EEF
Please enter the color_mask_map index: 0375
Please enter the bump_map index: 10CC
Please enter the bump_detail_map index: 0EF0
Please enter the material_texture index: 10CD
Please enter the self_illum_map index: 7168
Done!

tags.dat\0x7164.shader> exit

tags.dat> edit 7165
Tag 0x00007165.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7165.shader> SpecifyBitmaps
Please enter the base_map index: 10CB
Please enter the detail_map index: 0EEF
Please enter the color_mask_map index: 0375
Please enter the bump_map index: 10CC
Please enter the bump_detail_map index: 0EF0
Please enter the material_texture index: 10CD
Please enter the self_illum_map index: 7168
Done!

tags.dat\0x7165.shader> exit

tags.dat> edit 7166
Tag 0x00007166.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7166.shader> SpecifyBitmaps
Please enter the base_map index: 10CB
Please enter the detail_map index: 0EEF
Please enter the color_mask_map index: 0375
Please enter the bump_map index: 10CC
Please enter the bump_detail_map index: 0EF0
Please enter the material_texture index: 10CD
Please enter the self_illum_map index: 7168
Done!

tags.dat\0x7166.shader> exit

tags.dat> edit 7167
Tag 0x00007167.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7167.shader> SpecifyBitmaps
Please enter the base_map index: 10CB
Please enter the detail_map index: 0EEF
Please enter the color_mask_map index: 0375
Please enter the bump_map index: 10CC
Please enter the bump_detail_map index: 0EF0
Please enter the material_texture index: 10CD
Please enter the self_illum_map index: 7168
Done!

tags.dat\0x7167.shader> exit

tags.dat> 

tags.dat> edit 157D
Tag 0x0000157D.weapon has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x157D.weapon> SetField Model 7154
Model: TagInstance = 0x00007154

tags.dat\0x157D.weapon> SetField FirstPerson[0].FirstPersonModel 7159
FirstPersonModel: TagInstance = 0x00007159

tags.dat\0x157D.weapon> SetField FirstPerson[1].FirstPersonModel 7159
FirstPersonModel: TagInstance = 0x00007159

tags.dat\0x157D.weapon> savechanges
Done!

tags.dat\0x157D.weapon> exit

tags.dat> edit 158C
Tag 0x0000158C.weapon has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x158C.weapon> SetField Model 7155
Model: TagInstance = 0x00007155

tags.dat\0x158C.weapon> SetField FirstPerson[0].FirstPersonModel 715A
FirstPersonModel: TagInstance = 0x0000715A

tags.dat\0x158C.weapon> SetField FirstPerson[1].FirstPersonModel 715A
FirstPersonModel: TagInstance = 0x0000715A

tags.dat\0x158C.weapon> savechanges
Done!

tags.dat\0x158C.weapon> exit

tags.dat> edit 158D
Tag 0x0000158D.weapon has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x158D.weapon> SetField Model 7156
Model: TagInstance = 0x00007156

tags.dat\0x158D.weapon> SetField FirstPerson[0].FirstPersonModel 715B
FirstPersonModel: TagInstance = 0x0000715B

tags.dat\0x158D.weapon> SetField FirstPerson[1].FirstPersonModel 715B
FirstPersonModel: TagInstance = 0x0000715B

tags.dat\0x158D.weapon> savechanges
Done!

tags.dat\0x158D.weapon> exit

tags.dat> edit 158E
Tag 0x0000158E.weapon has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x158E.weapon> SetField Model 7157
Model: TagInstance = 0x00007157

tags.dat\0x158E.weapon> SetField FirstPerson[0].FirstPersonModel 715C
FirstPersonModel: TagInstance = 0x0000715C

tags.dat\0x158E.weapon> SetField FirstPerson[1].FirstPersonModel 715C
FirstPersonModel: TagInstance = 0x0000715C

tags.dat\0x158E.weapon> savechanges
Done!

tags.dat\0x158E.weapon> exit

tags.dat> edit 158F
Tag 0x0000158F.weapon has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x158F.weapon> SetField Model 7158
Model: TagInstance = 0x00007158

tags.dat\0x158F.weapon> SetField FirstPerson[0].FirstPersonModel 715D
FirstPersonModel: TagInstance = 0x0000715D

tags.dat\0x158F.weapon> SetField FirstPerson[1].FirstPersonModel 715D
FirstPersonModel: TagInstance = 0x0000715D

tags.dat\0x158F.weapon> savechanges
Done!

tags.dat\0x158F.weapon> exit

tags.dat> 

tags.dat> edit 7154
Tag 0x00007154.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7154.model> SetField Rendermodel 715E
RenderModel: TagInstance = 0x0000715E

tags.dat\0x7154.model> savechanges
Done!

tags.dat\0x7154.model> exit

tags.dat> edit 7155
Tag 0x00007155.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7155.model> SetField Rendermodel 715F
RenderModel: TagInstance = 0x0000715F

tags.dat\0x7155.model> savechanges
Done!

tags.dat\0x7155.model> exit

tags.dat> edit 7156
Tag 0x00007156.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7156.model> SetField Rendermodel 7160
RenderModel: TagInstance = 0x00007160

tags.dat\0x7156.model> savechanges
Done!

tags.dat\0x7156.model> exit

tags.dat> edit 7157
Tag 0x00007157.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7157.model> SetField Rendermodel 7161
RenderModel: TagInstance = 0x00007161

tags.dat\0x7157.model> savechanges
Done!

tags.dat\0x7157.model> exit

tags.dat> edit 7158
Tag 0x00007158.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7158.model> SetField Rendermodel 7162
RenderModel: TagInstance = 0x00007162

tags.dat\0x7158.model> savechanges
Done!

tags.dat\0x7158.model> exit

tags.dat> 

tags.dat> edit 7159
Tag 0x00007159.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7159.render_model> SpecifyShaders
Please enter the replacement 000010C9 index: 7163
Please enter the replacement 000010CA index: 10CA
Done!

tags.dat\0x7159.render_model> exit

tags.dat> edit 715A
Tag 0x0000715A.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x715A.render_model> SpecifyShaders
Please enter the replacement 000010C9 index: 7164
Please enter the replacement 000010CA index: 10CA
Done!

tags.dat\0x715A.render_model> exit

tags.dat> edit 715B
Tag 0x0000715B.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x715B.render_model> SpecifyShaders
Please enter the replacement 000010C9 index: 7165
Please enter the replacement 000010CA index: 10CA
Done!

tags.dat\0x715B.render_model> exit

tags.dat> edit 715C
Tag 0x0000715C.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x715C.render_model> SpecifyShaders
Please enter the replacement 000010C9 index: 7166
Please enter the replacement 000010CA index: 10CA
Done!

tags.dat\0x715C.render_model> exit

tags.dat> edit 715D
Tag 0x0000715D.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x715D.render_model> SpecifyShaders
Please enter the replacement 000010C9 index: 7167
Please enter the replacement 000010CA index: 10CA
Done!

tags.dat\0x715D.render_model> exit

tags.dat> 

tags.dat> edit 715E
Tag 0x0000715E.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x715E.render_model> SpecifyShaders
Please enter the replacement 000010C9 index: 7163
Done!

tags.dat\0x715E.render_model> exit

tags.dat> edit 715F
Tag 0x0000715F.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x715F.render_model> SpecifyShaders
Please enter the replacement 000010C9 index: 7164
Done!

tags.dat\0x715F.render_model> exit

tags.dat> edit 7160
Tag 0x00007160.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7160.render_model> SpecifyShaders
Please enter the replacement 000010C9 index: 7165
Done!

tags.dat\0x7160.render_model> exit

tags.dat> edit 7161
Tag 0x00007161.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7161.render_model> SpecifyShaders
Please enter the replacement 000010C9 index: 7166
Done!

tags.dat\0x7161.render_model> exit

tags.dat> edit 7162
Tag 0x00007162.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7162.render_model> SpecifyShaders
Please enter the replacement 000010C9 index: 7167
Done!

tags.dat\0x7162.render_model> exit

tags.dat> 

tags.dat> dumplog reachSMG.log
