Tag Tool [1.0.6043.10715]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...23264 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 2:40 PM.
Reading stringIDs...39505 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> // Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Unrecognized command: //
Use "help" to list available commands.

tags.dat> // Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Unrecognized command: //
Use "help" to list available commands.

tags.dat> 1580 
Unrecognized command: 1580
Use "help" to list available commands.

tags.dat> 1580 
Unrecognized command: 1580
Use "help" to list available commands.

tags.dat> 15BF 
Unrecognized command: 15BF
Use "help" to list available commands.

tags.dat> 15BF 
Unrecognized command: 15BF
Use "help" to list available commands.

tags.dat> 1588 
Unrecognized command: 1588
Use "help" to list available commands.

tags.dat> 1588 
Unrecognized command: 1588
Use "help" to list available commands.

tags.dat> 1589 
Unrecognized command: 1589
Use "help" to list available commands.

tags.dat> 1589 
Unrecognized command: 1589
Use "help" to list available commands.

tags.dat> 158A 
Unrecognized command: 158A
Use "help" to list available commands.

tags.dat> 158A 
Unrecognized command: 158A
Use "help" to list available commands.

tags.dat> 15BE 
Unrecognized command: 15BE
Use "help" to list available commands.

tags.dat> 15BE 
Unrecognized command: 15BE
Use "help" to list available commands.

tags.dat> 158B 
Unrecognized command: 158B
Use "help" to list available commands.

tags.dat> 158B 
Unrecognized command: 158B
Use "help" to list available commands.

tags.dat> 0FF3 
Unrecognized command: 0FF3
Use "help" to list available commands.

tags.dat> 0FF3 
Unrecognized command: 0FF3
Use "help" to list available commands.

tags.dat> 1057 
Unrecognized command: 1057
Use "help" to list available commands.

tags.dat> 1057 
Unrecognized command: 1057
Use "help" to list available commands.

tags.dat> 1031 
Unrecognized command: 1031
Use "help" to list available commands.

tags.dat> 1031 
Unrecognized command: 1031
Use "help" to list available commands.

tags.dat> 103D 
Unrecognized command: 103D
Use "help" to list available commands.

tags.dat> 103D 
Unrecognized command: 103D
Use "help" to list available commands.

tags.dat> 1048 
Unrecognized command: 1048
Use "help" to list available commands.

tags.dat> 1048 
Unrecognized command: 1048
Use "help" to list available commands.

tags.dat> 101E 
Unrecognized command: 101E
Use "help" to list available commands.

tags.dat> 101E 
Unrecognized command: 101E
Use "help" to list available commands.

tags.dat> 1059 
Unrecognized command: 1059
Use "help" to list available commands.

tags.dat> 1059 
Unrecognized command: 1059
Use "help" to list available commands.

tags.dat> 1E25
Unrecognized command: 1E25
Use "help" to list available commands.

tags.dat> 1E25
Unrecognized command: 1E25
Use "help" to list available commands.

tags.dat> 25AD
Unrecognized command: 25AD
Use "help" to list available commands.

tags.dat> 25AD
Unrecognized command: 25AD
Use "help" to list available commands.

tags.dat> 239A
Unrecognized command: 239A
Use "help" to list available commands.

tags.dat> 239A
Unrecognized command: 239A
Use "help" to list available commands.

tags.dat> 23AA
Unrecognized command: 23AA
Use "help" to list available commands.

tags.dat> 23AA
Unrecognized command: 23AA
Use "help" to list available commands.

tags.dat> 23B9
Unrecognized command: 23B9
Use "help" to list available commands.

tags.dat> 23B9
Unrecognized command: 23B9
Use "help" to list available commands.

tags.dat> 25A3
Unrecognized command: 25A3
Use "help" to list available commands.

tags.dat> 25A3
Unrecognized command: 25A3
Use "help" to list available commands.

tags.dat> 23C5
Unrecognized command: 23C5
Use "help" to list available commands.

tags.dat> 23C5
Unrecognized command: 23C5
Use "help" to list available commands.

tags.dat> // Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Unrecognized command: //
Use "help" to list available commands.

tags.dat> // Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Unrecognized command: //
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmRDMR0defa
Unrecognized command: bitmRDMR0defa
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmRDMR1purp
Unrecognized command: bitmRDMR1purp
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmRDMR2gren
Unrecognized command: bitmRDMR2gren
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmRDMR3oran
Unrecognized command: bitmRDMR3oran
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmRDMR4redd
Unrecognized command: bitmRDMR4redd
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmRDMR5blue
Unrecognized command: bitmRDMR5blue
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmRDMR6gold
Unrecognized command: bitmRDMR6gold
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmRDMRillu
Unrecognized command: bitmRDMRillu
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmRDMRbump
Unrecognized command: bitmRDMRbump
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmRDMRdeca
Unrecognized command: bitmRDMRdeca
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmRDMRones
Unrecognized command: bitmRDMRones
Use "help" to list available commands.

tags.dat> // Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Unrecognized command: //
Use "help" to list available commands.

tags.dat> // Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Unrecognized command: //
Use "help" to list available commands.

tags.dat> 1017
Unrecognized command: 1017
Use "help" to list available commands.

tags.dat> bitmRDMRdefaultones
Unrecognized command: bitmRDMRdefaultones
Use "help" to list available commands.

tags.dat> // Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Unrecognized command: //
Use "help" to list available commands.

tags.dat> // Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Unrecognized command: //
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRglass
Unrecognized command: shadRDMRglass
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRshin0
Unrecognized command: shadRDMRshin0
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRrubb0
Unrecognized command: shadRDMRrubb0
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRdecal
Unrecognized command: shadRDMRdecal
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRlens0
Unrecognized command: shadRDMRlens0
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRones0
Unrecognized command: shadRDMRones0
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRtens0
Unrecognized command: shadRDMRtens0
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRdefaC
Unrecognized command: shadRDMRdefaC
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRpurpC
Unrecognized command: shadRDMRpurpC
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRgrenC
Unrecognized command: shadRDMRgrenC
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRoranC
Unrecognized command: shadRDMRoranC
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRreddC
Unrecognized command: shadRDMRreddC
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRblueC
Unrecognized command: shadRDMRblueC
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRgoldC
Unrecognized command: shadRDMRgoldC
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRdefaM
Unrecognized command: shadRDMRdefaM
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRpurpM
Unrecognized command: shadRDMRpurpM
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRgrenM
Unrecognized command: shadRDMRgrenM
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRoranM
Unrecognized command: shadRDMRoranM
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRreddM
Unrecognized command: shadRDMRreddM
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRblueM
Unrecognized command: shadRDMRblueM
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadRDMRgoldM
Unrecognized command: shadRDMRgoldM
Use "help" to list available commands.

tags.dat> // Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Unrecognized command: //
Use "help" to list available commands.

tags.dat> // Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Unrecognized command: //
Use "help" to list available commands.

tags.dat> echo 

tags.dat> // 
Unrecognized command: //
Use "help" to list available commands.

tags.dat> // Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Unrecognized command: //
Use "help" to list available commands.

tags.dat> // Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Unrecognized command: //
Use "help" to list available commands.

tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> 

tags.dat> SetLocale US

tags.dat> 

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AE0 [Offset = 0x62981BC, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AE1 [Offset = 0x6298238, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AE2 [Offset = 0x62982B4, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AE3 [Offset = 0x6298330, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AE4 [Offset = 0x62983AC, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AE5 [Offset = 0x6298428, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AE6 [Offset = 0x62984A4, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AE7 [Offset = 0x6298520, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AE8 [Offset = 0x629859C, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AE9 [Offset = 0x6298618, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AEA [Offset = 0x6298694, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AEB [Offset = 0x6298710, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AEC [Offset = 0x629878C, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AED [Offset = 0x6298808, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AEE [Offset = 0x6298884, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AEF [Offset = 0x6298900, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AF0 [Offset = 0x629897C, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AF1 [Offset = 0x62989F8, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AF2 [Offset = 0x6298A74, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AF3 [Offset = 0x6298AF0, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AF4 [Offset = 0x6298B6C, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AF5 [Offset = 0x6298BE8, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AF6 [Offset = 0x6298C64, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AF7 [Offset = 0x6298CE0, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AF8 [Offset = 0x6298D5C, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AF9 [Offset = 0x6298DD8, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AFA [Offset = 0x6298E54, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AFB [Offset = 0x6298ED0, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AFC [Offset = 0x6298F4C, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AFD [Offset = 0x6298FC8, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AFE [Offset = 0x6299044, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005AFF [Offset = 0x62990C0, Size = 0x7C]

tags.dat> 

tags.dat> import 0FF3  tags/modeReachDMRfp
Imported 0xC10 bytes.

tags.dat> importresource resources.dat 0FF3  tags/reachDMRfp.raw
0x00000FF3: Imported 0x360495.

tags.dat> 

tags.dat> // fix mode
Unrecognized command: //
Use "help" to list available commands.

tags.dat> edit 0FF3 
Tag 0x00000FF3.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0FF3.render_model> SetField Nodes[0].Name gun
Name: StringID = gun

tags.dat\0x0FF3.render_model> SetField Nodes[1].Name magazine
Name: StringID = magazine

tags.dat\0x0FF3.render_model> SetField Nodes[2].Name safety
Name: StringID = safety

tags.dat\0x0FF3.render_model> SetField Nodes[3].Name ophandle
Name: StringID = ophandle

tags.dat\0x0FF3.render_model> SetField Nodes[3].DefaultTranslation 0.0035 0.003885493 0.05554584
DefaultTranslation: Vector3 = { X: 0.0035, Y: 0.003885493, Z: 0.05554584 }

tags.dat\0x0FF3.render_model> SetField markergroups[1].markers[0].Translation 0.1009767 -0.003126469 0.02598142
Translation: Vector3 = { X: 0.1009767, Y: -0.003126469, Z: 0.02598142 }

tags.dat\0x0FF3.render_model> SetField markergroups[1].markers[0].Rotation -0.6101443 0.1782749 -0.4519773 0.6258264
Rotation: Vector4 = -0.6101443, 0.1782749, -0.4519773, 0.6258264

tags.dat\0x0FF3.render_model> SetField Geometry.Compression[0].TextureMinV 0.0003441572
TextureMinV: Single = 0.0003441572

tags.dat\0x0FF3.render_model> SetField Geometry.Compression[0].TextureMaxV -1.006082
TextureMaxV: Single = -1.006082

tags.dat\0x0FF3.render_model> savechanges
Done!

tags.dat\0x0FF3.render_model> exit

tags.dat> 

tags.dat> extract 0FF3  tempTag
Wrote 0xC10 bytes to tempTag.
The tag's main struct will be at offset 0xA40.

tags.dat> import 1057  tempTag
Unable to find tag 00001057.
import: Import a tag from a file

Usage:
import <tag index> <filename>

Use "help import" for more information.

tags.dat> import 1031  tempTag
Imported 0xC10 bytes.

tags.dat> import 103D  tempTag
Imported 0xC10 bytes.

tags.dat> import 1048  tempTag
Imported 0xC10 bytes.

tags.dat> import 101E  tempTag
Imported 0xC10 bytes.

tags.dat> import 1059  tempTag
Imported 0xC10 bytes.

tags.dat> 

tags.dat> // IMPORT TEXTURES
Unrecognized command: //
Use "help" to list available commands.

tags.dat> importbitmap bitmRDMR0defa DDS/dmr_diffuse_default.dds
Loading textures.dat...
Importing image...
Creating a new tag...
ERROR: Object reference not set to an instance of an object.

tags.dat> importbitmap bitmRDMR1purp DDS/dmr_diffuse_purple.dds
Loading textures.dat...
Importing image...
Creating a new tag...
ERROR: Object reference not set to an instance of an object.

tags.dat> importbitmap bitmRDMR2gren DDS/dmr_diffuse_green.dds
Loading textures.dat...
Importing image...
Creating a new tag...
ERROR: Object reference not set to an instance of an object.

tags.dat> importbitmap bitmRDMR3oran DDS/dmr_diffuse_orange.dds
Loading textures.dat...
Importing image...
Creating a new tag...
ERROR: Object reference not set to an instance of an object.

tags.dat> importbitmap bitmRDMR4redd DDS/dmr_diffuse_red.dds
Loading textures.dat...
Importing image...
Creating a new tag...
ERROR: Object reference not set to an instance of an object.

tags.dat> importbitmap bitmRDMR5blue DDS/dmr_diffuse_blue.dds
Loading textures.dat...
Importing image...
Creating a new tag...
ERROR: Object reference not set to an instance of an object.

tags.dat> importbitmap bitmRDMR6gold DDS/dmr_diffuse_gold.dds
Loading textures.dat...
Importing image...
Creating a new tag...
ERROR: Object reference not set to an instance of an object.

tags.dat> importbitmap bitmRDMRbump DDS/dmr_normal.dds
Loading textures.dat...
Importing image...
Creating a new tag...
ERROR: Object reference not set to an instance of an object.

tags.dat> importbitmap bitmRDMRillu DDS/dmr_illu.dds
Loading textures.dat...
Importing image...
Creating a new tag...
ERROR: Object reference not set to an instance of an object.

tags.dat> importbitmap bitmRDMRdeca DDS/unsc_decals_diffuse.dds
Loading textures.dat...
Importing image...
Creating a new tag...
ERROR: Object reference not set to an instance of an object.
