Tag Tool [1.0.6043.10715]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...23264 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 2:40 PM.
Reading stringIDs...39505 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> 1580 
Unrecognized command: 1580
Use "help" to list available commands.

tags.dat> 1580 
Unrecognized command: 1580
Use "help" to list available commands.

tags.dat> 0FF3 
Unrecognized command: 0FF3
Use "help" to list available commands.

tags.dat> 0FF3 
Unrecognized command: 0FF3
Use "help" to list available commands.

tags.dat> 1E25 
Unrecognized command: 1E25
Use "help" to list available commands.

tags.dat> 1E25 
Unrecognized command: 1E25
Use "help" to list available commands.

tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5ADF
Unrecognized command: 5ADF
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AE0
Unrecognized command: 5AE0
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AE1
Unrecognized command: 5AE1
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AE2
Unrecognized command: 5AE2
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AE3
Unrecognized command: 5AE3
Use "help" to list available commands.

tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> 1017
Unrecognized command: 1017
Use "help" to list available commands.

tags.dat> 1017
Unrecognized command: 1017
Use "help" to list available commands.

tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AE4
Unrecognized command: 5AE4
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AE5
Unrecognized command: 5AE5
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AE6
Unrecognized command: 5AE6
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AE7
Unrecognized command: 5AE7
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AE8
Unrecognized command: 5AE8
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AE9
Unrecognized command: 5AE9
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AEA
Unrecognized command: 5AEA
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AEB
Unrecognized command: 5AEB
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AEC
Unrecognized command: 5AEC
Use "help" to list available commands.

tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> echo 

tags.dat> echo 

tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> 

tags.dat> SetLocale US

tags.dat> 

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AE0 [Offset = 0x62829A0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AE1 [Offset = 0x6282A20, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AE2 [Offset = 0x6282AA0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AE3 [Offset = 0x6282B20, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AE4 [Offset = 0x6282BA0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AE5 [Offset = 0x6282C20, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AE6 [Offset = 0x6282CA0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AE7 [Offset = 0x6282D20, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AE8 [Offset = 0x6282DA0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AE9 [Offset = 0x6282E20, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AEA [Offset = 0x6282EA0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AEB [Offset = 0x6282F20, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AEC [Offset = 0x6282FA0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AED [Offset = 0x6283020, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AEE [Offset = 0x62830A0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AEF [Offset = 0x6283120, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AF0 [Offset = 0x62831A0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AF1 [Offset = 0x6283220, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AF2 [Offset = 0x62832A0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AF3 [Offset = 0x6283320, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AF4 [Offset = 0x62833A0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AF5 [Offset = 0x6283420, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AF6 [Offset = 0x62834A0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AF7 [Offset = 0x6283520, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AF8 [Offset = 0x62835A0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AF9 [Offset = 0x6283620, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AFA [Offset = 0x62836A0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AFB [Offset = 0x6283720, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AFC [Offset = 0x62837A0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AFD [Offset = 0x6283820, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AFE [Offset = 0x62838A0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AFF [Offset = 0x6283920, Size = 0x80]

tags.dat> 

tags.dat> import 0FF3  tags/modeReachDMRfp
Imported 0xC10 bytes.

tags.dat> importresource resources.dat 0FF3  tags/reachDMRfp.raw
0x00000FF3: Imported 0x360495.

tags.dat> 

tags.dat> echo fix mode
fix mode 
tags.dat> edit 0FF3 
Tag 0x00000FF3.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0FF3.render_model> SetField Nodes[0].Name gun
Name: StringID = gun

tags.dat\0x0FF3.render_model> SetField Nodes[1].Name magazine
Name: StringID = magazine

tags.dat\0x0FF3.render_model> SetField Nodes[2].Name safety
Name: StringID = safety

tags.dat\0x0FF3.render_model> SetField Nodes[3].Name ophandle
Name: StringID = ophandle

tags.dat\0x0FF3.render_model> SetField Nodes[3].DefaultTranslation 0.0035 0.003885493 0.05554584
DefaultTranslation: Vector3 = { X: 0.0035, Y: 0.003885493, Z: 0.05554584 }

tags.dat\0x0FF3.render_model> SetField markergroups[1].markers[0].Translation 0.1009767 -0.003126469 0.02598142
Translation: Vector3 = { X: 0.1009767, Y: -0.003126469, Z: 0.02598142 }

tags.dat\0x0FF3.render_model> SetField markergroups[1].markers[0].Rotation -0.6101443 0.1782749 -0.4519773 0.6258264
Rotation: Vector4 = -0.6101443, 0.1782749, -0.4519773, 0.6258264

tags.dat\0x0FF3.render_model> SetField Geometry.Compression[0].TextureMinV 0.0003441572
TextureMinV: Single = 0.0003441572

tags.dat\0x0FF3.render_model> SetField Geometry.Compression[0].TextureMaxV -1.006082
TextureMaxV: Single = -1.006082

tags.dat\0x0FF3.render_model> savechanges
Done!

tags.dat\0x0FF3.render_model> exit

tags.dat> 

tags.dat> extract 0FF3  tempTag
Wrote 0xC10 bytes to tempTag.
The tag's main struct will be at offset 0xA40.

tags.dat> 

tags.dat> echo IMPORT TEXTURES
IMPORT TEXTURES 
tags.dat> importbitmap 5ADF DDS/dmr_diffuse_default.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005ADF [Offset = 0x6282710, Size = 0x260]

tags.dat> importbitmap 5AE1 DDS/dmr_normal.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005AE1 [Offset = 0x62829F0, Size = 0x260]

tags.dat> importbitmap 5AE0 DDS/dmr_illu.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005AE0 [Offset = 0x6282970, Size = 0x260]

tags.dat> importbitmap 5AE2 DDS/unsc_decals_diffuse.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005AE2 [Offset = 0x6282E30, Size = 0x260]

tags.dat> 

tags.dat> echo import shader templates
import shader templates 
tags.dat> import 5AE7 tagTemplates/1CA4_rmshTemplate
Imported 0x1D0 bytes.

tags.dat> import 5AE9 tagTemplates/105F_rmshTemplate
Imported 0x4E0 bytes.

tags.dat> import 5AEA tagTemplates/105D_rmshTemplate
Imported 0x4E0 bytes.

tags.dat> import 5AE5 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5AE6 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5AE4 tagTemplates/0FD8_rmshTemplate
Imported 0x9B0 bytes.

tags.dat> import 5AE8 tagTemplates/321E_rmshTemplate
Imported 0x1C0 bytes.

tags.dat> import 5AEB tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> 

tags.dat> edit 5AEB
Tag 0x00005AEB.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5AEB.shader> edit ShaderProperties[0]

tags.dat\0x5AEB.shader\ShaderProperties[0]> SetField Arguments[06].arg1 1
Arg1: Single = 1

tags.dat\0x5AEB.shader\ShaderProperties[0]> SetField Arguments[07].arg1 0.2
Arg1: Single = 0.2

tags.dat\0x5AEB.shader\ShaderProperties[0]> SetField Arguments[16].arg1 0.5
Arg1: Single = 0.5

tags.dat\0x5AEB.shader\ShaderProperties[0]> Setfield Arguments[19].arg1 0
Arg1: Single = 0

tags.dat\0x5AEB.shader\ShaderProperties[0]> SetField Arguments[25].arg1 0
Arg1: Single = 0

tags.dat\0x5AEB.shader\ShaderProperties[0]> SetField Arguments[25].arg2 0
Arg2: Single = 0

tags.dat\0x5AEB.shader\ShaderProperties[0]> SetField Arguments[25].arg3 0
Arg3: Single = 0

tags.dat\0x5AEB.shader\ShaderProperties[0]> SetField Arguments[28].arg1 0
Arg1: Single = 0

tags.dat\0x5AEB.shader\ShaderProperties[0]> SetField Arguments[28].arg2 1
Arg2: Single = 1

tags.dat\0x5AEB.shader\ShaderProperties[0]> SetField Arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5AEB.shader\ShaderProperties[0]> SetField Arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5AEB.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5AEB.shader\ShaderProperties[0]> exit

tags.dat\0x5AEB.shader> exit

tags.dat> 

tags.dat> extract 5AEB tempTag
Wrote 0xAE0 bytes to tempTag.
The tag's main struct will be at offset 0xA90.

tags.dat> import 5AEB tempTag
Imported 0xAE0 bytes.

tags.dat> import 5AEC tempTag
Imported 0xAE0 bytes.

tags.dat> 

tags.dat> edit 5AEB
Tag 0x00005AEB.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5AEB.shader> SpecifyBitmaps
Please enter the base_map index: 5ADF
Please enter the detail_map index: 0343
Please enter the bump_map index: 5AE1
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5AE0
Done!

tags.dat\0x5AEB.shader> exit

tags.dat> 

tags.dat> edit 5AEC
Tag 0x00005AEC.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5AEC.shader> SpecifyBitmaps
Please enter the base_map index: 5ADF
Please enter the detail_map index: 0343
Please enter the bump_map index: 5AE1
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5AE0
Done!

tags.dat\0x5AEC.shader> exit

tags.dat> 

tags.dat> edit 5AE6
Tag 0x00005AE6.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5AE6.shader> SpecifyBitmaps
Please enter the base_map index: 5ADF
Please enter the detail_map index: 0343
Please enter the bump_map index: 5AE1
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5AE0
Done!

tags.dat\0x5AE6.shader> exit

tags.dat> edit 5AE5
Tag 0x00005AE5.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5AE5.shader> SpecifyBitmaps
Please enter the base_map index: 5ADF
Please enter the detail_map index: 0343
Please enter the bump_map index: 5AE1
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5AE0
Done!

tags.dat\0x5AE5.shader> exit

tags.dat> edit 5AE9
Tag 0x00005AE9.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5AE9.shader> SpecifyBitmaps
Please enter the self_illum_map index: 5AE3
Done!

tags.dat\0x5AE9.shader> exit

tags.dat> edit 5AEA
Tag 0x00005AEA.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5AEA.shader> SpecifyBitmaps
Please enter the self_illum_map index: 5AE3
Done!

tags.dat\0x5AEA.shader> exit

tags.dat> edit 5AE7
Tag 0x00005AE7.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5AE7.shader> SpecifyBitmaps
Please enter the base_map index: 5AE2
Please enter the detail_map index: 0343
Done!

tags.dat\0x5AE7.shader> exit

tags.dat> edit 5AE4
Tag 0x00005AE4.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5AE4.shader> SpecifyBitmaps
Please enter the base_map index: 0343
Please enter the detail_map index: 0343
Please enter the specular_mask_texture index: 5ADF
Please enter the self_illum_map index: 0343
Done!

tags.dat\0x5AE4.shader> exit

tags.dat> 

tags.dat> edit 5AE6
Tag 0x00005AE6.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5AE6.shader> edit ShaderProperties[0]

tags.dat\0x5AE6.shader\ShaderProperties[0]> SetField Arguments[06].arg1 1
Arg1: Single = 1

tags.dat\0x5AE6.shader\ShaderProperties[0]> SetField Arguments[07].arg1 0.2
Arg1: Single = 0.2

tags.dat\0x5AE6.shader\ShaderProperties[0]> SetField Arguments[16].arg1 0.5
Arg1: Single = 0.5

tags.dat\0x5AE6.shader\ShaderProperties[0]> Setfield Arguments[19].arg1 0
Arg1: Single = 0

tags.dat\0x5AE6.shader\ShaderProperties[0]> SetField Arguments[25].arg1 0
Arg1: Single = 0

tags.dat\0x5AE6.shader\ShaderProperties[0]> SetField Arguments[25].arg2 0
Arg2: Single = 0

tags.dat\0x5AE6.shader\ShaderProperties[0]> SetField Arguments[25].arg3 0
Arg3: Single = 0

tags.dat\0x5AE6.shader\ShaderProperties[0]> SetField Arguments[28].arg1 0
Arg1: Single = 0

tags.dat\0x5AE6.shader\ShaderProperties[0]> SetField Arguments[28].arg2 1
Arg2: Single = 1

tags.dat\0x5AE6.shader\ShaderProperties[0]> SetField Arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5AE6.shader\ShaderProperties[0]> SetField Arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5AE6.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5AE6.shader\ShaderProperties[0]> exit

tags.dat\0x5AE6.shader> exit

tags.dat> echo gold
gold 
tags.dat> edit 5AE5
Tag 0x00005AE5.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5AE5.shader> edit ShaderProperties[0]

tags.dat\0x5AE5.shader\ShaderProperties[0]> SetField Arguments[06].arg1 1
Arg1: Single = 1

tags.dat\0x5AE5.shader\ShaderProperties[0]> SetField Arguments[07].arg1 0.2
Arg1: Single = 0.2

tags.dat\0x5AE5.shader\ShaderProperties[0]> SetField Arguments[16].arg1 0.5
Arg1: Single = 0.5

tags.dat\0x5AE5.shader\ShaderProperties[0]> Setfield Arguments[19].arg1 0
Arg1: Single = 0

tags.dat\0x5AE5.shader\ShaderProperties[0]> SetField Arguments[25].arg1 0
Arg1: Single = 0

tags.dat\0x5AE5.shader\ShaderProperties[0]> SetField Arguments[25].arg2 0
Arg2: Single = 0

tags.dat\0x5AE5.shader\ShaderProperties[0]> SetField Arguments[25].arg3 0
Arg3: Single = 0

tags.dat\0x5AE5.shader\ShaderProperties[0]> SetField Arguments[28].arg1 0
Arg1: Single = 0

tags.dat\0x5AE5.shader\ShaderProperties[0]> SetField Arguments[28].arg2 1
Arg2: Single = 1

tags.dat\0x5AE5.shader\ShaderProperties[0]> SetField Arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5AE5.shader\ShaderProperties[0]> SetField Arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5AE5.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5AE5.shader\ShaderProperties[0]> exit

tags.dat\0x5AE5.shader> exit

tags.dat> echo gold
gold 
tags.dat> edit 5AE4
Tag 0x00005AE4.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5AE4.shader> edit ShaderProperties[0]

tags.dat\0x5AE4.shader\ShaderProperties[0]> SetField Arguments[05].Arg1 1
Arg1: Single = 1

tags.dat\0x5AE4.shader\ShaderProperties[0]> SetField Arguments[02].Arg1 0.2
Arg1: Single = 0.2

tags.dat\0x5AE4.shader\ShaderProperties[0]> SetField Arguments[02].Arg1 1.0
Arg1: Single = 1

tags.dat\0x5AE4.shader\ShaderProperties[0]> SetField Arguments[02].Arg1 0.2
Arg1: Single = 0.2

tags.dat\0x5AE4.shader\ShaderProperties[0]> SetField Arguments[02].Arg1 0
Arg1: Single = 0

tags.dat\0x5AE4.shader\ShaderProperties[0]> SetField Arguments[02].Arg2 0
Arg2: Single = 0

tags.dat\0x5AE4.shader\ShaderProperties[0]> SetField Arguments[02].Arg3 0
Arg3: Single = 0

tags.dat\0x5AE4.shader\ShaderProperties[0]> SetField Arguments[05].Arg1 0.3
Arg1: Single = 0.3

tags.dat\0x5AE4.shader\ShaderProperties[0]> SetField Arguments[09].Arg1 1
Arg1: Single = 1

tags.dat\0x5AE4.shader\ShaderProperties[0]> SetField Arguments[10].Arg1 1
Arg1: Single = 1

tags.dat\0x5AE4.shader\ShaderProperties[0]> SetField Arguments[12].Arg1 1
Arg1: Single = 1

tags.dat\0x5AE4.shader\ShaderProperties[0]> SetField Arguments[12].Arg2 2
Arg2: Single = 2

tags.dat\0x5AE4.shader\ShaderProperties[0]> SetField Arguments[12].Arg3 0
Arg3: Single = 0

tags.dat\0x5AE4.shader\ShaderProperties[0]> SetField Arguments[16].Arg1 0
Arg1: Single = 0

tags.dat\0x5AE4.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5AE4.shader\ShaderProperties[0]> exit

tags.dat\0x5AE4.shader> exit

tags.dat> 

tags.dat> edit 0FF3 
Tag 0x00000FF3.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0FF3.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5AEB
Please enter the replacement 0000101F index: 5AE8
Please enter the replacement 0000101F index: 5AEC
Please enter the replacement 0000101F index: 5AE5
Please enter the replacement 0000101F index: 5AE6
Please enter the replacement 0000101F index: 5AE7
Please enter the replacement 0000101F index: 5AE4
Please enter the replacement 0000101F index: 5AE9
Please enter the replacement 0000101F index: 5AEA
Done!

tags.dat\0x0FF3.render_model> exit

tags.dat> 

tags.dat> extract 0FF3  tempTag
Wrote 0xC30 bytes to tempTag.
The tag's main struct will be at offset 0xA60.

tags.dat> import 1E25  tempTag
Imported 0xC30 bytes.

tags.dat> 

tags.dat> echo fix reloading animation
fix reloading animation 
tags.dat> edit 1E0F
Tag 0x00001E0F.model_animation_graph has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1E0F.model_animation_graph> SetField modes[0].weaponclass[0].weapontype[0].actions[8].animation 17
Animation: Int16 = 17

tags.dat\0x1E0F.model_animation_graph> savechanges
Done!

tags.dat\0x1E0F.model_animation_graph> exit

tags.dat> 

tags.dat> echo fix: crouch melee, crouch reloading; only works if host has it;
fix: crouch melee, crouch reloading; only works if host has it; 
tags.dat> echo disabled in case hosts with it cause the game to crash for those who don't have it; untested.
disabled in case hosts with it cause the game to crash for those who don't have it; untested. 
tags.dat> echo edit 1580  YYYY SetField WeaponName br YYYY savechanges YYYY exit
edit 1580 YYYY SetField WeaponName br YYYY savechanges YYYY exit 
tags.dat> echo edit weapRDMR1 YYYY SetField WeaponName br YYYY savechanges YYYY exit
edit weapRDMR1 YYYY SetField WeaponName br YYYY savechanges YYYY exit 
tags.dat> echo edit weapRDMR2 YYYY SetField WeaponName br YYYY savechanges YYYY exit
edit weapRDMR2 YYYY SetField WeaponName br YYYY savechanges YYYY exit 
tags.dat> echo edit weapRDMR3 YYYY SetField WeaponName br YYYY savechanges YYYY exit
edit weapRDMR3 YYYY SetField WeaponName br YYYY savechanges YYYY exit 
tags.dat> echo edit weapRDMR4 YYYY SetField WeaponName br YYYY savechanges YYYY exit
edit weapRDMR4 YYYY SetField WeaponName br YYYY savechanges YYYY exit 
tags.dat> echo edit weapRDMR5 YYYY SetField WeaponName br YYYY savechanges YYYY exit
edit weapRDMR5 YYYY SetField WeaponName br YYYY savechanges YYYY exit 
tags.dat> echo edit weapRDMR6 YYYY SetField WeaponName br YYYY savechanges YYYY exit
edit weapRDMR6 YYYY SetField WeaponName br YYYY savechanges YYYY exit 
tags.dat> 

tags.dat> echo edit 1017
edit 1017 
tags.dat> echo import 0 DDS/ones/numbers_plate_0.dds
import 0 DDS/ones/numbers_plate_0.dds 
tags.dat> echo import 1 DDS/ones/numbers_plate_1.dds
import 1 DDS/ones/numbers_plate_1.dds 
tags.dat> echo import 2 DDS/ones/numbers_plate_2.dds
import 2 DDS/ones/numbers_plate_2.dds 
tags.dat> echo import 3 DDS/ones/numbers_plate_3.dds
import 3 DDS/ones/numbers_plate_3.dds 
tags.dat> echo import 4 DDS/ones/numbers_plate_4.dds
import 4 DDS/ones/numbers_plate_4.dds 
tags.dat> echo import 5 DDS/ones/numbers_plate_5.dds
import 5 DDS/ones/numbers_plate_5.dds 
tags.dat> echo import 6 DDS/ones/numbers_plate_6.dds
import 6 DDS/ones/numbers_plate_6.dds 
tags.dat> echo import 7 DDS/ones/numbers_plate_7.dds
import 7 DDS/ones/numbers_plate_7.dds 
tags.dat> echo import 8 DDS/ones/numbers_plate_8.dds
import 8 DDS/ones/numbers_plate_8.dds 
tags.dat> echo import 9 DDS/ones/numbers_plate_9.dds
import 9 DDS/ones/numbers_plate_9.dds 
tags.dat> echo exit
exit 
tags.dat> echo extract 1017 tags\bitm_HRDMROnes.tag
extract 1017 tags\bitm_HRDMROnes.tag 
tags.dat> echo extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_0.bitm 0
extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_0.bitm 0 
tags.dat> echo extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_1.bitm 1
extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_1.bitm 1 
tags.dat> echo extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_2.bitm 2
extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_2.bitm 2 
tags.dat> echo extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_3.bitm 3
extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_3.bitm 3 
tags.dat> echo extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_4.bitm 4
extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_4.bitm 4 
tags.dat> echo extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_5.bitm 5
extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_5.bitm 5 
tags.dat> echo extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_6.bitm 6
extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_6.bitm 6 
tags.dat> echo extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_7.bitm 7
extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_7.bitm 7 
tags.dat> echo extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_8.bitm 8
extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_8.bitm 8 
tags.dat> echo extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_9.bitm 9
extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_9.bitm 9 
tags.dat> 

tags.dat> import 5AE3 tags/bitm_HRDMROnes.tag
Imported 0xC50 bytes.

tags.dat> 

tags.dat> importresource textures.dat 5AE3 tags/ones
0x00005AE3: Imported 0x531.

tags.dat> 

tags.dat> dumplog reachDMR.log
