Tag Tool [1.0.6043.10715]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...23309 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 2:40 PM.
Reading stringIDs...39505 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B0C
Unrecognized command: 5B0C
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B0D
Unrecognized command: 5B0D
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B0E
Unrecognized command: 5B0E
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B0F
Unrecognized command: 5B0F
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B10
Unrecognized command: 5B10
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B11
Unrecognized command: 5B11
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B12
Unrecognized command: 5B12
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B13
Unrecognized command: 5B13
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B14
Unrecognized command: 5B14
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B15
Unrecognized command: 5B15
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B16
Unrecognized command: 5B16
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B17
Unrecognized command: 5B17
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B18
Unrecognized command: 5B18
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B19
Unrecognized command: 5B19
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B1A
Unrecognized command: 5B1A
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B1B
Unrecognized command: 5B1B
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B1C
Unrecognized command: 5B1C
Use "help" to list available commands.

tags.dat> 0EE1
Unrecognized command: 0EE1
Use "help" to list available commands.

tags.dat> 0EE1
Unrecognized command: 0EE1
Use "help" to list available commands.

tags.dat> 0F22
Unrecognized command: 0F22
Use "help" to list available commands.

tags.dat> 0F22
Unrecognized command: 0F22
Use "help" to list available commands.

tags.dat> 0F32
Unrecognized command: 0F32
Use "help" to list available commands.

tags.dat> 0F32
Unrecognized command: 0F32
Use "help" to list available commands.

tags.dat> 0F52
Unrecognized command: 0F52
Use "help" to list available commands.

tags.dat> 0F52
Unrecognized command: 0F52
Use "help" to list available commands.

tags.dat> 0F61
Unrecognized command: 0F61
Use "help" to list available commands.

tags.dat> 0F61
Unrecognized command: 0F61
Use "help" to list available commands.

tags.dat> 1C7B
Unrecognized command: 1C7B
Use "help" to list available commands.

tags.dat> 1C7B
Unrecognized command: 1C7B
Use "help" to list available commands.

tags.dat> 2329
Unrecognized command: 2329
Use "help" to list available commands.

tags.dat> 2329
Unrecognized command: 2329
Use "help" to list available commands.

tags.dat> 233A
Unrecognized command: 233A
Use "help" to list available commands.

tags.dat> 233A
Unrecognized command: 233A
Use "help" to list available commands.

tags.dat> 2347
Unrecognized command: 2347
Use "help" to list available commands.

tags.dat> 2347
Unrecognized command: 2347
Use "help" to list available commands.

tags.dat> 2358
Unrecognized command: 2358
Use "help" to list available commands.

tags.dat> 2358
Unrecognized command: 2358
Use "help" to list available commands.

tags.dat> echo Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1) 
tags.dat> echo Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1) 
tags.dat> 0F09
Unrecognized command: 0F09
Use "help" to list available commands.

tags.dat> 0F09
Unrecognized command: 0F09
Use "help" to list available commands.

tags.dat> 0F40
Unrecognized command: 0F40
Use "help" to list available commands.

tags.dat> 0F40
Unrecognized command: 0F40
Use "help" to list available commands.

tags.dat> echo Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1) 
tags.dat> echo Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1) 
tags.dat> echo Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1) 
tags.dat> echo Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1) 
tags.dat> echo

tags.dat> echo

tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> 

tags.dat> SetLocale US

tags.dat> 

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B0D [Offset = 0x6296FD0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B0E [Offset = 0x6297050, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B0F [Offset = 0x62970D0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B10 [Offset = 0x6297150, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B11 [Offset = 0x62971D0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B12 [Offset = 0x6297250, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B13 [Offset = 0x62972D0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B14 [Offset = 0x6297350, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B15 [Offset = 0x62973D0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B16 [Offset = 0x6297450, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B17 [Offset = 0x62974D0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B18 [Offset = 0x6297550, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B19 [Offset = 0x62975D0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B1A [Offset = 0x6297650, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B1B [Offset = 0x62976D0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B1C [Offset = 0x6297750, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B1D [Offset = 0x62977D0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B1E [Offset = 0x6297850, Size = 0x80]

tags.dat> 

tags.dat> import 0EE1 tags/H3ARfp.tag
Imported 0xA00 bytes.

tags.dat> import 1C7B tags/H3AR3d.tag
Imported 0x980 bytes.

tags.dat> importresource resources.dat 0EE1 tags/H3ARfp.raw
0x00000EE1: Imported 0x90288.

tags.dat> importresource resources.dat 1C7B tags/H3AR3d.raw
0x00001C7B: Imported 0x69685.

tags.dat> 

tags.dat> edit 0EE1
Tag 0x00000EE1.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0EE1.render_model> edit geometry.compression[0]

tags.dat\0x0EE1.render_model\geometry\compression[0]> SetField TextureMinV 0.04066753
TextureMinV: Single = 0.04066753

tags.dat\0x0EE1.render_model\geometry\compression[0]> SetField TextureMaxV -1.039278
TextureMaxV: Single = -1.039278

tags.dat\0x0EE1.render_model\geometry\compression[0]> savechanges
Done!

tags.dat\0x0EE1.render_model\geometry\compression[0]> exitTo tags.dat

tags.dat> edit 1C7B
Tag 0x00001C7B.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1C7B.render_model> edit geometry.compression[0]

tags.dat\0x1C7B.render_model\geometry\compression[0]> SetField TextureMinV 0.007111788
TextureMinV: Single = 0.007111788

tags.dat\0x1C7B.render_model\geometry\compression[0]> SetField TextureMaxV -1.000966
TextureMaxV: Single = -1.000966

tags.dat\0x1C7B.render_model\geometry\compression[0]> savechanges
Done!

tags.dat\0x1C7B.render_model\geometry\compression[0]> exitTo tags.dat

tags.dat> 

tags.dat> edit 0EE1
Tag 0x00000EE1.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0EE1.render_model> SetField markergroups[01].markers[0].RegionIndex -1
RegionIndex: SByte = -1

tags.dat\0x0EE1.render_model> SetField markergroups[01].markers[0].PermutationIndex -1
PermutationIndex: SByte = -1

tags.dat\0x0EE1.render_model> SetField markergroups[01].markers[0].NodeIndex 0
NodeIndex: SByte = 0

tags.dat\0x0EE1.render_model> SetField markergroups[01].markers[0].Unknown3 0
Unknown3: SByte = 0

tags.dat\0x0EE1.render_model> SetField markergroups[01].markers[0].Translation 0.1010085 -0.002260342 0.01560136
Translation: Vector3 = { X: 0.1010085, Y: -0.002260342, Z: 0.01560136 }

tags.dat\0x0EE1.render_model> SetField markergroups[01].markers[0].Rotation -0.6241202 0.1670771 -0.45504 0.6127788
Rotation: Vector4 = -0.6241202, 0.1670771, -0.45504, 0.6127788

tags.dat\0x0EE1.render_model> SetField markergroups[01].markers[0].Scale 0
Scale: Single = 0

tags.dat\0x0EE1.render_model> savechanges
Done!

tags.dat\0x0EE1.render_model> exit

tags.dat> 

tags.dat> extract 0EE1 tempTag
Wrote 0xA00 bytes to tempTag.
The tag's main struct will be at offset 0x82C.

tags.dat> import 0F22 tempTag
Imported 0xA00 bytes.

tags.dat> import 0F32 tempTag
Imported 0xA00 bytes.

tags.dat> import 0F52 tempTag
Imported 0xA00 bytes.

tags.dat> import 0F61 tempTag
Imported 0xA00 bytes.

tags.dat> 

tags.dat> extract 1C7B tempTag
Wrote 0x980 bytes to tempTag.
The tag's main struct will be at offset 0x7A4.

tags.dat> import 2329 tempTag
Imported 0x980 bytes.

tags.dat> import 233A tempTag
Imported 0x980 bytes.

tags.dat> import 2347 tempTag
Imported 0x980 bytes.

tags.dat> import 2358 tempTag
Imported 0x980 bytes.

tags.dat> 

tags.dat> importbitmap 5B0C DDS/Display.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B0C [Offset = 0x6294C60, Size = 0x260]

tags.dat> importbitmap 5B0D DDS/assault_rifle.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B0D [Offset = 0x6294EC0, Size = 0x260]

tags.dat> importbitmap 5B0E DDS/assault_rifle_bump.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B0E [Offset = 0x6295120, Size = 0x260]

tags.dat> importbitmap 5B0F DDS/assault_rifle_illum.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B0F [Offset = 0x6295380, Size = 0x260]

tags.dat> 

tags.dat> import 5B12 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B13 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B14 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B15 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B16 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B17 tagTemplates/0EEA_rmshTemplate
Imported 0x4D0 bytes.

tags.dat> import 5B18 tagTemplates/0F11_rmshTemplate
Imported 0x3D0 bytes.

tags.dat> import 5B19 tagTemplates/0F79_rmshTemplate
Imported 0x4E0 bytes.

tags.dat> import 5B1A tagTemplates/0F7A_rmshTemplate
Imported 0x4E0 bytes.

tags.dat> import 5B1B tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B1C tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> 

tags.dat> edit 0EE1
Tag 0x00000EE1.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0EE1.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B12
Please enter the replacement 0000101F index: 5B1C
Please enter the replacement 0000101F index: 5B12
Please enter the replacement 0000101F index: 5B17
Please enter the replacement 0000101F index: 5B18
Please enter the replacement 0000101F index: 5B1A
Please enter the replacement 0000101F index: 5B19
Done!

tags.dat\0x0EE1.render_model> exit

tags.dat> edit 0F22
Tag 0x00000F22.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0F22.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B13
Please enter the replacement 0000101F index: 5B1C
Please enter the replacement 0000101F index: 5B13
Please enter the replacement 0000101F index: 5B17
Please enter the replacement 0000101F index: 5B18
Please enter the replacement 0000101F index: 5B1A
Please enter the replacement 0000101F index: 5B19
Done!

tags.dat\0x0F22.render_model> exit

tags.dat> edit 0F32
Tag 0x00000F32.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0F32.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B14
Please enter the replacement 0000101F index: 5B1C
Please enter the replacement 0000101F index: 5B14
Please enter the replacement 0000101F index: 5B17
Please enter the replacement 0000101F index: 5B18
Please enter the replacement 0000101F index: 5B1A
Please enter the replacement 0000101F index: 5B19
Done!

tags.dat\0x0F32.render_model> exit

tags.dat> edit 0F52
Tag 0x00000F52.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0F52.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B15
Please enter the replacement 0000101F index: 5B1C
Please enter the replacement 0000101F index: 5B15
Please enter the replacement 0000101F index: 5B17
Please enter the replacement 0000101F index: 5B18
Please enter the replacement 0000101F index: 5B1A
Please enter the replacement 0000101F index: 5B19
Done!

tags.dat\0x0F52.render_model> exit

tags.dat> edit 0F61
Tag 0x00000F61.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0F61.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B16
Please enter the replacement 0000101F index: 5B1C
Please enter the replacement 0000101F index: 5B16
Please enter the replacement 0000101F index: 5B17
Please enter the replacement 0000101F index: 5B18
Please enter the replacement 0000101F index: 5B1A
Please enter the replacement 0000101F index: 5B19
Done!

tags.dat\0x0F61.render_model> exit

tags.dat> edit 1C7B
Tag 0x00001C7B.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1C7B.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B1A
Please enter the replacement 0000101F index: 5B19
Please enter the replacement 0000101F index: 5B18
Please enter the replacement 0000101F index: 5B12
Please enter the replacement 0000101F index: 5B1C
Please enter the replacement 0000101F index: 5B12
Done!

tags.dat\0x1C7B.render_model> exit

tags.dat> edit 2329
Tag 0x00002329.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2329.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B1A
Please enter the replacement 0000101F index: 5B19
Please enter the replacement 0000101F index: 5B18
Please enter the replacement 0000101F index: 5B13
Please enter the replacement 0000101F index: 5B1C
Please enter the replacement 0000101F index: 5B13
Done!

tags.dat\0x2329.render_model> exit

tags.dat> edit 233A
Tag 0x0000233A.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x233A.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B1A
Please enter the replacement 0000101F index: 5B19
Please enter the replacement 0000101F index: 5B18
Please enter the replacement 0000101F index: 5B14
Please enter the replacement 0000101F index: 5B1C
Please enter the replacement 0000101F index: 5B14
Done!

tags.dat\0x233A.render_model> exit

tags.dat> edit 2347
Tag 0x00002347.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2347.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B1A
Please enter the replacement 0000101F index: 5B19
Please enter the replacement 0000101F index: 5B18
Please enter the replacement 0000101F index: 5B15
Please enter the replacement 0000101F index: 5B1C
Please enter the replacement 0000101F index: 5B15
Done!

tags.dat\0x2347.render_model> exit

tags.dat> edit 2358
Tag 0x00002358.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2358.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B1A
Please enter the replacement 0000101F index: 5B19
Please enter the replacement 0000101F index: 5B18
Please enter the replacement 0000101F index: 5B16
Please enter the replacement 0000101F index: 5B1C
Please enter the replacement 0000101F index: 5B16
Done!

tags.dat\0x2358.render_model> exit

tags.dat> 

tags.dat> edit 5B12
Tag 0x00005B12.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B12.shader> SpecifyBitmaps
Please enter the base_map index: 5B0D
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B0E
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B0F
Done!

tags.dat\0x5B12.shader> exit

tags.dat> edit 5B13
Tag 0x00005B13.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B13.shader> SpecifyBitmaps
Please enter the base_map index: 5B0D
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B0E
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B0F
Done!

tags.dat\0x5B13.shader> exit

tags.dat> edit 5B14
Tag 0x00005B14.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B14.shader> SpecifyBitmaps
Please enter the base_map index: 5B0D
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B0E
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B0F
Done!

tags.dat\0x5B14.shader> exit

tags.dat> edit 5B15
Tag 0x00005B15.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B15.shader> SpecifyBitmaps
Please enter the base_map index: 5B0D
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B0E
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B0F
Done!

tags.dat\0x5B15.shader> exit

tags.dat> edit 5B16
Tag 0x00005B16.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B16.shader> SpecifyBitmaps
Please enter the base_map index: 5B0D
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B0E
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B0F
Done!

tags.dat\0x5B16.shader> exit

tags.dat> edit 5B1B
Tag 0x00005B1B.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B1B.shader> SpecifyBitmaps
Please enter the base_map index: 5B0D
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B0E
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B0F
Done!

tags.dat\0x5B1B.shader> exit

tags.dat> edit 5B1C
Tag 0x00005B1C.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B1C.shader> SpecifyBitmaps
Please enter the base_map index: 5B0D
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B0E
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B0F
Done!

tags.dat\0x5B1C.shader> exit

tags.dat> edit 5B19
Tag 0x00005B19.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B19.shader> SpecifyBitmaps
Please enter the self_illum_map index: 5B10
Done!

tags.dat\0x5B19.shader> exit

tags.dat> edit 5B1A
Tag 0x00005B1A.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B1A.shader> SpecifyBitmaps
Please enter the self_illum_map index: 5B10
Done!

tags.dat\0x5B1A.shader> exit

tags.dat> edit 5B18
Tag 0x00005B18.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B18.shader> SpecifyBitmaps
Please enter the self_illum_map index: 5B0C
Done!

tags.dat\0x5B18.shader> exit

tags.dat> edit 5B17
Tag 0x00005B17.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B17.shader> SpecifyBitmaps
Please enter the self_illum_map index: 5B11
Done!

tags.dat\0x5B17.shader> exit

tags.dat> 

tags.dat> edit 5B12
Tag 0x00005B12.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B12.shader> edit ShaderProperties[0]

tags.dat\0x5B12.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B12.shader\ShaderProperties[0]> SetField arguments[16].arg1 0
Arg1: Single = 0

tags.dat\0x5B12.shader\ShaderProperties[0]> SetField arguments[29].arg1 5
Arg1: Single = 5

tags.dat\0x5B12.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B12.shader\ShaderProperties[0]> SetField arguments[28].arg2 1.0
Arg2: Single = 1

tags.dat\0x5B12.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B12.shader\ShaderProperties[0]> SetField arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B12.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B12.shader\ShaderProperties[0]> exit

tags.dat\0x5B12.shader> exit

tags.dat> edit 5B13
Tag 0x00005B13.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B13.shader> edit ShaderProperties[0]

tags.dat\0x5B13.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B13.shader\ShaderProperties[0]> SetField arguments[16].arg1 0
Arg1: Single = 0

tags.dat\0x5B13.shader\ShaderProperties[0]> SetField arguments[29].arg1 5
Arg1: Single = 5

tags.dat\0x5B13.shader\ShaderProperties[0]> SetField arguments[28].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B13.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x5B13.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B13.shader\ShaderProperties[0]> SetField arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B13.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B13.shader\ShaderProperties[0]> exit

tags.dat\0x5B13.shader> exit

tags.dat> edit 5B14
Tag 0x00005B14.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B14.shader> edit ShaderProperties[0]

tags.dat\0x5B14.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B14.shader\ShaderProperties[0]> SetField arguments[16].arg1 0
Arg1: Single = 0

tags.dat\0x5B14.shader\ShaderProperties[0]> SetField arguments[29].arg1 5
Arg1: Single = 5

tags.dat\0x5B14.shader\ShaderProperties[0]> SetField arguments[28].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B14.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.7
Arg2: Single = 0.7

tags.dat\0x5B14.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B14.shader\ShaderProperties[0]> SetField arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B14.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B14.shader\ShaderProperties[0]> exit

tags.dat\0x5B14.shader> exit

tags.dat> edit 5B15
Tag 0x00005B15.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B15.shader> edit ShaderProperties[0]

tags.dat\0x5B15.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B15.shader\ShaderProperties[0]> SetField arguments[16].arg1 0
Arg1: Single = 0

tags.dat\0x5B15.shader\ShaderProperties[0]> SetField arguments[29].arg1 5
Arg1: Single = 5

tags.dat\0x5B15.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B15.shader\ShaderProperties[0]> SetField arguments[28].arg2 1.0
Arg2: Single = 1

tags.dat\0x5B15.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B15.shader\ShaderProperties[0]> SetField arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B15.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B15.shader\ShaderProperties[0]> exit

tags.dat\0x5B15.shader> exit

tags.dat> edit 5B16
Tag 0x00005B16.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B16.shader> edit ShaderProperties[0]

tags.dat\0x5B16.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B16.shader\ShaderProperties[0]> SetField arguments[16].arg1 0
Arg1: Single = 0

tags.dat\0x5B16.shader\ShaderProperties[0]> SetField arguments[29].arg1 5
Arg1: Single = 5

tags.dat\0x5B16.shader\ShaderProperties[0]> SetField arguments[28].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B16.shader\ShaderProperties[0]> SetField arguments[28].arg2 1.0
Arg2: Single = 1

tags.dat\0x5B16.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B16.shader\ShaderProperties[0]> SetField arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B16.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B16.shader\ShaderProperties[0]> exit

tags.dat\0x5B16.shader> exit

tags.dat> edit 5B1B
Tag 0x00005B1B.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B1B.shader> edit ShaderProperties[0]

tags.dat\0x5B1B.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B1B.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B1B.shader\ShaderProperties[0]> SetField arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5B1B.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B1B.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x5B1B.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B1B.shader\ShaderProperties[0]> SetField arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B1B.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B1B.shader\ShaderProperties[0]> exit

tags.dat\0x5B1B.shader> exit

tags.dat> edit 5B1C
Tag 0x00005B1C.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B1C.shader> edit ShaderProperties[0]

tags.dat\0x5B1C.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B1C.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B1C.shader\ShaderProperties[0]> SetField arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5B1C.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B1C.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x5B1C.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B1C.shader\ShaderProperties[0]> SetField arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B1C.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B1C.shader\ShaderProperties[0]> exit

tags.dat\0x5B1C.shader> exit

tags.dat> edit 5B17
Tag 0x00005B17.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B17.shader> edit ShaderProperties[0]

tags.dat\0x5B17.shader\ShaderProperties[0]> SetField arguments[01].arg4 1.0
Arg4: Single = 1

tags.dat\0x5B17.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B17.shader\ShaderProperties[0]> exit

tags.dat\0x5B17.shader> exit

tags.dat> edit 5B18
Tag 0x00005B18.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B18.shader> edit ShaderProperties[0]

tags.dat\0x5B18.shader\ShaderProperties[0]> SetField arguments[02].Arg1 0.0
Arg1: Single = 0

tags.dat\0x5B18.shader\ShaderProperties[0]> SetField arguments[02].Arg2 0.5
Arg2: Single = 0.5

tags.dat\0x5B18.shader\ShaderProperties[0]> SetField arguments[02].Arg3 0.5
Arg3: Single = 0.5

tags.dat\0x5B18.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B18.shader\ShaderProperties[0]> exit

tags.dat\0x5B18.shader> exit

tags.dat> 

tags.dat> echo edit 0F09
edit 0F09 
tags.dat> echo import 0 DDS/LCD/0.dds
import 0 DDS/LCD/0.dds 
tags.dat> echo import 1 DDS/LCD/1.dds
import 1 DDS/LCD/1.dds 
tags.dat> echo import 2 DDS/LCD/2.dds
import 2 DDS/LCD/2.dds 
tags.dat> echo import 3 DDS/LCD/3.dds
import 3 DDS/LCD/3.dds 
tags.dat> echo import 4 DDS/LCD/4.dds
import 4 DDS/LCD/4.dds 
tags.dat> echo import 5 DDS/LCD/5.dds
import 5 DDS/LCD/5.dds 
tags.dat> echo import 6 DDS/LCD/6.dds
import 6 DDS/LCD/6.dds 
tags.dat> echo import 7 DDS/LCD/7.dds
import 7 DDS/LCD/7.dds 
tags.dat> echo import 8 DDS/LCD/8.dds
import 8 DDS/LCD/8.dds 
tags.dat> echo import 9 DDS/LCD/9.dds
import 9 DDS/LCD/9.dds 
tags.dat> echo exit
exit 
tags.dat> echo edit 0F40
edit 0F40 
tags.dat> echo import 0 DDS/compass/compass0.dds
import 0 DDS/compass/compass0.dds 
tags.dat> echo import 1 DDS/compass/compass1.dds
import 1 DDS/compass/compass1.dds 
tags.dat> echo import 2 DDS/compass/compass2.dds
import 2 DDS/compass/compass2.dds 
tags.dat> echo import 3 DDS/compass/compass3.dds
import 3 DDS/compass/compass3.dds 
tags.dat> echo import 4 DDS/compass/compass4.dds
import 4 DDS/compass/compass4.dds 
tags.dat> echo import 5 DDS/compass/compass5.dds
import 5 DDS/compass/compass5.dds 
tags.dat> echo import 6 DDS/compass/compass6.dds
import 6 DDS/compass/compass6.dds 
tags.dat> echo import 7 DDS/compass/compass7.dds
import 7 DDS/compass/compass7.dds 
tags.dat> echo exit
exit 
tags.dat> echo extract 0F09 tags\bitm_H3Ones.tag
extract 0F09 tags\bitm_H3Ones.tag 
tags.dat> echo extract 0F40 tags\bitm_H3Compass.tag
extract 0F40 tags\bitm_H3Compass.tag 
tags.dat> echo extractresource textures.dat 0F09 tags\ones\bitm_ARones_0.bitm 0
extractresource textures.dat 0F09 tags\ones\bitm_ARones_0.bitm 0 
tags.dat> echo extractresource textures.dat 0F09 tags\ones\bitm_ARones_1.bitm 1
extractresource textures.dat 0F09 tags\ones\bitm_ARones_1.bitm 1 
tags.dat> echo extractresource textures.dat 0F09 tags\ones\bitm_ARones_2.bitm 2
extractresource textures.dat 0F09 tags\ones\bitm_ARones_2.bitm 2 
tags.dat> echo extractresource textures.dat 0F09 tags\ones\bitm_ARones_3.bitm 3
extractresource textures.dat 0F09 tags\ones\bitm_ARones_3.bitm 3 
tags.dat> echo extractresource textures.dat 0F09 tags\ones\bitm_ARones_4.bitm 4
extractresource textures.dat 0F09 tags\ones\bitm_ARones_4.bitm 4 
tags.dat> echo extractresource textures.dat 0F09 tags\ones\bitm_ARones_5.bitm 5
extractresource textures.dat 0F09 tags\ones\bitm_ARones_5.bitm 5 
tags.dat> echo extractresource textures.dat 0F09 tags\ones\bitm_ARones_6.bitm 6
extractresource textures.dat 0F09 tags\ones\bitm_ARones_6.bitm 6 
tags.dat> echo extractresource textures.dat 0F09 tags\ones\bitm_ARones_7.bitm 7
extractresource textures.dat 0F09 tags\ones\bitm_ARones_7.bitm 7 
tags.dat> echo extractresource textures.dat 0F09 tags\ones\bitm_ARones_8.bitm 8
extractresource textures.dat 0F09 tags\ones\bitm_ARones_8.bitm 8 
tags.dat> echo extractresource textures.dat 0F09 tags\ones\bitm_ARones_9.bitm 9
extractresource textures.dat 0F09 tags\ones\bitm_ARones_9.bitm 9 
tags.dat> echo extractresource textures.dat 0F40 tags\compass\bitm_AROnes_0.bitm 0
extractresource textures.dat 0F40 tags\compass\bitm_AROnes_0.bitm 0 
tags.dat> echo extractresource textures.dat 0F40 tags\compass\bitm_AROnes_1.bitm 1
extractresource textures.dat 0F40 tags\compass\bitm_AROnes_1.bitm 1 
tags.dat> echo extractresource textures.dat 0F40 tags\compass\bitm_AROnes_2.bitm 2
extractresource textures.dat 0F40 tags\compass\bitm_AROnes_2.bitm 2 
tags.dat> echo extractresource textures.dat 0F40 tags\compass\bitm_AROnes_3.bitm 3
extractresource textures.dat 0F40 tags\compass\bitm_AROnes_3.bitm 3 
tags.dat> echo extractresource textures.dat 0F40 tags\compass\bitm_AROnes_4.bitm 4
extractresource textures.dat 0F40 tags\compass\bitm_AROnes_4.bitm 4 
tags.dat> echo extractresource textures.dat 0F40 tags\compass\bitm_AROnes_5.bitm 5
extractresource textures.dat 0F40 tags\compass\bitm_AROnes_5.bitm 5 
tags.dat> echo extractresource textures.dat 0F40 tags\compass\bitm_AROnes_6.bitm 6
extractresource textures.dat 0F40 tags\compass\bitm_AROnes_6.bitm 6 
tags.dat> echo extractresource textures.dat 0F40 tags\compass\bitm_AROnes_7.bitm 7
extractresource textures.dat 0F40 tags\compass\bitm_AROnes_7.bitm 7 
tags.dat> 

tags.dat> import 5B10 tags/bitm_H3Ones.tag
Imported 0xC60 bytes.

tags.dat> import 5B11 tags/bitm_H3Compass.tag
Imported 0xA20 bytes.

tags.dat> 

tags.dat> importresource textures.dat 5B10 tags/ones
0x00005B10: Imported 0x276.

tags.dat> importresource textures.dat 5B11 tags/compass
0x00005B11: Imported 0x1675.

tags.dat> 

tags.dat> dumplog H3AR.log
