Tag Tool [1.0.6043.10715]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...23309 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 2:40 PM.
Reading stringIDs...39505 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmARdisp
Unrecognized command: bitmARdisp
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmARbase
Unrecognized command: bitmARbase
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmARbump
Unrecognized command: bitmARbump
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmARillu
Unrecognized command: bitmARillu
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmARones
Unrecognized command: bitmARones
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmARcomp
Unrecognized command: bitmARcomp
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadAR0def
Unrecognized command: shadAR0def
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadAR2red
Unrecognized command: shadAR2red
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadAR3ora
Unrecognized command: shadAR3ora
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadAR5gre
Unrecognized command: shadAR5gre
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadAR6yel
Unrecognized command: shadAR6yel
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadARcomp
Unrecognized command: shadARcomp
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadARdisp
Unrecognized command: shadARdisp
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadARones
Unrecognized command: shadARones
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadARtens
Unrecognized command: shadARtens
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadARenvi
Unrecognized command: shadARenvi
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadARrubb
Unrecognized command: shadARrubb
Use "help" to list available commands.

tags.dat> 0EE1
Unrecognized command: 0EE1
Use "help" to list available commands.

tags.dat> modeAR0fp
Unrecognized command: modeAR0fp
Use "help" to list available commands.

tags.dat> 0F22
Unrecognized command: 0F22
Use "help" to list available commands.

tags.dat> modeAR2fp
Unrecognized command: modeAR2fp
Use "help" to list available commands.

tags.dat> 0F32
Unrecognized command: 0F32
Use "help" to list available commands.

tags.dat> modeAR3fp
Unrecognized command: modeAR3fp
Use "help" to list available commands.

tags.dat> 0F52
Unrecognized command: 0F52
Use "help" to list available commands.

tags.dat> modeAR5fp
Unrecognized command: modeAR5fp
Use "help" to list available commands.

tags.dat> 0F61
Unrecognized command: 0F61
Use "help" to list available commands.

tags.dat> modeAR6fp
Unrecognized command: modeAR6fp
Use "help" to list available commands.

tags.dat> 1C7B
Unrecognized command: 1C7B
Use "help" to list available commands.

tags.dat> modeAR03d
Unrecognized command: modeAR03d
Use "help" to list available commands.

tags.dat> 2329
Unrecognized command: 2329
Use "help" to list available commands.

tags.dat> modeAR23d
Unrecognized command: modeAR23d
Use "help" to list available commands.

tags.dat> 233A
Unrecognized command: 233A
Use "help" to list available commands.

tags.dat> modeAR33d
Unrecognized command: modeAR33d
Use "help" to list available commands.

tags.dat> 2347
Unrecognized command: 2347
Use "help" to list available commands.

tags.dat> modeAR53d
Unrecognized command: modeAR53d
Use "help" to list available commands.

tags.dat> 2358
Unrecognized command: 2358
Use "help" to list available commands.

tags.dat> modeAR63d
Unrecognized command: modeAR63d
Use "help" to list available commands.

tags.dat> ====
Unrecognized command: ====
Use "help" to list available commands.

tags.dat> ====
Unrecognized command: ====
Use "help" to list available commands.

tags.dat> 0F09
Unrecognized command: 0F09
Use "help" to list available commands.

tags.dat> bitmDefaultOnes
Unrecognized command: bitmDefaultOnes
Use "help" to list available commands.

tags.dat> 0F40
Unrecognized command: 0F40
Use "help" to list available commands.

tags.dat> bitmDefaultComp
Unrecognized command: bitmDefaultComp
Use "help" to list available commands.

tags.dat> ====
Unrecognized command: ====
Use "help" to list available commands.

tags.dat> ====
Unrecognized command: ====
Use "help" to list available commands.

tags.dat> // Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Unrecognized command: //
Use "help" to list available commands.

tags.dat> ====
Unrecognized command: ====
Use "help" to list available commands.

tags.dat> echo

tags.dat> //
Unrecognized command: //
Use "help" to list available commands.

tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> 

tags.dat> SetLocale US

tags.dat> 

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B0D [Offset = 0x6298D38, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B0E [Offset = 0x6298DB4, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B0F [Offset = 0x6298E30, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B10 [Offset = 0x6298EAC, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B11 [Offset = 0x6298F28, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B12 [Offset = 0x6298FA4, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B13 [Offset = 0x6299020, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B14 [Offset = 0x629909C, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B15 [Offset = 0x6299118, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B16 [Offset = 0x6299194, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B17 [Offset = 0x6299210, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B18 [Offset = 0x629928C, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B19 [Offset = 0x6299308, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B1A [Offset = 0x6299384, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B1B [Offset = 0x6299400, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B1C [Offset = 0x629947C, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B1D [Offset = 0x62994F8, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B1E [Offset = 0x6299574, Size = 0x7C]

tags.dat> 

tags.dat> import modeAR0fp tags/H3ARfp.tag
import: Import a tag from a file

Usage:
import <tag index> <filename>

Use "help import" for more information.

tags.dat> import modeAR03d tags/H3AR3d.tag
import: Import a tag from a file

Usage:
import <tag index> <filename>

Use "help import" for more information.

tags.dat> importresource resources.dat modeAR0fp tags/H3ARfp.raw
ERROR: Object reference not set to an instance of an object.

tags.dat> importresource resources.dat modeAR03d tags/H3AR3d.raw
ERROR: Object reference not set to an instance of an object.
