Tag Tool [1.0.6040.37850]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...23385 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 2:40 PM.
Reading stringIDs...39505 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B58
Unrecognized command: 5B58
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B59
Unrecognized command: 5B59
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B5A
Unrecognized command: 5B5A
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B5B
Unrecognized command: 5B5B
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B5C
Unrecognized command: 5B5C
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B5D
Unrecognized command: 5B5D
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B5E
Unrecognized command: 5B5E
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B5F
Unrecognized command: 5B5F
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B60
Unrecognized command: 5B60
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B61
Unrecognized command: 5B61
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B62
Unrecognized command: 5B62
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B63
Unrecognized command: 5B63
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B64
Unrecognized command: 5B64
Use "help" to list available commands.

tags.dat> 1F8D
Unrecognized command: 1F8D
Use "help" to list available commands.

tags.dat> 1F8D
Unrecognized command: 1F8D
Use "help" to list available commands.

tags.dat> 203C
Unrecognized command: 203C
Use "help" to list available commands.

tags.dat> 203C
Unrecognized command: 203C
Use "help" to list available commands.

tags.dat> echo Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1) 
tags.dat> echo Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1) 
tags.dat> echo

tags.dat> echo

tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> 

tags.dat> SetLocale US

tags.dat> 

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B59 [Offset = 0x62AD530, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B5A [Offset = 0x62AD5B0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B5B [Offset = 0x62AD630, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B5C [Offset = 0x62AD6B0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B5D [Offset = 0x62AD730, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B5E [Offset = 0x62AD7B0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B5F [Offset = 0x62AD830, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B60 [Offset = 0x62AD8B0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B61 [Offset = 0x62AD930, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B62 [Offset = 0x62AD9B0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B63 [Offset = 0x62ADA30, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B64 [Offset = 0x62ADAB0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B65 [Offset = 0x62ADB30, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B66 [Offset = 0x62ADBB0, Size = 0x80]

tags.dat> 

tags.dat> import 1F8D tags/H3Snifp.tag
Imported 0xA30 bytes.

tags.dat> import 203C tags/H3Sni3d.tag
Imported 0x930 bytes.

tags.dat> 

tags.dat> importmodelraw 1F8D tags/H3Snifp.raw
Writing tag data...
Model imported successfully!

tags.dat> importmodelraw 203C tags/H3Sni3d.raw
Writing tag data...
Model imported successfully!

tags.dat> 

tags.dat> edit 1F8D
Tag 0x00001F8D.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1F8D.render_model> edit geometry.compression[0]

tags.dat\0x1F8D.render_model\geometry\compression[0]> SetField TextureMinV 0
TextureMinV: Single = 0

tags.dat\0x1F8D.render_model\geometry\compression[0]> SetField TextureMaxV -0.9995005
TextureMaxV: Single = -0.9995005

tags.dat\0x1F8D.render_model\geometry\compression[0]> savechanges
Done!

tags.dat\0x1F8D.render_model\geometry\compression[0]> exitTo tags.dat

tags.dat> edit 203C
Tag 0x0000203C.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x203C.render_model> edit geometry.compression[0]

tags.dat\0x203C.render_model\geometry\compression[0]> SetField TextureMinV 0
TextureMinV: Single = 0

tags.dat\0x203C.render_model\geometry\compression[0]> SetField TextureMaxV -0.9995005
TextureMaxV: Single = -0.9995005

tags.dat\0x203C.render_model\geometry\compression[0]> savechanges
Done!

tags.dat\0x203C.render_model\geometry\compression[0]> exitTo tags.dat

tags.dat> 

tags.dat> 

tags.dat> importbitmap 5B58 DDS/sniper_rifle_scope_screen_luminous2.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B58 [Offset = 0x62AD000, Size = 0x260]

tags.dat> importbitmap 5B59 DDS/sniper_rifle_scope_screen.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B59 [Offset = 0x62AD260, Size = 0x260]

tags.dat> importbitmap 5B5A DDS/sniper_rifle_scope_screen2.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B5A [Offset = 0x62AD4C0, Size = 0x260]

tags.dat> importbitmap 5B5B DDS/sniper_rifle.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B5B [Offset = 0x62AD720, Size = 0x260]

tags.dat> importbitmap 5B5C DDS/sniper_rifle_bump.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B5C [Offset = 0x62AD980, Size = 0x260]

tags.dat> importbitmap 5B5D DDS/sniper_rifle_illum.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B5D [Offset = 0x62ADBE0, Size = 0x260]

tags.dat> 

tags.dat> import 5B60 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B61 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B62 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B64 tagTemplates/1CA4_rmshTemplate
Imported 0x1D0 bytes.

tags.dat> import 5B63 tagTemplates/0F16_rmshTemplate
Imported 0x500 bytes.

tags.dat> import 5B5E tagTemplates/1F97_rmhgTemplate
Imported 0x7B0 bytes.

tags.dat> import 5B5F tagTemplates/1CA4_rmshTemplate
Imported 0x1D0 bytes.

tags.dat> 

tags.dat> edit 1F8D
Tag 0x00001F8D.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1F8D.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B60
Please enter the replacement 0000101F index: 5B61
Please enter the replacement 0000101F index: 5B62
Please enter the replacement 0000101F index: 5B64
Please enter the replacement 0000101F index: 5B63
Please enter the replacement 0000101F index: 5B5E
Please enter the replacement 0000101F index: 5B5F
Done!

tags.dat\0x1F8D.render_model> exit

tags.dat> edit 203C
Tag 0x0000203C.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x203C.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B60
Please enter the replacement 0000101F index: 5B61
Please enter the replacement 0000101F index: 5B62
Please enter the replacement 0000101F index: 5B63
Please enter the replacement 0000101F index: 5B64
Done!

tags.dat\0x203C.render_model> exit

tags.dat> 

tags.dat> edit 5B60
Tag 0x00005B60.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B60.shader> SpecifyBitmaps
Please enter the base_map index: 5B5B
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B5C
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B5D
Done!

tags.dat\0x5B60.shader> exit

tags.dat> edit 5B61
Tag 0x00005B61.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B61.shader> SpecifyBitmaps
Please enter the base_map index: 5B5B
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B5C
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B5D
Done!

tags.dat\0x5B61.shader> exit

tags.dat> edit 5B62
Tag 0x00005B62.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B62.shader> SpecifyBitmaps
Please enter the base_map index: 5B5B
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B5C
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B5D
Done!

tags.dat\0x5B62.shader> exit

tags.dat> edit 5B64
Tag 0x00005B64.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B64.shader> SpecifyBitmaps
Please enter the base_map index: 5B5A
Please enter the detail_map index: 0343
Done!

tags.dat\0x5B64.shader> exit

tags.dat> edit 5B63
Tag 0x00005B63.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B63.shader> SpecifyBitmaps
Please enter the self_illum_map index: 1FA6
Done!

tags.dat\0x5B63.shader> exit

tags.dat> edit 5B5E
Tag 0x00005B5E.shader_halogram has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B5E.shader_halogram> SpecifyBitmaps
Please enter the base_map index: 0343
Please enter the detail_map index: 0343
Please enter the self_illum_map index: 0EF7
Please enter the overlay_map index: 0379
Please enter the overlay_detail_map index: 0343
Done!

tags.dat\0x5B5E.shader_halogram> exit

tags.dat> edit 5B5F
Tag 0x00005B5F.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B5F.shader> SpecifyBitmaps
Please enter the base_map index: 5B59
Please enter the detail_map index: 0343
Done!

tags.dat\0x5B5F.shader> exit

tags.dat> 

tags.dat> edit 5B60
Tag 0x00005B60.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B60.shader> edit ShaderProperties[0]

tags.dat\0x5B60.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B60.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B60.shader\ShaderProperties[0]> SetField arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5B60.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B60.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x5B60.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B60.shader\ShaderProperties[0]> SetField arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B60.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B60.shader\ShaderProperties[0]> exit

tags.dat\0x5B60.shader> exit

tags.dat> edit 5B61
Tag 0x00005B61.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B61.shader> edit ShaderProperties[0]

tags.dat\0x5B61.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B61.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B61.shader\ShaderProperties[0]> SetField arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5B61.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B61.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x5B61.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B61.shader\ShaderProperties[0]> SetField arguments[06].arg1 0.5
Arg1: Single = 0.5

tags.dat\0x5B61.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B61.shader\ShaderProperties[0]> exit

tags.dat\0x5B61.shader> exit

tags.dat> edit 5B62
Tag 0x00005B62.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B62.shader> edit ShaderProperties[0]

tags.dat\0x5B62.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B62.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B62.shader\ShaderProperties[0]> SetField arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5B62.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B62.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x5B62.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B62.shader\ShaderProperties[0]> SetField arguments[06].arg1 0.5
Arg1: Single = 0.5

tags.dat\0x5B62.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B62.shader\ShaderProperties[0]> exit

tags.dat\0x5B62.shader> exit

tags.dat> edit 5B64
Tag 0x00005B64.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B64.shader> edit ShaderProperties[0]

tags.dat\0x5B64.shader\ShaderProperties[0]> SetField arguments[02].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B64.shader\ShaderProperties[0]> SetField arguments[02].arg2 1.0
Arg2: Single = 1

tags.dat\0x5B64.shader\ShaderProperties[0]> SetField arguments[02].arg3 0
Arg3: Single = 0

tags.dat\0x5B64.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B64.shader\ShaderProperties[0]> exit

tags.dat\0x5B64.shader> exit

tags.dat> edit 5B63
Tag 0x00005B63.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B63.shader> edit ShaderProperties[0]

tags.dat\0x5B63.shader\ShaderProperties[0]> SetField arguments[02].Arg1 0.00
Arg1: Single = 0

tags.dat\0x5B63.shader\ShaderProperties[0]> SetField arguments[02].Arg2 1.0
Arg2: Single = 1

tags.dat\0x5B63.shader\ShaderProperties[0]> SetField arguments[02].Arg3 0.0
Arg3: Single = 0

tags.dat\0x5B63.shader\ShaderProperties[0]> SetField arguments[01].Arg1 0.0
Arg1: Single = 0

tags.dat\0x5B63.shader\ShaderProperties[0]> SetField arguments[01].Arg2 15
Arg2: Single = 15

tags.dat\0x5B63.shader\ShaderProperties[0]> SetField arguments[01].Arg3 0
Arg3: Single = 0

tags.dat\0x5B63.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B63.shader\ShaderProperties[0]> exit

tags.dat\0x5B63.shader> exit

tags.dat> edit 5B5E
Tag 0x00005B5E.shader_halogram has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B5E.shader_halogram> edit ShaderProperties[0]

tags.dat\0x5B5E.shader_halogram\ShaderProperties[0]> SetField arguments[04].Arg1 0.00
Arg1: Single = 0

tags.dat\0x5B5E.shader_halogram\ShaderProperties[0]> SetField arguments[04].Arg2 1.0
Arg2: Single = 1

tags.dat\0x5B5E.shader_halogram\ShaderProperties[0]> SetField arguments[04].Arg3 0.0
Arg3: Single = 0

tags.dat\0x5B5E.shader_halogram\ShaderProperties[0]> SetField arguments[03].Arg1 0.9
Arg1: Single = 0.9

tags.dat\0x5B5E.shader_halogram\ShaderProperties[0]> SetField arguments[03].Arg2 0.8
Arg2: Single = 0.8

tags.dat\0x5B5E.shader_halogram\ShaderProperties[0]> SetField arguments[03].Arg3 0.1
Arg3: Single = 0.1

tags.dat\0x5B5E.shader_halogram\ShaderProperties[0]> SetField arguments[03].Arg4 -0.1
Arg4: Single = -0.1

tags.dat\0x5B5E.shader_halogram\ShaderProperties[0]> SetField arguments[9].Arg2 0.01
Arg2: Single = 0.01

tags.dat\0x5B5E.shader_halogram\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B5E.shader_halogram\ShaderProperties[0]> exit

tags.dat\0x5B5E.shader_halogram> exit

tags.dat> edit 5B5F
Tag 0x00005B5F.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B5F.shader> edit ShaderProperties[0]

tags.dat\0x5B5F.shader\ShaderProperties[0]> SetField arguments[02].arg1 0
Arg1: Single = 0

tags.dat\0x5B5F.shader\ShaderProperties[0]> SetField arguments[02].arg2 1
Arg2: Single = 1

tags.dat\0x5B5F.shader\ShaderProperties[0]> SetField arguments[02].arg3 0
Arg3: Single = 0

tags.dat\0x5B5F.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B5F.shader\ShaderProperties[0]> exit

tags.dat\0x5B5F.shader> exit

tags.dat> 

tags.dat> echo Patch for Flatgrass
Patch for Flatgrass 
tags.dat> dep remove 6E23 6E09
Unable to find tag 00006E23.
dep: Manage tag loading

Usage:
dep add <tag index> <dependency index...>
dep remove <tag index> <dependency index...>
dep list <tag index>
dep listall <tag index>
dep liston <tag index>

Use "help dep" for more information.

tags.dat> dep remove 6E23 6E08 
Unable to find tag 00006E23.
dep: Manage tag loading

Usage:
dep add <tag index> <dependency index...>
dep remove <tag index> <dependency index...>
dep list <tag index>
dep listall <tag index>
dep liston <tag index>

Use "help dep" for more information.

tags.dat> 

tags.dat> edit 6E07
Unable to find tag 00006E07.
edit: Edit tag-specific data

Usage:
edit <tag index>

Use "help edit" for more information.

tags.dat> SetField rendermodel 203C
Unrecognized command: SetField
Use "help" to list available commands.

tags.dat> savechanges
Unrecognized command: savechanges
Use "help" to list available commands.

tags.dat> exitTo tags.dat
Unrecognized command: exitTo
Use "help" to list available commands.

tags.dat> 

tags.dat> edit 6E06
Unable to find tag 00006E06.
edit: Edit tag-specific data

Usage:
edit <tag index>

Use "help edit" for more information.

tags.dat> SetField FirstPerson[0].FirstPersonModel 1F8D
Unrecognized command: SetField
Use "help" to list available commands.

tags.dat> SetField FirstPerson[1].FirstPersonModel 1F8D
Unrecognized command: SetField
Use "help" to list available commands.

tags.dat> savechanges
Unrecognized command: savechanges
Use "help" to list available commands.

tags.dat> exitTo tags.dat
Unrecognized command: exitTo
Use "help" to list available commands.

tags.dat> 

tags.dat> dumplog H3Sniper.log
