Tag Tool [1.0.6040.37850]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...23357 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 2:40 PM.
Reading stringIDs...39505 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B3C
Unrecognized command: 5B3C
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B3D
Unrecognized command: 5B3D
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B3E
Unrecognized command: 5B3E
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B3F
Unrecognized command: 5B3F
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B40
Unrecognized command: 5B40
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B41
Unrecognized command: 5B41
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B42
Unrecognized command: 5B42
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B43
Unrecognized command: 5B43
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B44
Unrecognized command: 5B44
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B45
Unrecognized command: 5B45
Use "help" to list available commands.

tags.dat> 115F
Unrecognized command: 115F
Use "help" to list available commands.

tags.dat> 115F
Unrecognized command: 115F
Use "help" to list available commands.

tags.dat> 1177
Unrecognized command: 1177
Use "help" to list available commands.

tags.dat> 1177
Unrecognized command: 1177
Use "help" to list available commands.

tags.dat> 117B
Unrecognized command: 117B
Use "help" to list available commands.

tags.dat> 117B
Unrecognized command: 117B
Use "help" to list available commands.

tags.dat> 20D9
Unrecognized command: 20D9
Use "help" to list available commands.

tags.dat> 20D9
Unrecognized command: 20D9
Use "help" to list available commands.

tags.dat> 2417
Unrecognized command: 2417
Use "help" to list available commands.

tags.dat> 2417
Unrecognized command: 2417
Use "help" to list available commands.

tags.dat> 241E
Unrecognized command: 241E
Use "help" to list available commands.

tags.dat> 241E
Unrecognized command: 241E
Use "help" to list available commands.

tags.dat> echo Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1) 
tags.dat> echo Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1) 
tags.dat> echo

tags.dat> echo

tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> 

tags.dat> SetLocale US

tags.dat> 

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B3D [Offset = 0x62A4670, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B3E [Offset = 0x62A46F0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B3F [Offset = 0x62A4770, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B40 [Offset = 0x62A47F0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B41 [Offset = 0x62A4870, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B42 [Offset = 0x62A48F0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B43 [Offset = 0x62A4970, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B44 [Offset = 0x62A49F0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B45 [Offset = 0x62A4A70, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B46 [Offset = 0x62A4AF0, Size = 0x80]

tags.dat> 

tags.dat> import 115F tags/H3Magfp.tag
Imported 0x870 bytes.

tags.dat> import 20D9 tags/H3Mag3d.tag
Imported 0x920 bytes.

tags.dat> importmodelraw 115F tags/H3Magfp.raw
Writing tag data...
Model imported successfully!

tags.dat> importmodelraw 20D9 tags/H3Mag3d.raw
Writing tag data...
Model imported successfully!

tags.dat> 

tags.dat> importbitmap 5B3C DDS/magnum.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B3C [Offset = 0x62A4640, Size = 0x260]

tags.dat> importbitmap 5B3D DDS/magnum_bump.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B3D [Offset = 0x62A48A0, Size = 0x260]

tags.dat> importbitmap 5B3E DDS/magnum_illum.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B3E [Offset = 0x62A4B00, Size = 0x260]

tags.dat> import 5B3F tagTemplates/1178_rmshTemplate 
Imported 0x320 bytes.

tags.dat> import 5B40 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B41 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B42 tagTemplates/1178_rmshTemplate 
Imported 0x320 bytes.

tags.dat> import 5B43 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B44 tagTemplates/1178_rmshTemplate 
Imported 0x320 bytes.

tags.dat> import 5B45 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> edit 115F
Tag 0x0000115F.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x115F.render_model> edit markerGroups[01]

tags.dat\0x115F.render_model\markerGroups[1]> edit markers[0]

tags.dat\0x115F.render_model\markerGroups[1]\markers[0]> SetField RegionIndex -1
RegionIndex: SByte = -1

tags.dat\0x115F.render_model\markerGroups[1]\markers[0]> SetField PermutationIndex -1
PermutationIndex: SByte = -1

tags.dat\0x115F.render_model\markerGroups[1]\markers[0]> SetField Translation 0.003737968 -0.002770302 -0.03149237
Translation: Vector3 = { X: 0.003737968, Y: -0.002770302, Z: -0.03149237 }

tags.dat\0x115F.render_model\markerGroups[1]\markers[0]> SetField Rotation -0.4730325 -0.0267203 -0.3264062 0.81791520
Rotation: Vector4 = -0.4730325, -0.0267203, -0.3264062, 0.8179152

tags.dat\0x115F.render_model\markerGroups[1]\markers[0]> SetField Scale 0
Scale: Single = 0

tags.dat\0x115F.render_model\markerGroups[1]\markers[0]> savechanges
Done!

tags.dat\0x115F.render_model\markerGroups[1]\markers[0]> exitTo tags.dat

tags.dat> edit 115F
Tag 0x0000115F.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x115F.render_model> edit geometry.compression[0]

tags.dat\0x115F.render_model\geometry\compression[0]> SetField TextureMinV 0
TextureMinV: Single = 0

tags.dat\0x115F.render_model\geometry\compression[0]> SetField TextureMaxV -1.004819
TextureMaxV: Single = -1.004819

tags.dat\0x115F.render_model\geometry\compression[0]> savechanges
Done!

tags.dat\0x115F.render_model\geometry\compression[0]> exitTo tags.dat

tags.dat> edit 20D9
Tag 0x000020D9.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x20D9.render_model> edit geometry.compression[0]

tags.dat\0x20D9.render_model\geometry\compression[0]> SetField TextureMinV 0
TextureMinV: Single = 0

tags.dat\0x20D9.render_model\geometry\compression[0]> SetField TextureMaxV -0.9996192
TextureMaxV: Single = -0.9996192

tags.dat\0x20D9.render_model\geometry\compression[0]> savechanges
Done!

tags.dat\0x20D9.render_model\geometry\compression[0]> exitTo tags.dat

tags.dat> extract 115F tempTag
Wrote 0x870 bytes to tempTag.
The tag's main struct will be at offset 0x694.

tags.dat> import 1177 tempTag
Imported 0x870 bytes.

tags.dat> import 117B tempTag
Imported 0x870 bytes.

tags.dat> extract 20D9 tempTag
Wrote 0x920 bytes to tempTag.
The tag's main struct will be at offset 0x748.

tags.dat> import 2417 tempTag
Imported 0x920 bytes.

tags.dat> import 241E tempTag
Imported 0x920 bytes.

tags.dat> edit 115F
Tag 0x0000115F.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x115F.render_model> SpecifyShaders
Please enter the replacement 00001160 index: 5B40
Please enter the replacement 00001179 index: 5B3F
Please enter the replacement 0000116B index: 5B45
Done!

tags.dat\0x115F.render_model> exit

tags.dat> edit 1177
Tag 0x00001177.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1177.render_model> SpecifyShaders
Please enter the replacement 00001160 index: 5B41
Please enter the replacement 00001179 index: 5B42
Please enter the replacement 0000116B index: 5B45
Done!

tags.dat\0x1177.render_model> exit

tags.dat> edit 117B
Tag 0x0000117B.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x117B.render_model> SpecifyShaders
Please enter the replacement 00001160 index: 5B43
Please enter the replacement 00001179 index: 5B44
Please enter the replacement 0000116B index: 5B45
Done!

tags.dat\0x117B.render_model> exit

tags.dat> edit 20D9
Tag 0x000020D9.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x20D9.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B40
Please enter the replacement 0000101F index: 5B45
Please enter the replacement 0000101F index: 5B3F
Done!

tags.dat\0x20D9.render_model> exit

tags.dat> edit 2417
Tag 0x00002417.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2417.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B41
Please enter the replacement 0000101F index: 5B45
Please enter the replacement 0000101F index: 5B42
Done!

tags.dat\0x2417.render_model> exit

tags.dat> edit 241E
Tag 0x0000241E.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x241E.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B43
Please enter the replacement 0000101F index: 5B45
Please enter the replacement 0000101F index: 5B44
Done!

tags.dat\0x241E.render_model> exit

tags.dat> edit 5B40
Tag 0x00005B40.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B40.shader> SpecifyBitmaps
Please enter the base_map index: 5B3C
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B3D
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B3E
Done!

tags.dat\0x5B40.shader> exit

tags.dat> edit 5B41
Tag 0x00005B41.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B41.shader> SpecifyBitmaps
Please enter the base_map index: 5B3C
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B3D
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B3E
Done!

tags.dat\0x5B41.shader> exit

tags.dat> edit 5B43
Tag 0x00005B43.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B43.shader> SpecifyBitmaps
Please enter the base_map index: 5B3C
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B3D
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B3E
Done!

tags.dat\0x5B43.shader> exit

tags.dat> edit 5B45
Tag 0x00005B45.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B45.shader> SpecifyBitmaps
Please enter the base_map index: 5B3C
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B3D
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5B3E
Done!

tags.dat\0x5B45.shader> exit

tags.dat> edit 5B3F
Tag 0x00005B3F.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B3F.shader> edit ShaderProperties[0]

tags.dat\0x5B3F.shader\ShaderProperties[0]> SetField arguments[02].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B3F.shader\ShaderProperties[0]> SetField arguments[02].arg2 0.4
Arg2: Single = 0.4

tags.dat\0x5B3F.shader\ShaderProperties[0]> SetField arguments[02].arg3 0.0
Arg3: Single = 0

tags.dat\0x5B3F.shader\ShaderProperties[0]> SetField arguments[03].arg1 10
Arg1: Single = 10

tags.dat\0x5B3F.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B3F.shader\ShaderProperties[0]> exit

tags.dat\0x5B3F.shader> exit

tags.dat> edit 5B40
Tag 0x00005B40.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B40.shader> edit ShaderProperties[0]

tags.dat\0x5B40.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B40.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B40.shader\ShaderProperties[0]> SetField arguments[29].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B40.shader\ShaderProperties[0]> SetField arguments[28].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B40.shader\ShaderProperties[0]> SetField arguments[28].arg2 1.0
Arg2: Single = 1

tags.dat\0x5B40.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B40.shader\ShaderProperties[0]> SetField arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B40.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B40.shader\ShaderProperties[0]> exit

tags.dat\0x5B40.shader> exit

tags.dat> edit 5B41
Tag 0x00005B41.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B41.shader> edit ShaderProperties[0]

tags.dat\0x5B41.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B41.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B41.shader\ShaderProperties[0]> SetField arguments[29].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B41.shader\ShaderProperties[0]> SetField arguments[28].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B41.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x5B41.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B41.shader\ShaderProperties[0]> SetField arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B41.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B41.shader\ShaderProperties[0]> exit

tags.dat\0x5B41.shader> exit

tags.dat> edit 5B42
Tag 0x00005B42.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B42.shader> edit ShaderProperties[0]

tags.dat\0x5B42.shader\ShaderProperties[0]> SetField arguments[02].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B42.shader\ShaderProperties[0]> SetField arguments[02].arg2 0.0
Arg2: Single = 0

tags.dat\0x5B42.shader\ShaderProperties[0]> SetField arguments[02].arg3 0.0
Arg3: Single = 0

tags.dat\0x5B42.shader\ShaderProperties[0]> SetField arguments[03].arg1 10
Arg1: Single = 10

tags.dat\0x5B42.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B42.shader\ShaderProperties[0]> exit

tags.dat\0x5B42.shader> exit

tags.dat> edit 5B43
Tag 0x00005B43.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B43.shader> edit ShaderProperties[0]

tags.dat\0x5B43.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B43.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B43.shader\ShaderProperties[0]> SetField arguments[29].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B43.shader\ShaderProperties[0]> SetField arguments[28].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B43.shader\ShaderProperties[0]> SetField arguments[28].arg2 1.0
Arg2: Single = 1

tags.dat\0x5B43.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B43.shader\ShaderProperties[0]> SetField arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B43.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B43.shader\ShaderProperties[0]> exit

tags.dat\0x5B43.shader> exit

tags.dat> edit 5B44
Tag 0x00005B44.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B44.shader> edit ShaderProperties[0]

tags.dat\0x5B44.shader\ShaderProperties[0]> SetField arguments[02].arg1 0.00
Arg1: Single = 0

tags.dat\0x5B44.shader\ShaderProperties[0]> SetField arguments[02].arg2 1.0
Arg2: Single = 1

tags.dat\0x5B44.shader\ShaderProperties[0]> SetField arguments[02].arg3 0
Arg3: Single = 0

tags.dat\0x5B44.shader\ShaderProperties[0]> SetField arguments[03].arg1 10
Arg1: Single = 10

tags.dat\0x5B44.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B44.shader\ShaderProperties[0]> exit

tags.dat\0x5B44.shader> exit

tags.dat> edit 5B45
Tag 0x00005B45.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B45.shader> edit ShaderProperties[0]

tags.dat\0x5B45.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B45.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B45.shader\ShaderProperties[0]> SetField arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5B45.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B45.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x5B45.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B45.shader\ShaderProperties[0]> SetField arguments[06].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B45.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B45.shader\ShaderProperties[0]> exit

tags.dat\0x5B45.shader> exit

tags.dat> 

tags.dat> dumplog H3Magnum.log
