Tag Tool [1.0.6040.37850]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...23368 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 2:40 PM.
Reading stringIDs...39505 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B47
Unrecognized command: 5B47
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B48
Unrecognized command: 5B48
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B49
Unrecognized command: 5B49
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B4A
Unrecognized command: 5B4A
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B4B
Unrecognized command: 5B4B
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B4C
Unrecognized command: 5B4C
Use "help" to list available commands.

tags.dat> 21DA
Unrecognized command: 21DA
Use "help" to list available commands.

tags.dat> 21DA
Unrecognized command: 21DA
Use "help" to list available commands.

tags.dat> 21DC
Unrecognized command: 21DC
Use "help" to list available commands.

tags.dat> 21DC
Unrecognized command: 21DC
Use "help" to list available commands.

tags.dat> echo Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1) 
tags.dat> echo Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1) 
tags.dat> echo

tags.dat> echo

tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> 

tags.dat> SetLocale US

tags.dat> 

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B48 [Offset = 0x62A8150, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B49 [Offset = 0x62A81D0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B4A [Offset = 0x62A8250, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B4B [Offset = 0x62A82D0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B4C [Offset = 0x62A8350, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B4D [Offset = 0x62A83D0, Size = 0x80]

tags.dat> 

tags.dat> import 21DA tags/H3Flakfp.tag
Imported 0x890 bytes.

tags.dat> import 21DC tags/H3Flak3d.tag
Imported 0x930 bytes.

tags.dat> importmodelraw 21DA tags/H3Flakfp.raw
Writing tag data...
Model imported successfully!

tags.dat> importmodelraw 21DC tags/H3Flak3d.raw
Writing tag data...
Model imported successfully!

tags.dat> 

tags.dat> importbitmap 5B47 DDS/flak_cannon.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B47 [Offset = 0x62A7EF0, Size = 0x260]

tags.dat> importbitmap 5B48 DDS/flak_cannon_bump.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B48 [Offset = 0x62A8150, Size = 0x260]

tags.dat> importbitmap 5B49 DDS/flak_cannon_illum.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005B49 [Offset = 0x62A83B0, Size = 0x260]

tags.dat> import 5B4A tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5B4B tagTemplates/04F8_rmshTemplate
Imported 0x470 bytes.

tags.dat> import 5B4C tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> edit 21DA
Tag 0x000021DA.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x21DA.render_model> edit geometry.compression[0]

tags.dat\0x21DA.render_model\geometry\compression[0]> SetField TextureMinV 0
TextureMinV: Single = 0

tags.dat\0x21DA.render_model\geometry\compression[0]> SetField TextureMaxV -0.996
TextureMaxV: Single = -0.996

tags.dat\0x21DA.render_model\geometry\compression[0]> savechanges
Done!

tags.dat\0x21DA.render_model\geometry\compression[0]> exitTo tags.dat

tags.dat> edit 21DC
Tag 0x000021DC.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x21DC.render_model> edit geometry.compression[0]

tags.dat\0x21DC.render_model\geometry\compression[0]> SetField TextureMinV 0
TextureMinV: Single = 0

tags.dat\0x21DC.render_model\geometry\compression[0]> SetField TextureMaxV -0.996
TextureMaxV: Single = -0.996

tags.dat\0x21DC.render_model\geometry\compression[0]> savechanges
Done!

tags.dat\0x21DC.render_model\geometry\compression[0]> exitTo tags.dat

tags.dat> edit 21DA
Tag 0x000021DA.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x21DA.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B4C
Please enter the replacement 0000101F index: 5B4A
Please enter the replacement 0000101F index: 5B4B
Done!

tags.dat\0x21DA.render_model> exit

tags.dat> edit 21DC
Tag 0x000021DC.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x21DC.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 101F
Please enter the replacement 0000101F index: 5B4C
Please enter the replacement 0000101F index: 5B4A
Please enter the replacement 0000101F index: 5B4B
Done!

tags.dat\0x21DC.render_model> exit

tags.dat> edit 5B4A
Tag 0x00005B4A.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B4A.shader> SpecifyBitmaps
Please enter the base_map index: 5B47
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B48
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0EF7
Done!

tags.dat\0x5B4A.shader> exit

tags.dat> edit 5B4C
Tag 0x00005B4C.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B4C.shader> SpecifyBitmaps
Please enter the base_map index: 5B47
Please enter the detail_map index: 0343
Please enter the bump_map index: 5B48
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0EF7
Done!

tags.dat\0x5B4C.shader> exit

tags.dat> edit 5B4A
Tag 0x00005B4A.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B4A.shader> edit ShaderProperties[0]

tags.dat\0x5B4A.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B4A.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B4A.shader\ShaderProperties[0]> SetField arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5B4A.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B4A.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x5B4A.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B4A.shader\ShaderProperties[0]> SetField arguments[06].arg1 2.0
Arg1: Single = 2

tags.dat\0x5B4A.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B4A.shader\ShaderProperties[0]> exit

tags.dat\0x5B4A.shader> exit

tags.dat> edit 5B4B
Tag 0x00005B4B.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B4B.shader> edit ShaderProperties[0]

tags.dat\0x5B4B.shader\ShaderProperties[0]> SetField Arguments[04].Arg1 0.0
Arg1: Single = 0

tags.dat\0x5B4B.shader\ShaderProperties[0]> SetField Arguments[04].Arg2 1.0
Arg2: Single = 1

tags.dat\0x5B4B.shader\ShaderProperties[0]> SetField Arguments[04].Arg3 0
Arg3: Single = 0

tags.dat\0x5B4B.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B4B.shader\ShaderProperties[0]> exit

tags.dat\0x5B4B.shader> exit

tags.dat> edit 5B4C
Tag 0x00005B4C.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B4C.shader> edit ShaderProperties[0]

tags.dat\0x5B4C.shader\ShaderProperties[0]> SetField arguments[19].arg1 1.0
Arg1: Single = 1

tags.dat\0x5B4C.shader\ShaderProperties[0]> SetField arguments[16].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B4C.shader\ShaderProperties[0]> SetField arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5B4C.shader\ShaderProperties[0]> SetField arguments[28].arg1 0.0
Arg1: Single = 0

tags.dat\0x5B4C.shader\ShaderProperties[0]> SetField arguments[28].arg2 0.0
Arg2: Single = 0

tags.dat\0x5B4C.shader\ShaderProperties[0]> SetField arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B4C.shader\ShaderProperties[0]> SetField arguments[06].arg1 2.0
Arg1: Single = 2

tags.dat\0x5B4C.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B4C.shader\ShaderProperties[0]> exit

tags.dat\0x5B4C.shader> exit

tags.dat> 

tags.dat> dumplog H3FuelRod.log
