Tag Tool [1.0.6040.37850]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...23335 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 2:40 PM.
Reading stringIDs...39505 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmFlakbase
Unrecognized command: bitmFlakbase
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmFlakbump
Unrecognized command: bitmFlakbump
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> bitmFlakillu
Unrecognized command: bitmFlakillu
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadFlakDull
Unrecognized command: shadFlakDull
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadFlakIllu
Unrecognized command: shadFlakIllu
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> shadFlakMain
Unrecognized command: shadFlakMain
Use "help" to list available commands.

tags.dat> 21DA
Unrecognized command: 21DA
Use "help" to list available commands.

tags.dat> modeFlakfp
Unrecognized command: modeFlakfp
Use "help" to list available commands.

tags.dat> 21DC
Unrecognized command: 21DC
Use "help" to list available commands.

tags.dat> modeFlak3d
Unrecognized command: modeFlak3d
Use "help" to list available commands.

tags.dat> // Halo 3 weapon (local cosmetic) for Halo Online Eldewrito (ms23; Eldewrito 0.5.1.1)
Unrecognized command: //
Use "help" to list available commands.

tags.dat> ====
Unrecognized command: ====
Use "help" to list available commands.

tags.dat> echo

tags.dat> //
Unrecognized command: //
Use "help" to list available commands.

tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> 

tags.dat> SetLocale US

tags.dat> 

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B27 [Offset = 0x629A0A0, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B28 [Offset = 0x629A11C, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B29 [Offset = 0x629A198, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B2A [Offset = 0x629A214, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B2B [Offset = 0x629A290, Size = 0x7C]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: @ 00005B2C [Offset = 0x629A30C, Size = 0x7C]

tags.dat> 

tags.dat> import modeFlakfp tags/H3Flakfp.tag
import: Import a tag from a file

Usage:
import <tag index> <filename>

Use "help import" for more information.

tags.dat> import modeFlak3d tags/H3Flak3d.tag
import: Import a tag from a file

Usage:
import <tag index> <filename>

Use "help import" for more information.

tags.dat> importmodelraw modeFlakfp tags/H3Flakfp.raw
ERROR: Object reference not set to an instance of an object.

tags.dat> importmodelraw modeFlak3d tags/H3Flak3d.raw
ERROR: Object reference not set to an instance of an object.

tags.dat> 

tags.dat> importbitmap bitmFlakbase DDS/flak_cannon.dds
Loading textures.dat...
Importing image...
Creating a new tag...
ERROR: Object reference not set to an instance of an object.

tags.dat> importbitmap bitmFlakbump DDS/flak_cannon_bump.dds
Loading textures.dat...
Importing image...
Creating a new tag...
ERROR: Object reference not set to an instance of an object.

tags.dat> importbitmap bitmFlakillu DDS/flak_cannon_illum.dds
Loading textures.dat...
Importing image...
Creating a new tag...
ERROR: Object reference not set to an instance of an object.
